{
  "afghanistan": {
    "slug": "afghanistan",
    "name": "Afghanistan",
    "region": "Asia",
    "heroDescription": "Afghanistan is a land of rugged grandeur and ancient history, where the towering peaks of the Hindu Kush meet the vast, windswept deserts of the south. Once a vital crossroads of the Silk Road, it holds the echoes of empires in the minarets of Herat and the blue-tiled splendor of Mazar-i-Sharif. The culture is defined by a fierce spirit of hospitality and a rich tradition of poetry and craftsmanship that has endured through centuries of upheaval. For the intrepid soul, its landscapes offer a raw, untamed beauty that remains one of the world's most profound and untouched frontiers.",
    "placesToVisit": [
      {
        "name": "Kabul",
        "summary": "The high-altitude capital, a bustling mix of historic gardens and resilient urban life."
      },
      {
        "name": "Herat",
        "summary": "The cultural heart of the nation, famous for its Great Mosque and ancient citadel."
      }
    ],
    "travelTips": [
      "Respect local customs and dress modestly at all times.",
      "Hospitality is a core value; accepting tea is a sign of respect.",
      "The Afghani (AFN) is the local currency; cash is king outside major cities."
    ],
    "heroImage": {
      "src": "/images/countries/afghanistan/hero.jpg",
      "alt": "The rugged mountains of the Hindu Kush"
    }
  },
  "albania": {
    "slug": "albania",
    "name": "Albania",
    "region": "Europe",
    "heroDescription": "Albania is Europe's best-kept secret, a Mediterranean gem where the turquoise waters of the Ionian Sea meet the dramatic, jagged peaks of the Accursed Mountains. From the Ottoman-era stone houses of Gjirokastër and Berat to the vibrant, colorful streets of Tirana, the country offers a journey through layers of history and resilience. Its coastline, known as the Albanian Riviera, rivals any in the world with its pristine beaches and secluded coves, while the inland valleys remain steeped in ancient folklore. It is a place where tradition and modernity coexist, offering an authentic experience far from the well-trodden tourist paths.",
    "placesToVisit": [
      {
        "name": "Tirana",
        "summary": "A colorful capital known for its Ottoman, Fascist, and Soviet-era architecture."
      },
      {
        "name": "Theth",
        "summary": "A remote mountain village offering some of the most spectacular hiking in the Balkans."
      }
    ],
    "travelTips": [
      "Learning a few words of Albanian goes a long way with the friendly locals.",
      "The best time to visit the coast is June or September to avoid the summer crowds.",
      "The Lek (ALL) is the currency; many places in rural areas only accept cash."
    ],
    "heroImage": {
      "src": "/images/countries/albania/hero.jpg",
      "alt": "The turquoise waters of the Albanian Riviera"
    }
  },
  "algeria": {
    "slug": "algeria",
    "name": "Algeria",
    "region": "Africa",
    "heroDescription": "Algeria is a vast and diverse North African giant, stretching from the sun-drenched Mediterranean coast to the mystical, shifting sands of the Sahara. It is home to some of the world's best-preserved Roman ruins, such as Timgad and Djemila, which stand as silent witnesses to a grand imperial past. The Tassili n'Ajjer plateau offers a surreal lunar landscape of sandstone arches and prehistoric rock art, revealing a history that predates civilization itself. With its blend of French colonial architecture, vibrant souks, and deep Berber roots, Algeria is a destination of profound depth and quiet majesty.",
    "placesToVisit": [
      {
        "name": "Algiers",
        "summary": "The 'White City,' featuring a stunning Casbah and beautiful Mediterranean views."
      },
      {
        "name": "Constantine",
        "summary": "The 'City of Bridges,' dramatically perched on cliffs above a deep gorge."
      }
    ],
    "travelTips": [
      "French is widely spoken and very useful for navigating the country.",
      "Visiting the Sahara requires a guided tour and proper desert preparation.",
      "The Algerian Dinar (DZD) is the currency; be aware of the official vs. parallel exchange rates."
    ],
    "heroImage": {
      "src": "/images/countries/algeria/hero.jpg",
      "alt": "The ancient Roman ruins of Timgad"
    }
  },
  "andorra": {
    "slug": "andorra",
    "name": "Andorra",
    "region": "Europe",
    "heroDescription": "Nestled high in the Pyrenees between France and Spain, Andorra is a tiny principality defined by its soaring mountain peaks and deep, verdant valleys. Known for its world-class ski resorts and duty-free shopping, it also harbors a wealth of Romanesque churches and ancient stone villages that feel frozen in time. The Madriu-Perafita-Claror Valley, a UNESCO World Heritage site, offers breathtaking hiking trails through pristine alpine landscapes and traditional summer settlements. Despite its small size, Andorra provides a grand escape for nature lovers and those seeking the crisp, clean air of the high mountains.",
    "placesToVisit": [
      {
        "name": "Andorra la Vella",
        "summary": "The highest capital city in Europe, famous for its shopping and mountain backdrop."
      },
      {
        "name": "Ordino",
        "summary": "A charming parish known for its well-preserved traditional architecture and museums."
      }
    ],
    "travelTips": [
      "Andorra is a tax haven, making it great for high-end shopping.",
      "Catalan is the official language, but Spanish and French are widely understood.",
      "The Euro (EUR) is used, though Andorra is not officially in the Eurozone."
    ],
    "heroImage": {
      "src": "/images/countries/andorra/hero.jpg",
      "alt": "The snow-capped peaks of the Pyrenees"
    }
  },
  "angola": {
    "slug": "angola",
    "name": "Angola",
    "region": "Africa",
    "heroDescription": "Angola is a land of striking contrasts and immense natural beauty, where the Atlantic surf crashes against dramatic cliffs and the vast interior gives way to lush rainforests and arid plains. The Kalandula Falls, one of Africa's largest waterfalls, thunders with raw power, while the surreal rock formations of Pungo Andongo rise like giants from the earth. Luanda, the bustling capital, is a vibrant mix of Portuguese colonial heritage and modern African energy, reflecting a nation on the move. From the remote tribes of the Namibe Desert to the biodiversity of the Kissama National Park, Angola is a frontier of discovery for the truly adventurous.",
    "placesToVisit": [
      {
        "name": "Luanda",
        "summary": "A dynamic coastal capital with a beautiful bay and a lively music scene."
      },
      {
        "name": "Lubango",
        "summary": "Home to the dramatic Serra da Leba pass and the Christ the King statue."
      }
    ],
    "travelTips": [
      "Portuguese is the official language; English is not widely spoken.",
      "The Kwanza (AOA) is the currency; credit cards are only accepted in major hotels.",
      "Yellow fever vaccination is mandatory for entry into the country."
    ],
    "heroImage": {
      "src": "/images/countries/angola/hero.jpg",
      "alt": "The thundering Kalandula Falls"
    }
  },
  "antigua-and-barbuda": {
    "slug": "antiguabarbuda",
    "name": "Antigua and Barbuda",
    "region": "Americas",
    "heroDescription": "Antigua and Barbuda are the quintessential Caribbean twin-island paradise, boasting 365 beaches—one for every day of the year—of powdery white and rare pink sand. Antigua is famous for its sailing heritage and the historic Nelson's Dockyard, where colonial history meets a vibrant maritime culture. Barbuda, its quieter sibling, is a sanctuary of nature, home to the largest Frigate Bird colony in the Western Hemisphere and endless stretches of untouched coastline. Together, they offer a perfect blend of high-end luxury, nautical adventure, and the laid-back rhythm of island life under the tropical sun.",
    "placesToVisit": [
      {
        "name": "English Harbour",
        "summary": "The historic heart of Antigua, famous for its yachting culture and colonial forts."
      },
      {
        "name": "Codrington",
        "summary": "The main settlement on Barbuda, gateway to its pristine lagoons and bird sanctuaries."
      }
    ],
    "travelTips": [
      "Sailing is the best way to explore the many hidden coves of the islands.",
      "The Eastern Caribbean Dollar (XCD) is the currency, but USD is widely accepted.",
      "Hurricane season runs from June to November; plan your visit accordingly."
    ],
    "heroImage": {
      "src": "/images/countries/antiguabarbuda/hero.jpg",
      "alt": "A pristine white-sand beach in Antigua"
    }
  },
  "argentina": {
    "slug": "argentina",
    "name": "Argentina",
    "region": "Americas",
    "heroDescription": "Argentina is a land of epic proportions, stretching from the subtropical jungles of Iguazú Falls to the icy, wind-scoured plains of Patagonia. Buenos Aires, the 'Paris of the South,' captivates with its grand European architecture, passionate tango halls, and world-class culinary scene centered on the legendary asado. In the west, the Andes mountains provide a dramatic backdrop to the high-altitude vineyards of Mendoza, where some of the world's finest Malbecs are produced. Whether exploring the Perito Moreno Glacier or the colorful hills of Salta, travelers find a country of immense spirit and breathtaking natural diversity.",
    "placesToVisit": [
      {
        "name": "Buenos Aires",
        "summary": "A sophisticated capital city famous for its culture, nightlife, and steak."
      },
      {
        "name": "El Calafate",
        "summary": "The gateway to the Los Glaciares National Park and the Perito Moreno Glacier."
      }
    ],
    "travelTips": [
      "Dinner starts late in Argentina, often after 9:00 PM.",
      "The Argentine Peso (ARS) is volatile; many travelers use the 'Blue Dollar' exchange.",
      "Domestic flights are the most efficient way to cover the country's vast distances."
    ],
    "heroImage": {
      "src": "/images/countries/argentina/hero.jpg",
      "alt": "The majestic Perito Moreno Glacier"
    }
  },
  "armenia": {
    "slug": "armenia",
    "name": "Armenia",
    "region": "Asia",
    "heroDescription": "Armenia is an ancient land of stone and spirit, where the silhouette of Mount Ararat looms over a landscape dotted with some of the world's oldest Christian monasteries. From the pagan temple of Garni to the cliffside majesty of Tatev, the country is a living museum of faith and endurance. Yerevan, the 'Pink City,' is a vibrant capital built from volcanic tuff, offering a lively atmosphere of outdoor cafes and rich cultural institutions. With its rugged mountains, deep canyons, and the shimmering blue waters of Lake Sevan, Armenia provides a soulful journey through the very cradle of civilization.",
    "placesToVisit": [
      {
        "name": "Yerevan",
        "summary": "A vibrant capital city with a rich history and a lively cafe culture."
      },
      {
        "name": "Dilijan",
        "summary": "Known as the 'Little Switzerland' of Armenia, famous for its lush forests and monasteries."
      }
    ],
    "travelTips": [
      "Armenia is one of the safest countries in the world for solo travelers.",
      "The Armenian Dram (AMD) is the currency; ATMs are plentiful in cities.",
      "Don't miss a traditional 'khorovats' (barbecue) during your stay."
    ],
    "heroImage": {
      "src": "/images/countries/armenia/hero.jpg",
      "alt": "The ancient monastery of Khor Virap with Mount Ararat"
    }
  },
  "australia": {
    "slug": "australia",
    "name": "Australia",
    "region": "Oceania",
    "heroDescription": "Australia is a continent of staggering variety, where cosmopolitan cities like Sydney and Melbourne give way to the ancient, red heart of the Outback. The Great Barrier Reef offers an unparalleled underwater world of coral and marine life, while the tropical rainforests of the Daintree harbor species found nowhere else on Earth. Along the coast, iconic surf breaks and pristine white-sand beaches define a lifestyle deeply connected to the ocean. From the sacred monolith of Uluru to the rugged beauty of the Great Ocean Road, Australia is a land of vast horizons and a unique, laid-back spirit that beckons explorers.",
    "placesToVisit": [
      {
        "name": "Sydney",
        "summary": "Famous for its Opera House, Harbour Bridge, and world-class beaches."
      },
      {
        "name": "Uluru",
        "summary": "The spiritual heart of the Outback, a massive sandstone monolith sacred to the Anangu."
      }
    ],
    "travelTips": [
      "The sun is very strong in Australia; always wear high-SPF sunscreen.",
      "Tipping is not expected but appreciated for exceptional service.",
      "The Australian Dollar (AUD) is the currency; contactless payment is used everywhere."
    ],
    "heroImage": {
      "src": "/images/countries/australia/hero.jpg",
      "alt": "The iconic Sydney Opera House at sunset"
    }
  },
  "austria": {
    "slug": "austria",
    "name": "Austria",
    "region": "Europe",
    "heroDescription": "Austria is a symphony of alpine peaks, crystalline lakes, and imperial grandeur, where the echoes of Mozart and Beethoven still resonate through the streets of Vienna and Salzburg. The Austrian Alps provide a playground for winter sports and summer hiking, with charming timber-framed villages nestled in emerald valleys. Vienna's coffee house culture and opulent palaces reflect a rich Habsburg heritage, while the lake district of Salzkammergut offers postcard-perfect scenery. It is a country that balances high culture with a deep love for nature, providing an elegant and invigorating escape in the heart of Europe.",
    "placesToVisit": [
      {
        "name": "Vienna",
        "summary": "A grand capital city famous for its music, art, and coffee house culture."
      },
      {
        "name": "Hallstatt",
        "summary": "A fairytale lakeside village nestled in the heart of the Alps."
      }
    ],
    "travelTips": [
      "Sundays are quiet in Austria; most shops and supermarkets are closed.",
      "The Euro (EUR) is the currency; cash is still preferred in some smaller cafes.",
      "Public transport is exceptionally efficient and the best way to travel between cities."
    ],
    "heroImage": {
      "src": "/images/countries/austria/hero.jpg",
      "alt": "The fairytale village of Hallstatt"
    }
  },
  "azerbaijan": {
    "slug": "azerbaijan",
    "name": "Azerbaijan",
    "region": "Asia",
    "heroDescription": "Azerbaijan, the 'Land of Fire,' is a fascinating bridge between East and West, where ancient Silk Road history meets futuristic architecture. The capital, Baku, features the UNESCO-listed Old City alongside the iconic Flame Towers, reflecting a nation fueled by oil wealth and cultural ambition. In the rural interior, the Caucasus Mountains hide remote villages like Xinaliq, while the mud volcanoes of Gobustan offer a surreal, bubbling landscape. From the burning hills of Yanar Dag to the lush forests of Quba, Azerbaijan is a destination of unexpected contrasts and deep-rooted Caucasian hospitality.",
    "placesToVisit": [
      {
        "name": "Baku",
        "summary": "A mix of ancient history and futuristic skyscrapers on the Caspian Sea."
      },
      {
        "name": "Sheki",
        "summary": "Famous for its ornate Khan's Palace and its Silk Road heritage."
      }
    ],
    "travelTips": [
      "The e-visa process is straightforward and should be done in advance.",
      "Baku is very modern, but dress more conservatively when visiting rural areas.",
      "The Manat (AZN) is the currency; credit cards are widely used in the capital."
    ],
    "heroImage": {
      "src": "/images/countries/azerbaijan/hero.jpg",
      "alt": "The futuristic Flame Towers of Baku"
    }
  },
  "bahamas": {
    "slug": "bahamas",
    "name": "Bahamas",
    "region": "Americas",
    "heroDescription": "The Bahamas is an archipelago of over 700 islands and cays, scattered across the world's clearest turquoise waters like a string of pearls. Beyond the bustling resorts of Nassau and Paradise Island lie the 'Out Islands,' where life moves at a slower pace and nature takes center stage. The Exumas are famous for their swimming pigs and vibrant coral reefs, while Eleuthera and Harbour Island boast stunning pink-sand beaches and colonial charm. It is a premier destination for diving, fishing, and sailing, offering a tropical sanctuary that ranges from high-end luxury to secluded, untouched wilderness.",
    "placesToVisit": [
      {
        "name": "Nassau",
        "summary": "The vibrant capital, known for its colonial history and busy straw markets."
      },
      {
        "name": "The Exumas",
        "summary": "A chain of islands famous for their sapphire waters and swimming pigs."
      }
    ],
    "travelTips": [
      "Island hopping by small plane or boat is the best way to see the Out Islands.",
      "The Bahamian Dollar (BSD) is pegged 1:1 with the USD, which is also accepted.",
      "Hurricane season is June to November; the best weather is December to April."
    ],
    "heroImage": {
      "src": "/images/countries/bahamas/hero.jpg",
      "alt": "The crystal-clear waters of the Exumas"
    }
  },
  "bahrain": {
    "slug": "bahrain",
    "name": "Bahrain",
    "region": "Asia",
    "heroDescription": "Bahrain is a modern island kingdom with a history that stretches back over 5,000 years to the ancient Dilmun civilization. The Bahrain Fort, a UNESCO World Heritage site, stands as a sentinel over the Arabian Gulf, while the bustling Manama Souq offers a sensory journey through spices, gold, and textiles. Unlike its more conservative neighbors, Bahrain is known for its liberal atmosphere and vibrant social scene, centered around the modern skyline of its capital. From the Tree of Life in the desert to the traditional pearl diving heritage, it is a place where tradition and progress meet in a compact, welcoming archipelago.",
    "placesToVisit": [
      {
        "name": "Manama",
        "summary": "A modern capital city with a rich history and a vibrant culinary scene."
      },
      {
        "name": "Muharraq",
        "summary": "The former capital, famous for its traditional architecture and pearling path."
      }
    ],
    "travelTips": [
      "Bahrain is relatively liberal, but respect local customs in religious areas.",
      "The Bahraini Dinar (BHD) is one of the world's highest-valued currencies.",
      "The best time to visit is during the cooler months from November to March."
    ],
    "heroImage": {
      "src": "/images/countries/bahrain/hero.jpg",
      "alt": "The historic Bahrain Fort at sunset"
    }
  },
  "bangladesh": {
    "slug": "bangladesh",
    "name": "Bangladesh",
    "region": "Asia",
    "heroDescription": "Bangladesh is a land of rivers and resilience, where the vast delta of the Ganges and Brahmaputra creates a landscape of lush greenery and intricate waterways. The Sundarbans, the world's largest mangrove forest, is the mysterious home of the Royal Bengal Tiger and a UNESCO-protected wilderness. In the south, Cox's Bazar boasts the world's longest natural sandy beach, while the tea gardens of Sylhet offer rolling hills of emerald green. Despite its high population density, the country is defined by the warmth of its people and a rich cultural tapestry of music, art, and ancient archaeological sites like Paharpur.",
    "placesToVisit": [
      {
        "name": "Dhaka",
        "summary": "A chaotic and energetic capital city with a rich history and vibrant markets."
      },
      {
        "name": "The Sundarbans",
        "summary": "A vast mangrove forest and a sanctuary for the Royal Bengal Tiger."
      }
    ],
    "travelTips": [
      "Be prepared for crowds and traffic in Dhaka; patience is essential.",
      "The Bangladeshi Taka (BDT) is the currency; cash is necessary for most transactions.",
      "The best time to visit is during the dry, cool season from October to March."
    ],
    "heroImage": {
      "src": "/images/countries/bangladesh/hero.jpg",
      "alt": "The lush waterways of the Sundarbans"
    }
  },
  "barbados": {
    "slug": "barbados",
    "name": "Barbados",
    "region": "Americas",
    "heroDescription": "Barbados is the sophisticated jewel of the Caribbean, blending British colonial heritage with a vibrant, rhythmic Bajan soul. The island's west coast, known as the Platinum Coast, is lined with luxury resorts and calm, turquoise waters, while the rugged east coast offers dramatic Atlantic surf and limestone cliffs. Bridgetown, the historic capital, is a UNESCO World Heritage site filled with colonial architecture and the world's oldest rum distillery. From the underground wonders of Harrison's Cave to the lively Friday night fish fry at Oistins, Barbados offers a complete island experience of elegance, adventure, and warmth.",
    "placesToVisit": [
      {
        "name": "Bridgetown",
        "summary": "A historic capital city with a rich colonial heritage and duty-free shopping."
      },
      {
        "name": "Bathsheba",
        "summary": "A rugged and beautiful village on the east coast, famous for its surfing."
      }
    ],
    "travelTips": [
      "The local bus system (the 'yellow buses') is an experience in itself.",
      "The Barbadian Dollar (BBD) is pegged 2:1 with the USD, which is widely accepted.",
      "Don't miss the Friday night Fish Fry at Oistins for an authentic Bajan experience."
    ],
    "heroImage": {
      "src": "/images/countries/barbados/hero.jpg",
      "alt": "The turquoise waters of the Platinum Coast"
    }
  },
  "belarus": {
    "slug": "belarus",
    "name": "Belarus",
    "region": "Europe",
    "heroDescription": "Belarus is a land of deep forests and tranquil lakes, often referred to as the 'Lungs of Europe' for its vast, untouched wilderness. The Belovezhskaya Pushcha National Park is home to the majestic European bison and some of the continent's oldest primeval woodlands. Its history is etched into the grand Soviet-style architecture of Minsk and the medieval fortresses of Mir and Nesvizh, both UNESCO World Heritage sites. Despite its complex political history, the country offers a quiet, contemplative beauty and a rich tradition of folklore and craftsmanship that remains largely undiscovered by the wider world.",
    "placesToVisit": [
      {
        "name": "Minsk",
        "summary": "A clean and grand capital city with impressive Soviet-era architecture."
      },
      {
        "name": "Mir Castle",
        "summary": "A stunning 16th-century fortress and a UNESCO World Heritage site."
      }
    ],
    "travelTips": [
      "Check the latest visa requirements; many nationalities can enter visa-free via Minsk airport.",
      "The Belarusian Ruble (BYN) is the currency; credit cards are widely accepted in cities.",
      "Russian and Belarusian are the official languages; English is limited outside Minsk."
    ],
    "heroImage": {
      "src": "/images/countries/belarus/hero.jpg",
      "alt": "The majestic Mir Castle"
    }
  },
  "belgium": {
    "slug": "belgium",
    "name": "Belgium",
    "region": "Europe",
    "heroDescription": "Belgium is a compact European powerhouse of art, history, and culinary indulgence, where medieval belfries overlook cobblestone squares and world-class chocolate shops. Brussels, the heart of Europe, is a cosmopolitan hub of grand architecture and surrealist art, while Bruges and Ghent offer a fairytale journey through winding canals and Gothic cathedrals. The country is a pilgrimage site for beer lovers, boasting hundreds of unique brews and a deep-seated cafe culture. From the somber battlefields of Flanders to the rolling hills of the Ardennes, Belgium provides a rich and varied experience that belies its modest size.",
    "placesToVisit": [
      {
        "name": "Bruges",
        "summary": "The 'Venice of the North,' a perfectly preserved medieval city of canals."
      },
      {
        "name": "Ghent",
        "summary": "A vibrant university city with a stunning historic center and a lively arts scene."
      }
    ],
    "travelTips": [
      "Belgium has three official languages: Dutch, French, and German.",
      "The train network is excellent and the best way to travel between cities.",
      "The Euro (EUR) is the currency; tipping is not mandatory as service is included."
    ],
    "heroImage": {
      "src": "/images/countries/belgium/hero.jpg",
      "alt": "The picturesque canals of Bruges"
    }
  },
  "belize": {
    "slug": "belize",
    "name": "Belize",
    "region": "Americas",
    "heroDescription": "Belize is a Caribbean paradise with a Central American soul, home to the second-largest barrier reef in the world and a vast network of ancient Maya ruins. The Great Blue Hole is a legendary destination for divers, while the offshore cayes offer a laid-back 'island time' atmosphere and pristine turquoise waters. Inland, the dense jungles of the Cayo District hide spectacular caves, cascading waterfalls, and the towering pyramids of Caracol and Xunantunich. With its unique blend of Creole, Maya, and Garifuna cultures, Belize is a biodiversity hotspot that offers endless adventure both above and below the water.",
    "placesToVisit": [
      {
        "name": "Caye Caulker",
        "summary": "A laid-back island with a 'go slow' motto and world-class snorkeling."
      },
      {
        "name": "San Ignacio",
        "summary": "The gateway to the Maya ruins and adventure activities of the Cayo District."
      }
    ],
    "travelTips": [
      "English is the official language, making it very easy for many travelers.",
      "The Belize Dollar (BZD) is pegged 2:1 with the USD, which is widely accepted.",
      "The best time to visit is during the dry season from December to May."
    ],
    "heroImage": {
      "src": "/images/countries/belize/hero.jpg",
      "alt": "The stunning Great Blue Hole from above"
    }
  },
  "benin": {
    "slug": "benin",
    "name": "Benin",
    "region": "Africa",
    "heroDescription": "Benin is the vibrant cradle of Voodoo and a land of profound historical significance, once the site of the powerful Kingdom of Dahomey. The stilt village of Ganvié, known as the 'Venice of Africa,' sits peacefully on Lake Nokoué, while the Royal Palaces of Abomey tell stories of warrior kings and ancient traditions. Along the coast, Ouidah serves as a somber reminder of the transatlantic slave trade and a center for spiritual pilgrimage. From the rugged hills of the north to the palm-fringed beaches of the south, Benin offers an authentic and deeply spiritual journey into the heart of West African culture.",
    "placesToVisit": [
      {
        "name": "Ganvié",
        "summary": "A unique stilt village on Lake Nokoué, home to over 30,000 people."
      },
      {
        "name": "Ouidah",
        "summary": "The spiritual heart of Voodoo and a historic center of the slave trade."
      }
    ],
    "travelTips": [
      "French is the official language; learning basic phrases is highly recommended.",
      "The West African CFA Franc (XOF) is the currency; cash is essential.",
      "Respect local spiritual traditions; always ask before taking photos of people or shrines."
    ],
    "heroImage": {
      "src": "/images/countries/benin/hero.jpg",
      "alt": "The stilt houses of Ganvié"
    }
  },
  "bhutan": {
    "slug": "bhutan",
    "name": "Bhutan",
    "region": "Asia",
    "heroDescription": "Bhutan, the 'Land of the Thunder Dragon,' is a secluded Himalayan kingdom where Gross National Happiness is prioritized over material wealth. It is a place of breathtaking mountain vistas, where ancient monasteries like the Tiger's Nest cling precariously to sheer cliffs above emerald valleys. The country's commitment to preserving its unique Buddhist culture and pristine environment is evident in its traditional architecture and vibrant festivals. From the high-altitude trekking routes to the peaceful prayer flags fluttering in the wind, Bhutan offers a spiritual and serene escape that feels worlds away from the modern pace of life.",
    "placesToVisit": [
      {
        "name": "Paro",
        "summary": "Home to the iconic Tiger's Nest monastery and a beautiful valley."
      },
      {
        "name": "Thimphu",
        "summary": "The unique capital city, a blend of traditional culture and modern life."
      }
    ],
    "travelTips": [
      "Bhutan has a 'High Value, Low Impact' tourism policy with a daily sustainable development fee.",
      "The Ngultrum (BTN) is the currency, pegged to the Indian Rupee, which is also accepted.",
      "The best time to visit is during the spring (March-May) or autumn (September-November)."
    ],
    "heroImage": {
      "src": "/images/countries/bhutan/hero.jpg",
      "alt": "The iconic Tiger's Nest monastery"
    }
  },
  "bolivia": {
    "slug": "bolivia",
    "name": "Bolivia",
    "region": "Americas",
    "heroDescription": "Bolivia is a land of extremes and indigenous pride, home to the world's highest navigable lake, Titicaca, and the surreal, blindingly white expanse of the Salar de Uyuni. The administrative capital, La Paz, sits in a dramatic mountain bowl, where cable cars soar over a maze of colorful markets and colonial streets. In the lowlands, the Amazon basin offers a wild frontier of biodiversity, while the silver mines of Potosí tell a story of colonial wealth and hardship. With its vibrant Andean traditions and some of the most dramatic landscapes on the planet, Bolivia is a destination for the truly adventurous and culturally curious.",
    "placesToVisit": [
      {
        "name": "Salar de Uyuni",
        "summary": "The world's largest salt flat, offering surreal landscapes and mirror effects."
      },
      {
        "name": "La Paz",
        "summary": "A high-altitude capital city with a unique cable car system and vibrant markets."
      }
    ],
    "travelTips": [
      "Altitude sickness is a real concern; take time to acclimatize in La Paz or Sucre.",
      "The Boliviano (BOB) is the currency; cash is necessary for most transactions.",
      "The best time to see the mirror effect on the salt flats is during the rainy season (Jan-Mar)."
    ],
    "heroImage": {
      "src": "/images/countries/bolivia/hero.jpg",
      "alt": "The surreal Salar de Uyuni salt flats"
    }
  },
  "bosnia-and-herzegovina": {
    "slug": "bosniaherzegovina",
    "name": "Bosnia and Herzegovina",
    "region": "Europe",
    "heroDescription": "Bosnia and Herzegovina is a heart-shaped land where East meets West, characterized by its rugged Dinaric Alps and a complex, multi-layered history. The historic bridge of Mostar and the vibrant, resilient streets of Sarajevo reflect a blend of Ottoman, Austro-Hungarian, and Slavic influences. Beyond the cities, the country offers spectacular natural beauty, from the turquoise waters of the Una River to the primeval forests of Perućica. It is a place of profound hospitality and deep cultural richness, where the scars of the past are met with a forward-looking spirit and a landscape that invites exploration and reflection.",
    "placesToVisit": [
      {
        "name": "Sarajevo",
        "summary": "A resilient and beautiful capital city with a rich multi-cultural history."
      },
      {
        "name": "Mostar",
        "summary": "Famous for its iconic Ottoman-era bridge and its charming old town."
      }
    ],
    "travelTips": [
      "The Convertible Mark (BAM) is the currency; it is pegged to the Euro.",
      "Respect the country's complex history; locals are generally open but sensitive.",
      "The tap water is safe to drink and often comes from mountain springs."
    ],
    "heroImage": {
      "src": "/images/countries/bosniaherzegovina/hero.jpg",
      "alt": "The iconic Stari Most bridge in Mostar"
    }
  },
  "botswana": {
    "slug": "botswana",
    "name": "Botswana",
    "region": "Africa",
    "heroDescription": "Botswana is a premier safari destination, defined by the unique inland delta of the Okavango and the vast, arid expanse of the Kalahari Desert. The Okavango Delta, a UNESCO World Heritage site, is a labyrinth of lagoons and channels that teems with wildlife, offering an intimate experience of nature from a traditional mokoro canoe. Chobe National Park is home to one of the largest concentrations of elephants in Africa, while the Makgadikgadi Salt Pans provide a surreal and hauntingly beautiful landscape. Committed to high-value, low-impact tourism, Botswana offers some of the most exclusive and pristine wilderness experiences on the continent.",
    "placesToVisit": [
      {
        "name": "Okavango Delta",
        "summary": "A unique inland delta and a sanctuary for a vast array of wildlife."
      },
      {
        "name": "Chobe National Park",
        "summary": "Famous for its massive elephant herds and spectacular river safaris."
      }
    ],
    "travelTips": [
      "The Pula (BWP) is the currency; credit cards are accepted in major lodges.",
      "The best time for wildlife viewing is during the dry season from May to October.",
      "Botswana is one of the safest and most stable countries in Africa."
    ],
    "heroImage": {
      "src": "/images/countries/botswana/hero.jpg",
      "alt": "Wildlife in the Okavango Delta"
    }
  },
  "brazil": {
    "slug": "brazil",
    "name": "Brazil",
    "region": "Americas",
    "heroDescription": "Brazil is a continental giant of irrepressible energy, from the rhythmic pulse of Rio de Janeiro's Carnival to the vast, mysterious depths of the Amazon rainforest. Its coastline stretches for thousands of miles, offering everything from the iconic sands of Copacabana to the secluded, turquoise lagoons of Lençóis Maranhenses. In the south, the thundering Iguazú Falls provide a spectacle of nature's raw power, while the colonial towns of Minas Gerais offer a journey into the country's gold-rush past. With its diverse culture, passionate people, and unparalleled biodiversity, Brazil is a destination that captivates the senses and the soul.",
    "placesToVisit": [
      {
        "name": "Rio de Janeiro",
        "summary": "A vibrant coastal city famous for its beaches, Carnival, and Christ the Redeemer."
      },
      {
        "name": "Iguazu Falls",
        "summary": "One of the world's most spectacular waterfall systems, on the border with Argentina."
      }
    ],
    "travelTips": [
      "Portuguese is the language; English is limited outside major tourist hubs.",
      "The Real (BRL) is the currency; credit cards are widely used in cities.",
      "Be mindful of safety in large cities; stick to well-lit and busy areas."
    ],
    "heroImage": {
      "src": "/images/countries/brazil/hero.jpg",
      "alt": "The iconic Christ the Redeemer overlooking Rio"
    }
  },
  "brunei-darussalam": {
    "slug": "bruneidarussalam",
    "name": "Brunei Darussalam",
    "region": "Asia",
    "heroDescription": "Brunei is a small, oil-rich sultanate on the island of Borneo, where golden-domed mosques and opulent palaces contrast with pristine, ancient rainforests. The capital, Bandar Seri Begawan, is home to the stunning Omar Ali Saifuddien Mosque and the sprawling water village of Kampong Ayer, the largest of its kind in the world. Much of the country remains covered in untouched tropical jungle, protected within the Ulu Temburong National Park, offering a sanctuary for unique Bornean wildlife. It is a place of quiet wealth and traditional Malay values, providing a serene and orderly escape in the heart of Southeast Asia.",
    "placesToVisit": [
      {
        "name": "Bandar Seri Begawan",
        "summary": "The capital city, home to stunning mosques and the Kampong Ayer water village."
      },
      {
        "name": "Ulu Temburong National Park",
        "summary": "A pristine rainforest sanctuary accessible only by longboat."
      }
    ],
    "travelTips": [
      "Brunei is a dry country; alcohol is not sold, though non-Muslims have a limited allowance.",
      "The Brunei Dollar (BND) is pegged to the Singapore Dollar, which is also accepted.",
      "Dress modestly when visiting mosques and public buildings."
    ],
    "heroImage": {
      "src": "/images/countries/bruneidarussalam/hero.jpg",
      "alt": "The stunning Omar Ali Saifuddien Mosque"
    }
  },
  "bulgaria": {
    "slug": "bulgaria",
    "name": "Bulgaria",
    "region": "Europe",
    "heroDescription": "Bulgaria is a land of ancient civilizations and diverse landscapes, where the sun-drenched beaches of the Black Sea meet the rugged, snow-capped peaks of the Balkan and Rila mountains. The country's history is visible in the Thracian tombs, Roman amphitheaters, and the medieval majesty of the Rila Monastery. Sofia, the capital, is a vibrant mix of onion-domed churches and Soviet-era monuments, while the historic town of Plovdiv is one of the oldest continuously inhabited cities in Europe. From the fragrant Rose Valley to the world-class ski resorts of Bansko, Bulgaria offers a rich tapestry of culture, nature, and affordability.",
    "placesToVisit": [
      {
        "name": "Sofia",
        "summary": "A vibrant capital city with a rich history and a mix of architectural styles."
      },
      {
        "name": "Plovdiv",
        "summary": "One of Europe's oldest cities, famous for its Roman ruins and charming old town."
      }
    ],
    "travelTips": [
      "Bulgaria uses the Cyrillic alphabet; learning to read signs is helpful.",
      "The Lev (BGN) is the currency; it is pegged to the Euro.",
      "Tipping is common in restaurants, usually around 10%."
    ],
    "heroImage": {
      "src": "/images/countries/bulgaria/hero.jpg",
      "alt": "The majestic Rila Monastery"
    }
  },
  "burkina-faso": {
    "slug": "burkinafaso",
    "name": "Burkina Faso",
    "region": "Africa",
    "heroDescription": "Burkina Faso, the 'Land of Honest People,' is a West African nation known for its vibrant arts scene and the warm hospitality of its diverse ethnic groups. The capital, Ouagadougou, hosts FESPACO, Africa's largest film festival, reflecting a deep cultural commitment to storytelling and creativity. In the south, the unique painted houses of Tiébélé showcase the artistic heritage of the Kassena people, while the peaks of Sindou offer dramatic, wind-sculpted sandstone formations. Despite its challenges, the country remains a hub of West African music and craftsmanship, offering a raw and authentic experience for those seeking to understand the heart of the Sahel.",
    "placesToVisit": [
      {
        "name": "Ouagadougou",
        "summary": "The energetic capital city, a hub for West African film and music."
      },
      {
        "name": "Tiébélé",
        "summary": "Famous for the intricately painted traditional houses of the Kassena people."
      }
    ],
    "travelTips": [
      "French is the official language; basic phrases are essential for travel.",
      "The West African CFA Franc (XOF) is the currency; cash is king.",
      "Check the latest travel advisories due to security concerns in some regions."
    ],
    "heroImage": {
      "src": "/images/countries/burkinafaso/hero.jpg",
      "alt": "The unique painted houses of Tiébélé"
    }
  },
  "burundi": {
    "slug": "burundi",
    "name": "Burundi",
    "region": "Africa",
    "heroDescription": "Burundi is a small, mountainous nation in the heart of Africa's Great Lakes region, often called the 'Heart of Africa' for its shape and central location. It is a land of rolling green hills, coffee plantations, and the shimmering waters of Lake Tanganyika, the world's longest freshwater lake. The country is famous for its traditional drummers, whose rhythmic performances are a powerful expression of Burundian culture and history. From the white-sand beaches of Bujumbura to the misty forests of Kibira National Park, Burundi offers a landscape of quiet beauty and a people known for their resilience and welcoming spirit.",
    "placesToVisit": [
      {
        "name": "Bujumbura",
        "summary": "The former capital, located on the shores of Lake Tanganyika with beautiful beaches."
      },
      {
        "name": "Gitega",
        "summary": "The political capital, home to the national museum and traditional drummers."
      }
    ],
    "travelTips": [
      "French and Kirundi are the official languages; English is limited.",
      "The Burundian Franc (BIF) is the currency; cash is necessary.",
      "The best time to visit is during the dry seasons (June-August and December-January)."
    ],
    "heroImage": {
      "src": "/images/countries/burundi/hero.jpg",
      "alt": "The shores of Lake Tanganyika in Burundi"
    }
  },
  "cabo-verde": {
    "slug": "caboverde",
    "name": "Cabo Verde",
    "region": "Africa",
    "heroDescription": "Cabo Verde is a volcanic archipelago of ten islands scattered across the Atlantic, where African rhythms meet Portuguese colonial heritage. Each island offers a different world, from the lunar landscapes and towering peak of Fogo to the wind-swept dunes and turquoise waters of Boa Vista and Sal. The culture is defined by 'morabeza'—a unique brand of hospitality—and the soulful sounds of Morna music, made famous by Cesária Évora. Whether hiking the rugged mountains of Santo Antão or relaxing on the pristine beaches of Maio, travelers find a sanctuary of peace and a vibrant, island spirit.",
    "placesToVisit": [
      {
        "name": "Sal",
        "summary": "The most popular island, famous for its white-sand beaches and salt mines."
      },
      {
        "name": "Santo Antão",
        "summary": "A hiker's paradise of dramatic canyons and lush, terraced valleys."
      }
    ],
    "travelTips": [
      "The local currency is the Cape Verdean Escudo (CVE), but Euros are often accepted.",
      "Internal flights or ferries are necessary to travel between the islands.",
      "The best time to visit for windsurfing and kiteboarding is from November to March."
    ],
    "heroImage": {
      "src": "/images/countries/caboverde/hero.jpg",
      "alt": "The volcanic landscape of Fogo island"
    }
  },
  "cambodia": {
    "slug": "cambodia",
    "name": "Cambodia",
    "region": "Asia",
    "heroDescription": "Cambodia is a land of ancient wonders and resilient spirit, home to the monumental temple complex of Angkor Wat, the largest religious monument in the world. Beyond the stone faces of Bayon and the jungle-clad ruins of Ta Prohm, the country offers a landscape of emerald rice paddies, floating villages on the Tonlé Sap, and the pristine beaches of the southern islands. The capital, Phnom Penh, is a city of contrasts, where grand colonial architecture sits alongside somber reminders of the Khmer Rouge era. It is a destination of profound history and gentle hospitality that leaves a lasting impression on every traveler.",
    "placesToVisit": [
      {
        "name": "Siem Reap",
        "summary": "The gateway to the magnificent temples of the Angkor Archaeological Park."
      },
      {
        "name": "Koh Rong",
        "summary": "A tropical island paradise with white-sand beaches and turquoise waters."
      }
    ],
    "travelTips": [
      "The US Dollar (USD) is the de facto currency; the Cambodian Riel (KHR) is used for small change.",
      "Dress modestly when visiting temples; shoulders and knees must be covered.",
      "A multi-day pass for Angkor Wat is highly recommended to see the major sites."
    ],
    "heroImage": {
      "src": "/images/countries/cambodia/hero.jpg",
      "alt": "The iconic spires of Angkor Wat at sunrise"
    }
  },
  "cameroon": {
    "slug": "cameroon",
    "name": "Cameroon",
    "region": "Africa",
    "heroDescription": "Cameroon is often called 'Africa in Miniature' because it contains all the continent's major landscapes: from the Sahelian deserts of the north to the lush rainforests of the south and the volcanic peaks of the west. Mount Cameroon, one of Africa's largest active volcanoes, towers over the Atlantic coast, where the black-sand beaches of Limbe meet the surf. The country's cultural diversity is equally impressive, with over 200 ethnic groups and a rich tradition of music, art, and ancient kingdoms in the Grassfields region. It is a wild and authentic frontier for those seeking the true heart of the African continent.",
    "placesToVisit": [
      {
        "name": "Kribi",
        "summary": "A beautiful coastal town famous for its white-sand beaches and waterfalls that flow into the sea."
      },
      {
        "name": "Foumban",
        "summary": "The cultural capital of the Bamum people, known for its palace and traditional crafts."
      }
    ],
    "travelTips": [
      "Cameroon is bilingual (French and English), though French is more widely spoken.",
      "The Central African CFA Franc (XAF) is the currency; cash is essential.",
      "The best time to visit is during the dry season from November to February."
    ],
    "heroImage": {
      "src": "/images/countries/cameroon/hero.jpg",
      "alt": "The lush landscapes of the Cameroon highlands"
    }
  },
  "canada": {
    "slug": "canada",
    "name": "Canada",
    "region": "Americas",
    "heroDescription": "Canada is a land of staggering natural beauty and vast, open spaces, stretching from the rugged Atlantic coast of Newfoundland to the temperate rainforests of British Columbia. The Canadian Rockies offer some of the world's most spectacular mountain scenery, with turquoise glacial lakes like Banff and Jasper reflecting snow-capped peaks. Its cities are a diverse mix of cultures and styles, from the historic, French-speaking streets of Quebec City to the futuristic skyline of Toronto and the laid-back, coastal vibe of Vancouver. Whether searching for polar bears in Churchill or hiking the West Coast Trail, Canada is a sanctuary for nature lovers and adventurers.",
    "placesToVisit": [
      {
        "name": "Banff National Park",
        "summary": "Canada's oldest national park, famous for its stunning mountain scenery and lakes."
      },
      {
        "name": "Vancouver",
        "summary": "A beautiful coastal city known for its outdoor lifestyle and diverse culture."
      }
    ],
    "travelTips": [
      "Distances in Canada are huge; plan your travel time accordingly.",
      "The Canadian Dollar (CAD) is the currency; credit cards are accepted everywhere.",
      "Tipping is standard in restaurants, usually between 15% and 20%."
    ],
    "heroImage": {
      "src": "/images/countries/canada/hero.jpg",
      "alt": "The turquoise waters of Moraine Lake in Banff"
    }
  },
  "central-african-republic": {
    "slug": "centralafricanrepublic",
    "name": "Central African Republic",
    "region": "Africa",
    "heroDescription": "The Central African Republic is a wild and untamed frontier of biodiversity, home to some of the most pristine rainforests and wildlife populations on the continent. Dzanga-Sangha National Park is a sanctuary for western lowland gorillas, forest elephants, and the elusive bongo, offering a rare and intimate connection with nature. The country's landscape is a mix of dense jungle, rolling savannas, and thundering waterfalls, largely untouched by modern development. Despite its challenges, it remains a destination for the truly adventurous and those seeking the ultimate wilderness experience in the very heart of Africa.",
    "placesToVisit": [
      {
        "name": "Dzanga-Sangha",
        "summary": "A world-class destination for seeing forest elephants and lowland gorillas."
      },
      {
        "name": "Boali Falls",
        "summary": "A spectacular series of waterfalls located near the capital, Bangui."
      }
    ],
    "travelTips": [
      "French is the official language; Sango is the national language.",
      "The Central African CFA Franc (XAF) is the currency; cash is necessary.",
      "Check the latest travel advisories due to ongoing security concerns."
    ],
    "heroImage": {
      "src": "/images/countries/centralafricanrepublic/hero.jpg",
      "alt": "Forest elephants in Dzanga-Sangha"
    }
  },
  "chad": {
    "slug": "chad",
    "name": "Chad",
    "region": "Africa",
    "heroDescription": "Chad is a land of raw, desert majesty and ancient nomadic traditions, where the Sahara Desert meets the Sahelian plains in a landscape of dramatic rock formations and hidden oases. The Ennedi Plateau, a UNESCO World Heritage site, offers a surreal landscape of sandstone arches, deep canyons, and prehistoric rock art, best explored by a traditional camel trek. In the south, Zakouma National Park is one of Africa's great conservation success stories, home to massive herds of elephants and a diverse array of wildlife. Chad is a destination for the intrepid, offering a glimpse into a world that has remained unchanged for centuries.",
    "placesToVisit": [
      {
        "name": "Ennedi Plateau",
        "summary": "A spectacular desert landscape of rock formations and ancient art."
      },
      {
        "name": "Zakouma National Park",
        "summary": "One of the best places in Central Africa for wildlife viewing."
      }
    ],
    "travelTips": [
      "French and Arabic are the official languages; English is very rare.",
      "The Central African CFA Franc (XAF) is the currency; cash is essential.",
      "Travel in Chad is challenging and requires careful planning and local guides."
    ],
    "heroImage": {
      "src": "/images/countries/chad/hero.jpg",
      "alt": "The dramatic rock arches of the Ennedi Plateau"
    }
  },
  "chile": {
    "slug": "chile",
    "name": "Chile",
    "region": "Americas",
    "heroDescription": "Chile is a land of staggering geographic diversity, stretching over 2,600 miles from the world's driest desert in the north to the icy fjords of the south. The Atacama Desert offers a surreal landscape of salt flats, geysers, and some of the clearest skies on Earth for stargazing. In the center, the fertile valleys of the Lake District provide a backdrop of snow-capped volcanoes and crystalline lakes, while the rugged peaks of Torres del Paine in Patagonia beckon hikers from around the globe. With its world-class wines, vibrant capital of Santiago, and the mysterious statues of Easter Island, Chile is a destination of endless discovery.",
    "placesToVisit": [
      {
        "name": "Torres del Paine",
        "summary": "A world-famous national park in Patagonia, known for its dramatic granite peaks."
      },
      {
        "name": "San Pedro de Atacama",
        "summary": "The gateway to the surreal landscapes and starry skies of the Atacama Desert."
      }
    ],
    "travelTips": [
      "The Chilean Peso (CLP) is the currency; credit cards are widely accepted.",
      "Domestic flights are the most efficient way to travel the country's long distances.",
      "The best time to visit Patagonia is during the southern summer (December-February)."
    ],
    "heroImage": {
      "src": "/images/countries/chile/hero.jpg",
      "alt": "The iconic granite towers of Torres del Paine"
    }
  },
  "china": {
    "slug": "china",
    "name": "China",
    "region": "Asia",
    "heroDescription": "China is a continental giant where ancient history and futuristic innovation collide in spectacular fashion. From the Great Wall snaking across mountain ridges to the terracotta warriors of Xi'an and the forbidden city of Beijing, the country's imperial past is ever-present. Yet, the neon-lit skylines of Shanghai and Shenzhen reflect a nation at the cutting edge of the 21st century. Beyond the cities, China offers a landscape of breathtaking variety, from the karst peaks of Guilin and the rainbow mountains of Zhangye to the high-altitude plateaus of Tibet. It is a destination of immense scale and depth, offering a journey through the very heart of human civilization.",
    "placesToVisit": [
      {
        "name": "Beijing",
        "summary": "The historic capital, home to the Great Wall and the Forbidden City."
      },
      {
        "name": "Shanghai",
        "summary": "A futuristic metropolis known for its iconic skyline and colonial Bund."
      }
    ],
    "travelTips": [
      "Download a reliable VPN before arriving to access many international websites.",
      "The Yuan (CNY) is the currency; mobile payment (Alipay/WeChat) is used everywhere.",
      "High-speed trains are the best and most efficient way to travel between major cities."
    ],
    "heroImage": {
      "src": "/images/countries/china/hero.jpg",
      "alt": "The Great Wall of China winding through the mountains"
    }
  },
  "colombia": {
    "slug": "colombia",
    "name": "Colombia",
    "region": "Americas",
    "heroDescription": "Colombia is a land of vibrant colors, infectious rhythms, and a resilient spirit that has transformed it into one of South America's most exciting destinations. From the colonial charm of Cartagena's walled city to the innovative energy of Medellín and the high-altitude capital of Bogotá, the country's cities are as diverse as its landscapes. The Coffee Triangle offers rolling hills of emerald green, while the Caribbean coast provides a tropical escape of turquoise waters and white-sand beaches in Tayrona National Park. With its world-class coffee, passionate people, and a culture that celebrates life at every turn, Colombia is a destination that captivates the soul.",
    "placesToVisit": [
      {
        "name": "Cartagena",
        "summary": "A beautiful colonial city on the Caribbean coast with a rich history."
      },
      {
        "name": "Medellín",
        "summary": "The 'City of Eternal Spring,' known for its innovation and vibrant culture."
      }
    ],
    "travelTips": [
      "The Colombian Peso (COP) is the currency; credit cards are accepted in cities.",
      "Learning some basic Spanish will greatly enhance your experience.",
      "Domestic flights are often cheaper and much faster than long-distance buses."
    ],
    "heroImage": {
      "src": "/images/countries/colombia/hero.jpg",
      "alt": "The colorful streets of colonial Cartagena"
    }
  },
  "comoros": {
    "slug": "comoros",
    "name": "Comoros",
    "region": "Africa",
    "heroDescription": "The Comoros, known as the 'Perfume Islands' for their fragrant ylang-ylang and vanilla plantations, are a secluded volcanic archipelago in the Indian Ocean. Each of the three main islands offers a unique experience, from the active volcano of Mount Karthala on Grande Comore to the pristine beaches and sea turtle nesting sites of Mohéli. The culture is a fascinating blend of Arab, African, and French influences, reflected in the narrow alleys and historic mosques of the capital, Moroni. With its untouched coral reefs and a slow, traditional pace of life, the Comoros offer a rare and authentic island escape for those seeking to go off the beaten path.",
    "placesToVisit": [
      {
        "name": "Mohéli",
        "summary": "The smallest and quietest island, a sanctuary for marine life and nature lovers."
      },
      {
        "name": "Moroni",
        "summary": "The capital city, featuring a beautiful old quarter and a historic mosque."
      }
    ],
    "travelTips": [
      "French and Arabic are the official languages; Comorian is the most widely spoken.",
      "The Comorian Franc (KMF) is the currency; cash is necessary as ATMs are rare.",
      "Dress modestly, as the islands are predominantly Muslim."
    ],
    "heroImage": {
      "src": "/images/countries/comoros/hero.jpg",
      "alt": "The turquoise waters and palm trees of Mohéli"
    }
  },
  "democratic-republic-of-the-congo": {
    "slug": "congodemocraticrepublic",
    "name": "Democratic Republic of the Congo",
    "region": "Africa",
    "heroDescription": "The Democratic Republic of the Congo is a continental giant of staggering scale and natural wealth, home to the world's second-largest rainforest and some of Africa's most dramatic landscapes. Virunga National Park, the oldest in Africa, is a sanctuary for the endangered mountain gorilla and features the world's largest lava lake at Mount Nyiragongo. The country's interior is a wild frontier of thundering waterfalls, vast rivers, and unique biodiversity found nowhere else on Earth. Despite its complex history, the DRC remains a place of profound spirit and raw, untamed beauty, offering the ultimate adventure for the most intrepid explorers.",
    "placesToVisit": [
      {
        "name": "Virunga National Park",
        "summary": "A legendary park home to mountain gorillas and active volcanoes."
      },
      {
        "name": "Mount Nyiragongo",
        "summary": "An active volcano featuring a spectacular, bubbling lava lake."
      }
    ],
    "travelTips": [
      "French is the official language; Lingala and Swahili are widely spoken.",
      "The Congolese Franc (CDF) is the currency, but USD is widely used.",
      "Check the latest security updates and travel with experienced local operators."
    ],
    "heroImage": {
      "src": "/images/countries/congodemocraticrepublic/hero.jpg",
      "alt": "The bubbling lava lake of Mount Nyiragongo"
    }
  },
  "congo-republic-of-the": {
    "slug": "congorepublic",
    "name": "Congo (Republic of the)",
    "region": "Africa",
    "heroDescription": "The Republic of the Congo is a land of vast, primary rainforests and the mighty Congo River, offering some of the most pristine wilderness experiences in Central Africa. Odzala-Kokoua National Park is a sanctuary for western lowland gorillas, forest elephants, and a diverse array of birdlife, providing a rare and intimate connection with nature. The capital, Brazzaville, is a clean and relaxed city with a French colonial charm, known for its vibrant arts scene and the legendary 'Sapeurs'—the society of elegant persons. It is a destination for the truly adventurous, offering a journey into the heart of the world's second-largest rainforest.",
    "placesToVisit": [
      {
        "name": "Odzala-Kokoua",
        "summary": "A world-class destination for seeing lowland gorillas in their natural habitat."
      },
      {
        "name": "Brazzaville",
        "summary": "A relaxed capital city with a beautiful riverside setting and vibrant culture."
      }
    ],
    "travelTips": [
      "French is the official language; basic phrases are essential.",
      "The Central African CFA Franc (XAF) is the currency; cash is necessary.",
      "The best time to visit is during the dry seasons (June-August and December-February)."
    ],
    "heroImage": {
      "src": "/images/countries/congorepublic/hero.jpg",
      "alt": "A lowland gorilla in the Odzala rainforest"
    }
  },
  "costa-rica": {
    "slug": "costarica",
    "name": "Costa Rica",
    "region": "Americas",
    "heroDescription": "Costa Rica is a global leader in eco-tourism and a sanctuary for nature lovers, where the phrase 'Pura Vida'—the pure life—is a way of existence. Its landscape is a kaleidoscope of diverse environments, from the misty cloud forests of Monteverde to the thundering waterfalls of the Osa Peninsula and the smoking peaks of the Arenal Volcano. The coastline offers a tropical paradise of world-class surf and pristine beaches on both the Pacific and Caribbean shores. With its commitment to environmental preservation and its staggering biodiversity, Costa Rica provides a peaceful and invigorating escape into the wild heart of Central America.",
    "placesToVisit": [
      {
        "name": "Arenal Volcano",
        "summary": "A perfectly shaped volcano offering hot springs and adventure activities."
      },
      {
        "name": "Manuel Antonio",
        "summary": "A stunning national park with beautiful beaches and abundant wildlife."
      }
    ],
    "travelTips": [
      "The Colón (CRC) is the currency, but USD is widely accepted in tourist areas.",
      "Renting a 4x4 is highly recommended for exploring the more remote regions.",
      "The best time to visit is during the dry season from December to April."
    ],
    "heroImage": {
      "src": "/images/countries/costarica/hero.jpg",
      "alt": "The iconic Arenal Volcano surrounded by rainforest"
    }
  },
  "cte-divoire": {
    "slug": "cotedivoire",
    "name": "Côte d'Ivoire",
    "region": "Africa",
    "heroDescription": "Côte d'Ivoire is a West African powerhouse of culture and commerce, where the futuristic skyline of Abidjan meets the ancient traditions of the interior. The capital, Yamoussoukro, is home to the Basilica of Our Lady of Peace, the largest church in the world, while the historic town of Grand-Bassam offers a journey into the country's colonial past. Along the coast, the palm-fringed beaches of San Pédro and Assinie provide a tropical escape, while the rugged mountains of Man offer dramatic landscapes and unique mask-making traditions. With its world-class cocoa, vibrant music scene, and deep-rooted heritage, Côte d'Ivoire is a destination of immense spirit and modern ambition.",
    "placesToVisit": [
      {
        "name": "Abidjan",
        "summary": "The 'Manhattan of Africa,' a dynamic city known for its nightlife and architecture."
      },
      {
        "name": "Grand-Bassam",
        "summary": "A historic colonial town and a UNESCO World Heritage site near the coast."
      }
    ],
    "travelTips": [
      "French is the official language; basic phrases are very helpful.",
      "The West African CFA Franc (XOF) is the currency; cash is necessary.",
      "The best time to visit is during the dry season from November to March."
    ],
    "heroImage": {
      "src": "/images/countries/cotedivoire/hero.jpg",
      "alt": "The futuristic skyline of Abidjan"
    }
  },
  "croatia": {
    "slug": "croatia",
    "name": "Croatia",
    "region": "Europe",
    "heroDescription": "Croatia is a Mediterranean masterpiece where dramatic limestone peaks meet the turquoise waters of the Adriatic Sea in a landscape of unparalleled beauty. The historic walled city of Dubrovnik, the 'Pearl of the Adriatic,' captivates with its limestone streets and medieval fortifications, while the islands of Hvar and Vis offer a glitzy coastal lifestyle. Inland, the thundering waterfalls of Plitvice Lakes and Krka provide a spectacle of nature's raw power, set within lush, emerald forests. With its unique blend of Venetian history, Slavic soul, and world-class sailing, Croatia is a premier destination for history, nature, and the art of 'fjaka'—the sweetness of doing nothing.",
    "placesToVisit": [
      {
        "name": "Dubrovnik",
        "summary": "A stunning medieval walled city and a UNESCO World Heritage site."
      },
      {
        "name": "Plitvice Lakes",
        "summary": "A spectacular national park with 16 terraced lakes and waterfalls."
      }
    ],
    "travelTips": [
      "Croatia joined the Eurozone in 2023; the Euro (EUR) is the official currency.",
      "Ferries are the best way to explore the many islands along the coast.",
      "The best time to visit is the shoulder season (May-June or September-October)."
    ],
    "heroImage": {
      "src": "/images/countries/croatia/hero.jpg",
      "alt": "The historic walled city of Dubrovnik"
    }
  },
  "cuba": {
    "slug": "cuba",
    "name": "Cuba",
    "region": "Americas",
    "heroDescription": "Cuba is a land of frozen time and infectious energy, where the faded grandeur of Havana's colonial architecture meets the rhythmic pulse of salsa and the scent of world-class cigars. Its history is etched into the cobblestone streets of Trinidad and the revolutionary monuments of Santa Clara, while the lush valleys of Viñales offer a landscape of dramatic limestone mogotes and tobacco fields. The coastline provides a tropical paradise of pristine white-sand beaches and turquoise waters in Varadero and the offshore cayes. With its passionate people, vintage cars, and a culture that celebrates resilience and joy, Cuba is a destination that feels like nowhere else on Earth.",
    "placesToVisit": [
      {
        "name": "Havana",
        "summary": "The vibrant capital city, famous for its history, music, and vintage cars."
      },
      {
        "name": "Trinidad",
        "summary": "A perfectly preserved colonial town and a UNESCO World Heritage site."
      }
    ],
    "travelTips": [
      "Cuba has a unique dual-currency system; check the latest updates before traveling.",
      "Internet access can be limited; buy ETECSA cards for public Wi-Fi hotspots.",
      "Staying in 'Casas Particulares' (private guesthouses) is the best way to support locals."
    ],
    "heroImage": {
      "src": "/images/countries/cuba/hero.jpg",
      "alt": "A vintage car on the colorful streets of Old Havana"
    }
  },
  "cyprus": {
    "slug": "cyprus",
    "name": "Cyprus",
    "region": "Europe",
    "heroDescription": "Cyprus is a sun-drenched island at the crossroads of three continents, where ancient Greek and Roman ruins sit alongside medieval castles and modern coastal resorts. The birthplace of Aphrodite, the island offers a landscape of rugged limestone cliffs, turquoise lagoons, and the pine-scented peaks of the Troodos Mountains. Its history is visible in the mosaics of Paphos and the divided capital of Nicosia, reflecting a complex and multi-layered heritage. With its warm Mediterranean hospitality, world-class diving at the Zenobia wreck, and a culinary scene that blends Greek and Turkish influences, Cyprus is a timeless and captivating destination.",
    "placesToVisit": [
      {
        "name": "Paphos",
        "summary": "A historic coastal city famous for its Roman mosaics and ancient tombs."
      },
      {
        "name": "Troodos Mountains",
        "summary": "The green heart of the island, home to painted churches and hiking trails."
      }
    ],
    "travelTips": [
      "Cyprus is divided; you can cross between the North and South at designated checkpoints.",
      "The Euro (EUR) is the currency in the Republic of Cyprus (the South).",
      "Driving is on the left side of the road, a legacy of British rule."
    ],
    "heroImage": {
      "src": "/images/countries/cyprus/hero.jpg",
      "alt": "The turquoise waters of the Blue Lagoon in Cyprus"
    }
  },
  "czechia": {
    "slug": "czechia",
    "name": "Czechia",
    "region": "Europe",
    "heroDescription": "Czechia is a land of fairytale castles, medieval timber-framed towns, and a deep-rooted beer culture that is second to none. Prague, the 'City of a Hundred Spires,' captivates with its Gothic architecture, the iconic Charles Bridge, and the sprawling majesty of Prague Castle. Beyond the capital, the country offers a landscape of rolling hills, deep forests, and historic spa towns like Karlovy Vary. Its history is etched into the stone of Kutná Hora and the perfectly preserved town of Český Krumlov. With its warm hospitality, world-class pilsners, and a culture that values both tradition and innovation, Czechia is a premier destination in the heart of Europe.",
    "placesToVisit": [
      {
        "name": "Prague",
        "summary": "One of Europe's most beautiful capitals, famous for its history and architecture."
      },
      {
        "name": "Český Krumlov",
        "summary": "A fairytale town in South Bohemia with a stunning castle and river setting."
      }
    ],
    "travelTips": [
      "The Czech Koruna (CZK) is the currency; credit cards are widely accepted.",
      "Beer is often cheaper than water in restaurants; try the local pilsners.",
      "The train and bus network is excellent for traveling between cities and towns."
    ],
    "heroImage": {
      "src": "/images/countries/czechia/hero.jpg",
      "alt": "The iconic Charles Bridge in Prague at dawn"
    }
  },
  "denmark": {
    "slug": "denmark",
    "name": "Denmark",
    "region": "Europe",
    "heroDescription": "Denmark is a land of coastal beauty, innovative design, and a unique philosophy of 'hygge'—the art of cozy contentment. Copenhagen, the vibrant capital, is a city of canals, world-class museums, and a cycling culture that is among the best in the world. The country's landscape is defined by its flat, fertile plains, sandy beaches, and the dramatic white cliffs of Møn. From the historic streets of Aarhus and Odense to the modern architecture of the LEGO House in Billund, Denmark offers a serene and orderly charm. It is a place where tradition and innovation coexist harmoniously, providing a high quality of life and a welcoming atmosphere.",
    "placesToVisit": [
      {
        "name": "Copenhagen",
        "summary": "A cool and compact capital city known for its design, food, and cycling."
      },
      {
        "name": "Skagen",
        "summary": "A beautiful coastal town at the northern tip of Denmark, where two seas meet."
      }
    ],
    "travelTips": [
      "The Danish Krone (DKK) is the currency; credit cards are used for almost everything.",
      "Renting a bike is the best way to explore Copenhagen like a local.",
      "Denmark is very expensive; plan your budget accordingly for food and drinks."
    ],
    "heroImage": {
      "src": "/images/countries/denmark/hero.jpg",
      "alt": "The colorful houses of Nyhavn in Copenhagen"
    }
  },
  "djibouti": {
    "slug": "djibouti",
    "name": "Djibouti",
    "region": "Africa",
    "heroDescription": "Djibouti is a land of surreal, otherworldly landscapes and dramatic geological forces, located at the meeting point of three tectonic plates. Lake Assal, the lowest point in Africa, offers a blindingly white expanse of salt flats and turquoise waters, while the chimneys of Lake Abbé create a landscape that feels like another planet. The coastline along the Gulf of Tadjoura is a sanctuary for whale sharks and vibrant coral reefs, offering world-class snorkeling and diving. Despite its small size, Djibouti is a strategic hub of global commerce and a wild frontier for those seeking the ultimate geological adventure in the Horn of Africa.",
    "placesToVisit": [
      {
        "name": "Lake Assal",
        "summary": "A spectacular salt lake and the lowest point on the African continent."
      },
      {
        "name": "Gulf of Tadjoura",
        "summary": "A premier destination for snorkeling with whale sharks and diving."
      }
    ],
    "travelTips": [
      "French and Arabic are the official languages; basic phrases are essential.",
      "The Djiboutian Franc (DJF) is the currency; cash is necessary outside the capital.",
      "The best time to visit for whale shark sightings is from November to February."
    ],
    "heroImage": {
      "src": "/images/countries/djibouti/hero.jpg",
      "alt": "The surreal salt formations of Lake Assal"
    }
  },
  "dominica": {
    "slug": "dominica",
    "name": "Dominica",
    "region": "Americas",
    "heroDescription": "Dominica, the 'Nature Island' of the Caribbean, is a wild and untamed paradise of lush rainforests, thundering waterfalls, and volcanic wonders. Unlike its beach-focused neighbors, it is a sanctuary for hikers and adventurers, home to the world's second-largest boiling lake and the Waitukubuli National Trail. The island's rugged coastline offers dramatic cliffs and world-class diving in the champagne springs of Soufrière. With its deep-rooted Kalinago heritage and its commitment to becoming the world's first climate-resilient nation, Dominica offers a soulful and authentic experience for those seeking to connect with the raw power of nature.",
    "placesToVisit": [
      {
        "name": "Morne Trois Pitons",
        "summary": "A UNESCO-listed national park home to the Boiling Lake and Trafalgar Falls."
      },
      {
        "name": "Roseau",
        "summary": "The charming and colorful capital city, known for its botanical gardens and markets."
      }
    ],
    "travelTips": [
      "Dominica is for hikers, not just beach-goers; bring good walking boots.",
      "The Eastern Caribbean Dollar (XCD) is the currency, but USD is widely accepted.",
      "The island is a premier destination for whale watching, especially from November to March."
    ],
    "heroImage": {
      "src": "/images/countries/dominica/hero.jpg",
      "alt": "The lush, green mountains of the Nature Island"
    }
  },
  "dominican-republic": {
    "slug": "dominicanrepublic",
    "name": "Dominican Republic",
    "region": "Americas",
    "heroDescription": "The Dominican Republic is a land of rhythmic merengue, colonial history, and some of the most diverse landscapes in the Caribbean. From the sun-drenched beaches of Punta Cana and the turquoise waters of the Samaná Peninsula to the high-altitude peaks of the Cordillera Central, the country offers a staggering variety of experiences. Santo Domingo, the oldest city in the New World, captivates with its UNESCO-listed colonial zone and vibrant street life. Whether exploring the lush rainforests of Los Haitises or dancing the night away in a local colmado, travelers find a country of immense spirit and tropical splendor.",
    "placesToVisit": [
      {
        "name": "Santo Domingo",
        "summary": "The historic capital, home to the first cathedral and university in the Americas."
      },
      {
        "name": "Samaná",
        "summary": "A beautiful peninsula famous for its secluded beaches and whale watching."
      }
    ],
    "travelTips": [
      "The Dominican Peso (DOP) is the currency; USD is accepted in major resorts.",
      "Learning basic Spanish will help you navigate outside the tourist enclaves.",
      "The best time for whale watching in Samaná is from January to March."
    ],
    "heroImage": {
      "src": "/images/countries/dominicanrepublic/hero.jpg",
      "alt": "The pristine beaches of the Samaná Peninsula"
    }
  },
  "ecuador": {
    "slug": "ecuador",
    "name": "Ecuador",
    "region": "Americas",
    "heroDescription": "Ecuador is a compact powerhouse of biodiversity, where the Amazon rainforest, the Andean highlands, and the Pacific coast meet at the center of the world. The Galápagos Islands offer a legendary wildlife experience found nowhere else on Earth, while the colonial heart of Quito stands as a masterpiece of Spanish architecture. In the highlands, the Avenue of the Volcanoes provides a dramatic backdrop to vibrant indigenous markets like Otavalo and the high-altitude crater lake of Quilotoa. With its commitment to environmental rights and its staggering variety of landscapes, Ecuador is a destination that offers a profound connection with nature.",
    "placesToVisit": [
      {
        "name": "Galápagos Islands",
        "summary": "A world-famous archipelago and a living laboratory of evolution."
      },
      {
        "name": "Quito",
        "summary": "The historic capital, featuring one of the best-preserved colonial centers in the world."
      }
    ],
    "travelTips": [
      "Ecuador uses the US Dollar (USD) as its official currency.",
      "Altitude sickness can be an issue in Quito and the highlands; take it slow.",
      "The weather can change rapidly in the mountains; dress in layers."
    ],
    "heroImage": {
      "src": "/images/countries/ecuador/hero.jpg",
      "alt": "The unique wildlife of the Galápagos Islands"
    }
  },
  "egypt": {
    "slug": "egypt",
    "name": "Egypt",
    "region": "Africa",
    "heroDescription": "Egypt is a land of monumental history and eternal mystery, where the thundering Nile River has nurtured one of the world's greatest civilizations for millennia. The Pyramids of Giza and the Great Sphinx stand as silent witnesses to a grand imperial past, while the temples of Luxor and Karnak offer a journey into the heart of ancient Egyptian faith. Cairo, the 'City of a Thousand Minarets,' is a vibrant and chaotic metropolis of grand mosques and bustling souks. Beyond the monuments, the Red Sea coast offers a tropical paradise of world-class diving and pristine coral reefs, providing a perfect balance of history and relaxation.",
    "placesToVisit": [
      {
        "name": "Giza",
        "summary": "Home to the iconic Great Pyramids and the Sphinx, the last of the Seven Wonders."
      },
      {
        "name": "Luxor",
        "summary": "Often called the 'world's greatest open-air museum,' home to the Valley of the Kings."
      }
    ],
    "travelTips": [
      "The Egyptian Pound (EGP) is the currency; cash is necessary for many sites.",
      "Tipping (baksheesh) is a deeply ingrained part of Egyptian culture.",
      "The best time to visit for sightseeing is from October to April when it's cooler."
    ],
    "heroImage": {
      "src": "/images/countries/egypt/hero.jpg",
      "alt": "The Great Pyramids of Giza at sunset"
    }
  },
  "el-salvador": {
    "slug": "elsalvador",
    "name": "El Salvador",
    "region": "Americas",
    "heroDescription": "El Salvador, the 'Land of Volcanoes,' is a compact and vibrant nation of dramatic landscapes, world-class surf, and a resilient, welcoming spirit. Its Pacific coastline, known as the Surf City, offers some of the best point breaks in the world, while the interior features a landscape of smoking volcanoes and lush coffee plantations. The colonial town of Suchitoto captivates with its cobblestone streets and artistic heritage, set against the backdrop of Lake Suchitlán. From the ancient Maya ruins of Joya de Cerén to the thundering waterfalls of the Ruta de las Flores, El Salvador offers a rich and diverse experience of Central American history and nature.",
    "placesToVisit": [
      {
        "name": "El Tunco",
        "summary": "A famous surf town known for its black-sand beaches and vibrant nightlife."
      },
      {
        "name": "Santa Ana Volcano",
        "summary": "The highest volcano in the country, offering a spectacular crater lake and views."
      }
    ],
    "travelTips": [
      "El Salvador uses the US Dollar (USD) and Bitcoin as legal tender.",
      "The country is small, making it easy to see many sites in a short amount of time.",
      "The best time for surfing is during the rainy season from May to October."
    ],
    "heroImage": {
      "src": "/images/countries/elsalvador/hero.jpg",
      "alt": "The turquoise crater lake of Santa Ana Volcano"
    }
  },
  "equatorial-guinea": {
    "slug": "equatorialguinea",
    "name": "Equatorial Guinea",
    "region": "Africa",
    "heroDescription": "Equatorial Guinea is a unique and often overlooked nation, the only Spanish-speaking country in Africa, spread across a mainland territory and several volcanic islands. The capital, Malabo, sits on the island of Bioko, featuring a mix of Spanish colonial architecture and modern, oil-funded development. The country's interior is a wild frontier of primary rainforests, home to unique species like the drill monkey and forest elephants in Monte Alén National Park. With its pristine beaches, thundering waterfalls, and a culture that blends African traditions with Hispanic influences, Equatorial Guinea offers a rare and authentic experience for the truly adventurous.",
    "placesToVisit": [
      {
        "name": "Malabo",
        "summary": "A coastal capital with a beautiful cathedral and a mix of old and new."
      },
      {
        "name": "Monte Alén",
        "summary": "A pristine national park and a sanctuary for Central African wildlife."
      }
    ],
    "travelTips": [
      "Spanish is the official language; French and Portuguese are also spoken.",
      "The Central African CFA Franc (XAF) is the currency; cash is essential.",
      "Visas can be difficult to obtain; check the latest requirements well in advance."
    ],
    "heroImage": {
      "src": "/images/countries/equatorialguinea/hero.jpg",
      "alt": "The lush rainforests of Bioko Island"
    }
  },
  "eritrea": {
    "slug": "eritrea",
    "name": "Eritrea",
    "region": "Africa",
    "heroDescription": "Eritrea is a land of striking contrasts and a unique, frozen-in-time atmosphere, where the futuristic Art Deco architecture of Asmara meets the ancient maritime history of the Red Sea coast. The capital, Asmara, is a UNESCO World Heritage site known for its perfectly preserved Italian colonial buildings and vibrant cafe culture. Along the coast, the port city of Massawa tells a story of Ottoman and Italian heritage, while the Dahlak Archipelago offers a tropical paradise of pristine coral reefs and untouched islands. Despite its challenges, Eritrea remains a place of deep cultural depth and resilient spirit, offering a profound and moving experience for the intrepid traveler.",
    "placesToVisit": [
      {
        "name": "Asmara",
        "summary": "A stunning capital city famous for its Art Deco architecture and coffee culture."
      },
      {
        "name": "Massawa",
        "summary": "A historic port city with a mix of Ottoman and Italian colonial styles."
      }
    ],
    "travelTips": [
      "Tigrinya, Arabic, and English are the most widely spoken languages.",
      "The Nakfa (ERN) is the currency; it is not convertible outside the country.",
      "Travel permits are required for most areas outside the capital city."
    ],
    "heroImage": {
      "src": "/images/countries/eritrea/hero.jpg",
      "alt": "The unique Art Deco architecture of Asmara"
    }
  },
  "estonia": {
    "slug": "estonia",
    "name": "Estonia",
    "region": "Europe",
    "heroDescription": "Estonia is a digital pioneer with a medieval heart, where the perfectly preserved walled city of Tallinn meets the vast, untouched wilderness of the Baltic coast. Its history is etched into the cobblestone streets of the Old Town and the ruins of ancient fortresses, while its future is visible in its status as one of the world's most advanced digital societies. Beyond the capital, the country offers a landscape of deep forests, tranquil bogs, and over 2,000 islands, providing a sanctuary for nature lovers and hikers. With its unique blend of Nordic and Baltic cultures, Estonia is a destination that balances tradition and innovation in a landscape of quiet grace.",
    "placesToVisit": [
      {
        "name": "Tallinn",
        "summary": "One of Europe's best-preserved medieval cities and a UNESCO World Heritage site."
      },
      {
        "name": "Lahemaa National Park",
        "summary": "A beautiful coastal park known for its bogs, forests, and historic manors."
      }
    ],
    "travelTips": [
      "Estonia is a very digital society; Wi-Fi is available almost everywhere.",
      "The Euro (EUR) is the currency; credit cards are used for everything.",
      "The best time to visit is during the summer for the 'White Nights' effect."
    ],
    "heroImage": {
      "src": "/images/countries/estonia/hero.jpg",
      "alt": "The medieval spires of Tallinn's Old Town"
    }
  },
  "eswatini": {
    "slug": "eswatini",
    "name": "Eswatini",
    "region": "Africa",
    "heroDescription": "Eswatini, formerly Swaziland, is one of the world's last absolute monarchies and a land of deep-rooted traditions and stunning mountain scenery. It is a place where ancient ceremonies like the Umhlanga (Reed Dance) are still practiced with pride, reflecting a culture that remains central to the nation's identity. The country's landscape is a mix of high-altitude plateaus, fertile valleys, and wildlife-rich savannas in parks like Hlane Royal and Mkhaya. From the vibrant arts and crafts of the Ezulwini Valley to the rugged peaks of the Malolotja Mountains, Eswatini offers a soulful and welcoming experience in the heart of Southern Africa.",
    "placesToVisit": [
      {
        "name": "Mlilwane Wildlife Sanctuary",
        "summary": "A beautiful park where you can hike or bike among zebras and antelopes."
      },
      {
        "name": "Ezulwini Valley",
        "summary": "The cultural heart of the nation, famous for its markets and festivals."
      }
    ],
    "travelTips": [
      "The Lilangeni (SZL) is the currency, pegged 1:1 with the South African Rand.",
      "English and siSwati are the official languages; English is widely spoken.",
      "Eswatini is small and easy to navigate, making it perfect for a road trip."
    ],
    "heroImage": {
      "src": "/images/countries/eswatini/hero.jpg",
      "alt": "The rolling green hills of Eswatini"
    }
  },
  "ethiopia": {
    "slug": "ethiopia",
    "name": "Ethiopia",
    "region": "Africa",
    "heroDescription": "Ethiopia is a land of profound history and extraordinary landscapes, the only African nation never to be colonized and the cradle of ancient Christian and Islamic traditions. The rock-hewn churches of Lalibela and the medieval castles of Gondar stand as powerful symbols of human ambition and spiritual depth. In the north, the Simien Mountains offer a dramatic landscape of jagged peaks and unique wildlife, while the Danakil Depression in the east provides a surreal, volcanic environment. With its world-renowned coffee culture, vibrant music, and a history that stretches back to the dawn of humanity, Ethiopia is a destination of immense scale and depth.",
    "placesToVisit": [
      {
        "name": "Lalibela",
        "summary": "Famous for its 11 spectacular rock-hewn churches and spiritual atmosphere."
      },
      {
        "name": "Simien Mountains",
        "summary": "A UNESCO-listed national park offering some of Africa's best hiking."
      }
    ],
    "travelTips": [
      "Ethiopia follows its own calendar and time system; check the local date.",
      "The Birr (ETB) is the currency; cash is necessary outside major hotels.",
      "Coffee is a central part of life; don't miss a traditional coffee ceremony."
    ],
    "heroImage": {
      "src": "/images/countries/ethiopia/hero.jpg",
      "alt": "The rock-hewn church of Saint George in Lalibela"
    }
  },
  "fiji": {
    "slug": "fiji",
    "name": "fiji",
    "region": "Oceania",
    "heroDescription": "Fiji is the quintessential South Pacific paradise, an archipelago of over 300 islands known for its rugged landscapes, palm-lined beaches, and a culture of legendary hospitality. The Mamanuca and Yasawa Islands offer a dreamlike escape of turquoise lagoons and world-class diving, while the main island of Viti Levu provides a mix of high-end resorts and traditional villages. Beyond its natural beauty, Fiji is defined by the warmth of its people and the 'Bula' spirit that makes every visitor feel like family. Whether seeking romance, family adventure, or a simple life on a remote beach, Fiji offers a sanctuary of peace and tropical splendor.",
    "placesToVisit": [
      {
        "name": "Mamanuca Islands",
        "summary": "A stunning island chain famous for its turquoise waters and surf breaks."
      },
      {
        "name": "Coral Coast",
        "summary": "A beautiful stretch of coastline on Viti Levu with many resorts and villages."
      }
    ],
    "travelTips": [
      "The Fijian Dollar (FJD) is the currency; credit cards are accepted in resorts.",
      "Participating in a 'Kava' ceremony is a respectful way to connect with locals.",
      "The best time to visit is during the dry season from May to October."
    ],
    "heroImage": {
      "src": "/images/countries/fiji/hero.jpg",
      "alt": "A pristine turquoise lagoon in the Mamanuca Islands"
    }
  },
  "finland": {
    "slug": "finland",
    "name": "Finland",
    "region": "Europe",
    "heroDescription": "Finland is a land of pristine lakes, vast forests, and the magical glow of the Northern Lights, where nature is a way of life and the philosophy of 'Sisu'—resilient courage—defines the culture. Helsinki, the vibrant capital, is a city of islands, world-class design, and a sauna culture that is second to none. The country's landscape is defined by its flat, fertile plains, sandy Baltic beaches, and the dramatic mountains of the north in Lapland. From the midnight sun of summer to the snowy silence of winter, Finland provides a serene and invigorating escape into one of the world's most stable and beautiful nations.",
    "placesToVisit": [
      {
        "name": "Helsinki",
        "summary": "A cool and compact capital city known for its design and maritime setting."
      },
      {
        "name": "Rovaniemi",
        "summary": "The official hometown of Santa Claus and a gateway to the Arctic."
      }
    ],
    "travelTips": [
      "Sauna is a central part of Finnish life; try to experience a traditional one.",
      "The Euro (EUR) is the currency; credit cards are used for everything.",
      "The best time for Northern Lights is from September to March in the north."
    ],
    "heroImage": {
      "src": "/images/countries/finland/hero.jpg",
      "alt": "The magical Northern Lights over a Finnish forest"
    }
  },
  "france": {
    "slug": "france",
    "name": "France",
    "region": "Europe",
    "heroDescription": "France is a global icon of art, history, and culinary excellence, where the romantic streets of Paris meet the sun-drenched vineyards of Bordeaux and the glitzy shores of the French Riviera. From the iconic silhouette of the Eiffel Tower and the Gothic majesty of Notre-Dame to the fairytale castles of the Loire Valley and the rugged peaks of the Alps, the country offers an endless array of experiences. Its culture is celebrated through its world-renowned gastronomy, its passionate love for fashion and art, and its deep-seated sense of 'art de vivre'—the art of living. France is a destination that captivates the senses and the soul.",
    "placesToVisit": [
      {
        "name": "Paris",
        "summary": "The 'City of Light,' famous for its art, fashion, and iconic landmarks."
      },
      {
        "name": "Mont Saint-Michel",
        "summary": "A stunning medieval abbey perched on a rocky island in Normandy."
      }
    ],
    "travelTips": [
      "Learning a few basic French phrases will greatly improve your interactions.",
      "The Euro (EUR) is the currency; credit cards are widely accepted.",
      "Lunch is the main meal of the day; many shops close for a break in the afternoon."
    ],
    "heroImage": {
      "src": "/images/countries/france/hero.jpg",
      "alt": "The Eiffel Tower overlooking the Seine in Paris"
    }
  },
  "gabon": {
    "slug": "gabon",
    "name": "Gabon",
    "region": "Africa",
    "heroDescription": "Gabon is a wild and untamed frontier of biodiversity, often called the 'Last Eden' for its vast, primary rainforests and pristine Atlantic coastline. Loango National Park is a unique sanctuary where forest elephants and hippos can be seen roaming the beaches, while Ivindo National Park features the thundering Kongou Falls. The country's commitment to conservation is evident in its network of 13 national parks, protecting some of the most important ecosystems in Central Africa. With its vibrant traditional culture and its raw, untamed beauty, Gabon offers a rare and authentic experience for those seeking the ultimate wilderness adventure.",
    "placesToVisit": [
      {
        "name": "Loango National Park",
        "summary": "Famous for its 'surfing hippos' and diverse coastal ecosystems."
      },
      {
        "name": "Libreville",
        "summary": "A relaxed coastal capital with a vibrant arts scene and lively markets."
      }
    ],
    "travelTips": [
      "French is the official language; basic phrases are essential.",
      "The Central African CFA Franc (XAF) is the currency; cash is necessary.",
      "The best time to visit is during the dry season from June to August."
    ],
    "heroImage": {
      "src": "/images/countries/gabon/hero.jpg",
      "alt": "Forest elephants on the beach in Loango National Park"
    }
  },
  "gambia": {
    "slug": "gambia",
    "name": "Gambia",
    "region": "Africa",
    "heroDescription": "The Gambia, the smallest nation on mainland Africa, is a land of friendly people and the shimmering expanse of the Gambia River, which winds through the heart of the country. Known as the 'Smiling Coast,' it offers a tropical paradise of palm-fringed beaches and vibrant birdlife, making it a premier destination for nature lovers. The country's history is visible in the somber ruins of Kunta Kinteh Island, a reminder of the transatlantic slave trade, while the bustling markets of Banjul reflect a lively and resilient culture. With its warm hospitality and its soulful atmosphere, The Gambia provides a peaceful and welcoming sanctuary in West Africa.",
    "placesToVisit": [
      {
        "name": "Banjul",
        "summary": "The compact capital city, known for its colonial architecture and markets."
      },
      {
        "name": "Kunta Kinteh Island",
        "summary": "A historic site and a UNESCO World Heritage reminder of the slave trade."
      }
    ],
    "travelTips": [
      "English is the official language, making it very easy for many travelers.",
      "The Dalasi (GMD) is the currency; cash is necessary for most transactions.",
      "The best time to visit is during the dry season from November to May."
    ],
    "heroImage": {
      "src": "/images/countries/gambia/hero.jpg",
      "alt": "The palm-fringed beaches of the Smiling Coast"
    }
  },
  "georgia": {
    "slug": "georgia",
    "name": "Georgia",
    "region": "Asia",
    "heroDescription": "Georgia is a land of celestial mountains and ancient traditions, where the soaring peaks of the Caucasus meet the sun-drenched vineyards of Kakheti and the turquoise waters of the Black Sea. Its history is etched into the stone of cave cities like Vardzia and the medieval towers of Svaneti, while its future is visible in the vibrant, modern capital of Tbilisi. The country is world-renowned for its wine production, with a history that stretches back over 8,000 years, and its legendary hospitality centered around the 'supra' feast. With its unique alphabet, soulful polyphonic singing, and breathtaking landscapes, Georgia is a destination of profound depth.",
    "placesToVisit": [
      {
        "name": "Tbilisi",
        "summary": "A vibrant capital city with a mix of ancient history and modern energy."
      },
      {
        "name": "Stepantsminda",
        "summary": "Famous for the Gergeti Trinity Church and its stunning mountain views."
      }
    ],
    "travelTips": [
      "The Lari (GEL) is the currency; credit cards are widely used in cities.",
      "Georgian hospitality is legendary; be prepared for many toasts and feasts.",
      "The best time to visit is during the spring or autumn for the best weather."
    ],
    "heroImage": {
      "src": "/images/countries/georgia/hero.jpg",
      "alt": "The Gergeti Trinity Church with Mount Kazbek"
    }
  },
  "germany": {
    "slug": "germany",
    "name": "Germany",
    "region": "Europe",
    "heroDescription": "Germany is a land of captivating contrasts and resilient spirit, where medieval timber-framed towns and fairytale castles sit alongside cutting-edge cities and a powerful industrial heritage. Berlin, the vibrant capital, is a hub of history, art, and nightlife, while the historic city of Munich offers a living museum of Bavarian culture and world-class beer halls. The country's landscape is defined by its vast, fertile plains, the dramatic peaks of the Alps, and the romantic Rhine Valley. From the somber battlefields of history to the rolling hills of the Black Forest, Germany offers a rich and varied European experience, where tradition and progress coexist harmoniously.",
    "placesToVisit": [
      {
        "name": "Berlin",
        "summary": "A dynamic capital city famous for its history, art, and nightlife."
      },
      {
        "name": "Neuschwanstein Castle",
        "summary": "The ultimate fairytale castle, nestled in the Bavarian Alps."
      }
    ],
    "travelTips": [
      "Sundays are quiet in Germany; most shops and supermarkets are closed.",
      "The Euro (EUR) is the currency; cash is still preferred in some smaller cafes.",
      "The train network (Deutsche Bahn) is excellent and the best way to travel."
    ],
    "heroImage": {
      "src": "/images/countries/germany/hero.jpg",
      "alt": "The fairytale Neuschwanstein Castle in Bavaria"
    }
  },
  "ghana": {
    "slug": "ghana",
    "name": "Ghana",
    "region": "Africa",
    "heroDescription": "Ghana is a West African powerhouse of culture and history, known for its vibrant energy, colorful festivals, and the warmth of its people. The coastline is dotted with somber reminders of the transatlantic slave trade in the form of Cape Coast and Elmina Castles, while the vibrant capital, Accra, is a city of innovation and creativity. The country's interior is a sanctuary of biodiversity, home to the canopy walks of Kakum National Park and the wildlife-rich Mole National Park. With its world-class cocoa, rhythmic highlife music, and deep-rooted heritage, Ghana is a soulful and welcoming gateway to the African continent.",
    "placesToVisit": [
      {
        "name": "Accra",
        "summary": "A dynamic coastal capital with a vibrant arts scene and lively markets."
      },
      {
        "name": "Cape Coast Castle",
        "summary": "A historic site and a UNESCO World Heritage reminder of the slave trade."
      }
    ],
    "travelTips": [
      "English is the official language, making it very easy for many travelers.",
      "The Cedi (GHS) is the currency; cash is necessary for most transactions.",
      "The best time to visit is during the dry season from November to March."
    ],
    "heroImage": {
      "src": "/images/countries/ghana/hero.jpg",
      "alt": "The historic Cape Coast Castle on the Atlantic"
    }
  },
  "greece": {
    "slug": "greece",
    "name": "Greece",
    "region": "Europe",
    "heroDescription": "Greece is a Mediterranean masterpiece where sun-drenched islands, ancient walled cities, and turquoise waters create a landscape of unparalleled beauty. From the iconic Acropolis in Athens and the mystical monasteries of Meteora to the white-washed villages of Santorini and the rugged beauty of Crete, the country offers an endless array of experiences. Its culture is celebrated through its world-renowned culinary heritage, its colorful festivals, and its passionate love for life. Greece is a destination that captivates the senses and enriches the soul, offering a journey of profound discovery and the art of 'kefi'—the joy of the moment.",
    "placesToVisit": [
      {
        "name": "Athens",
        "summary": "The historic capital, home to the Acropolis and the cradle of democracy."
      },
      {
        "name": "Santorini",
        "summary": "A stunning volcanic island famous for its sunsets and white-washed villages."
      }
    ],
    "travelTips": [
      "The Euro (EUR) is the currency; credit cards are widely accepted.",
      "Ferries are the best way to explore the many islands along the coast.",
      "The best time to visit is the shoulder season (May-June or September-October)."
    ],
    "heroImage": {
      "src": "/images/countries/greece/hero.jpg",
      "alt": "The iconic white-washed buildings of Santorini"
    }
  },
  "grenada": {
    "slug": "grenada",
    "name": "Grenada",
    "region": "Americas",
    "heroDescription": "Grenada, the 'Spice Isle' of the Caribbean, is a lush and fragrant paradise of volcanic peaks, thundering waterfalls, and pristine white-sand beaches. Known for its production of nutmeg, cinnamon, and cloves, the island offers a sensory journey through its spice plantations and vibrant markets in the capital, St. George's. The coastline provides a tropical escape of turquoise waters and world-class diving at the underwater sculpture park. With its warm hospitality, colorful colonial architecture, and its commitment to preserving its unique Caribbean heritage, Grenada offers a sanctuary of peace and tropical splendor with a soulful, island heart.",
    "placesToVisit": [
      {
        "name": "St. George's",
        "summary": "One of the most beautiful harbor towns in the Caribbean, with colorful houses."
      },
      {
        "name": "Grand Anse Beach",
        "summary": "A world-famous stretch of white sand and turquoise waters."
      }
    ],
    "travelTips": [
      "The Eastern Caribbean Dollar (XCD) is the currency, but USD is widely accepted.",
      "Don't miss a tour of a spice plantation to learn about the island's heritage.",
      "The best time to visit is during the dry season from January to May."
    ],
    "heroImage": {
      "src": "/images/countries/grenada/hero.jpg",
      "alt": "The colorful harbor of St. George's"
    }
  },
  "guatemala": {
    "slug": "guatemala",
    "name": "Guatemala",
    "region": "Americas",
    "heroDescription": "Guatemala is a land of mystical beauty and profound history, where the soaring peaks of the Andes meet the ancient ruins of the Maya Empire and the lush depths of the rainforest. The iconic pyramids of Tikal stand as a powerful symbol of human ambition and spiritual depth, while the colonial city of Antigua captivates with its cobblestone streets and vibrant indigenous culture. The country's landscape is a kaleidoscope of diverse environments, from the high-altitude waters of Lake Atitlán to the thundering waterfalls of Semuc Champey. Guatemala is a destination that captivates the senses and the soul, offering a journey of profound discovery.",
    "placesToVisit": [
      {
        "name": "Antigua",
        "summary": "A beautiful colonial city surrounded by volcanoes and a UNESCO World Heritage site."
      },
      {
        "name": "Tikal",
        "summary": "One of the most spectacular Maya archaeological sites, hidden in the jungle."
      }
    ],
    "travelTips": [
      "The Quetzal (GTQ) is the currency; cash is necessary for many transactions.",
      "Learning basic Spanish will greatly enhance your experience with locals.",
      "The best time to visit is during the dry season from November to April."
    ],
    "heroImage": {
      "src": "/images/countries/guatemala/hero.jpg",
      "alt": "The ancient Maya pyramids of Tikal"
    }
  },
  "guinea": {
    "slug": "guinea",
    "name": "Guinea",
    "region": "Africa",
    "heroDescription": "Guinea is a land of rugged mountains and thundering waterfalls, often called the 'Water Tower of West Africa' for its role as the source of the Niger, Senegal, and Gambia rivers. The Fouta Djallon highlands offer a dramatic landscape of sandstone plateaus and deep canyons, providing some of the best hiking in the region. The country's culture is a rich tapestry of music and dance, reflected in the vibrant energy of the capital, Conakry, and the traditional villages of the interior. With its raw, untamed beauty and its deep-rooted heritage, Guinea offers a rare and authentic experience for those seeking to explore the wild heart of West Africa.",
    "placesToVisit": [
      {
        "name": "Fouta Djallon",
        "summary": "A spectacular highland region known for its hiking and waterfalls."
      },
      {
        "name": "Conakry",
        "summary": "A dynamic coastal capital with a vibrant music scene and lively markets."
      }
    ],
    "travelTips": [
      "French is the official language; basic phrases are essential for travel.",
      "The Guinean Franc (GNF) is the currency; cash is king.",
      "The best time to visit is during the dry season from November to April."
    ],
    "heroImage": {
      "src": "/images/countries/guinea/hero.jpg",
      "alt": "The thundering waterfalls of the Fouta Djallon"
    }
  },
  "guinea-bissau": {
    "slug": "guineabissau",
    "name": "Guinea-Bissau",
    "region": "Africa",
    "heroDescription": "Guinea-Bissau is a remote and beautiful West African nation, defined by its lush rainforests, dramatic peaks, and a traditional culture that remains deeply connected to the land and sea. The Bijagós Archipelago, a UNESCO Biosphere Reserve, offers a tropical paradise of pristine beaches and world-class wildlife viewing, including the rare saltwater hippo. The country's history is visible in its faded Portuguese colonial architecture and its resilient, welcoming spirit. With its warm hospitality and its untouched natural beauty, Guinea-Bissau offers a rare and authentic experience of island life at the very edge of the world, where the traditional culture remains central to the nation's identity.",
    "placesToVisit": [
      {
        "name": "Bijagós Archipelago",
        "summary": "A stunning chain of islands and a sanctuary for unique wildlife."
      },
      {
        "name": "Bissau",
        "summary": "A relaxed coastal capital with a beautiful old quarter and vibrant markets."
      }
    ],
    "travelTips": [
      "Portuguese and Kriol are the official languages; basic phrases are helpful.",
      "The West African CFA Franc (XOF) is the currency; cash is necessary.",
      "The best time to visit is during the dry season from November to May."
    ],
    "heroImage": {
      "src": "/images/countries/guineabissau/hero.jpg",
      "alt": "The pristine beaches of the Bijagós Archipelago"
    }
  },
  "guyana": {
    "slug": "guyana",
    "name": "Guyana",
    "region": "Americas",
    "heroDescription": "Guyana is a wild and untamed frontier on the northern coast of South America, where the vast majority of the land is covered in pristine, primary rainforest. It is a land of striking contrasts and immense natural beauty, where the futuristic skyline of Georgetown meets the ancient, traditional cultures of the indigenous peoples. The Kaieteur Falls, one of the world's most powerful thundering waterfalls, stands as a powerful symbol of nature's raw power, while the country's interior offers a landscape of lush rainforests and unique biodiversity. With its unique blend of Caribbean heritage and its role as an off-the-beaten-path destination, Guyana offers a soulful and authentic journey.",
    "placesToVisit": [
      {
        "name": "Kaieteur Falls",
        "summary": "One of the world's most spectacular and powerful single-drop waterfalls."
      },
      {
        "name": "Georgetown",
        "summary": "A historic coastal capital with a rich colonial heritage and vibrant markets."
      }
    ],
    "travelTips": [
      "English is the official language, making it very easy for many travelers.",
      "The Guyanese Dollar (GYD) is the currency; cash is necessary.",
      "The best time to visit is during the dry seasons (February-April and August-November)."
    ],
    "heroImage": {
      "src": "/images/countries/guyana/hero.jpg",
      "alt": "The thundering majesty of Kaieteur Falls"
    }
  },
  "haiti": {
    "slug": "haiti",
    "name": "Haiti",
    "region": "Americas",
    "heroDescription": "Haiti is a land of profound history and resilient spirit, the first independent black republic in the world and a center of vibrant art, music, and spiritual depth. Its history is etched into the stone of the Citadelle Laferrière, a massive fortress perched high in the mountains, and the ruins of the Sans-Souci Palace. The country's culture is a rich tapestry of African and French influences, reflected in its world-class art scene and its passionate love for life. Despite its challenges, Haiti remains a place of deep cultural depth and gentle hospitality, offering a profound and moving experience for those seeking to understand the roots of faith and human resilience.",
    "placesToVisit": [
      {
        "name": "Citadelle Laferrière",
        "summary": "A massive and spectacular mountain fortress and a UNESCO World Heritage site."
      },
      {
        "name": "Jacmel",
        "summary": "A beautiful coastal town known for its vibrant arts scene and colonial architecture."
      }
    ],
    "travelTips": [
      "French and Haitian Creole are the official languages; basic phrases are helpful.",
      "The Gourde (HTG) is the currency; USD is also widely used.",
      "Check the latest security updates and travel with experienced local operators."
    ],
    "heroImage": {
      "src": "/images/countries/haiti/hero.jpg",
      "alt": "The majestic Citadelle Laferrière in the mountains"
    }
  },
  "holy-see": {
    "slug": "holysee",
    "name": "Holy See",
    "region": "Europe",
    "heroDescription": "The Holy See, or Vatican City, is the smallest sovereign state in the world, a tiny enclave within Rome that serves as the spiritual and administrative heart of the Roman Catholic Church. It is a land of monumental art and extraordinary architecture, home to the iconic St. Peter's Basilica and the Vatican Museums, which house some of the world's most important treasures, including the Sistine Chapel. Despite its small size, the Holy See is a global hub of faith and culture, providing a grand and orderly escape where high-end history and spiritual depth coexist in a landscape of quiet elegance. It is a place where history and tradition remain central to the nation's identity.",
    "placesToVisit": [
      {
        "name": "St. Peter's Basilica",
        "summary": "One of the world's largest and most important churches, a masterpiece of art."
      },
      {
        "name": "Vatican Museums",
        "summary": "Home to an immense collection of art and the iconic Sistine Chapel."
      }
    ],
    "travelTips": [
      "Dress modestly when visiting the Vatican; shoulders and knees must be covered.",
      "The Euro (EUR) is the currency; credit cards are widely accepted.",
      "Book your museum tickets in advance to avoid the long queues."
    ],
    "heroImage": {
      "src": "/images/countries/holysee/hero.jpg",
      "alt": "The iconic dome of St. Peter's Basilica"
    }
  },
  "honduras": {
    "slug": "honduras",
    "name": "Honduras",
    "region": "Americas",
    "heroDescription": "Honduras is a land of striking contrasts and immense natural beauty, where the ancient ruins of the Maya Empire meet the turquoise waters of the Caribbean and the lush rainforests of the interior. The iconic ruins of Copán stand as a powerful symbol of human ambition and spiritual depth, while the Bay Islands offer a tropical paradise of world-class diving and pristine coral reefs. The country's landscape is a kaleidoscope of diverse environments, from the high-altitude peaks of the Celaque Mountains to the thundering waterfalls of Pulhapanzak. With its warm hospitality and its deep-rooted heritage, Honduras is a destination of immense spirit and natural beauty.",
    "placesToVisit": [
      {
        "name": "Roatán",
        "summary": "A beautiful island in the Caribbean, famous for its diving and beaches."
      },
      {
        "name": "Copán Ruins",
        "summary": "One of the most important Maya archaeological sites, known for its stelae."
      }
    ],
    "travelTips": [
      "The Lempira (HNL) is the currency; USD is widely accepted in the Bay Islands.",
      "Learning basic Spanish will greatly enhance your experience with locals.",
      "The best time to visit is during the dry season from December to April."
    ],
    "heroImage": {
      "src": "/images/countries/honduras/hero.jpg",
      "alt": "The ancient Maya ruins of Copán"
    }
  },
  "hungary": {
    "slug": "hungary",
    "name": "Hungary",
    "region": "Europe",
    "heroDescription": "Hungary is a land of captivating history, vibrant culture, and a spirit of innovation that has influenced the world. From the romantic streets of Budapest and the historic spires of Eger and Pécs to the rugged beauty of the Bükk Mountains and the dramatic coastline of Lake Balaton, the country offers an endless array of experiences. Its history is etched into grand palaces, intricate cathedrals, and the ruins of ancient empires, while its culture is celebrated through its world-renowned music, art, and culinary heritage. Hungary is a destination that captivates the senses and enriches the soul, offering a journey of profound discovery and timeless elegance.",
    "placesToVisit": [
      {
        "name": "Budapest",
        "summary": "The 'Pearl of the Danube,' famous for its thermal baths and architecture."
      },
      {
        "name": "Lake Balaton",
        "summary": "The largest freshwater lake in Central Europe and a popular summer resort."
      }
    ],
    "travelTips": [
      "The Forint (HUF) is the currency; credit cards are widely accepted in cities.",
      "Thermal baths are a central part of life; try to experience a traditional one.",
      "The train and bus network is excellent for traveling between cities and towns."
    ],
    "heroImage": {
      "src": "/images/countries/hungary/hero.jpg",
      "alt": "The grand Parliament building in Budapest at night"
    }
  },
  "iceland": {
    "slug": "iceland",
    "name": "Iceland",
    "region": "Europe",
    "heroDescription": "Iceland is a land of raw, elemental power, where the thundering waterfalls of Skógafoss and Gulfoss meet the surreal, volcanic landscapes of the Highlands and the magical glow of the Northern Lights. Its coastline is a labyrinth of deep fjords, black-sand beaches, and pristine islands, best explored by a traditional coastal steamer or a scenic road trip along the Ring Road. The country's interior offers a landscape of vast glaciers, high-altitude plateaus, and the snow-capped peaks of the Vatnajökull mountains. From the vibrant culture of Reykjavík to the remote beauty of the Westfjords, Iceland is a sanctuary of peace and natural splendor.",
    "placesToVisit": [
      {
        "name": "Reykjavík",
        "summary": "A cool and compact capital city known for its design, food, and nightlife."
      },
      {
        "name": "Blue Lagoon",
        "summary": "A world-famous geothermal spa set in a surreal lava field."
      }
    ],
    "travelTips": [
      "The Icelandic Króna (ISK) is the currency; credit cards are used for everything.",
      "The weather can change rapidly; always dress in layers and bring waterproofs.",
      "The best time for Northern Lights is from September to March."
    ],
    "heroImage": {
      "src": "/images/countries/iceland/hero.jpg",
      "alt": "The thundering Skógafoss waterfall in Iceland"
    }
  },
  "india": {
    "slug": "india",
    "name": "India",
    "region": "Asia",
    "heroDescription": "India is a continental giant of irrepressible energy and immense cultural diversity, where the futuristic skylines of Mumbai and Bangalore meet the ancient kingdoms of the north and the lush backwaters of the south. Its culture is a rich tapestry of over 1,000 languages and ethnic groups, reflected in its world-class music, film, and culinary scenes. The country's landscape is a kaleidoscope of diverse environments, from the high-altitude peaks of the Himalayas to the turquoise waters of the Andaman Islands and the remote beauty of the Thar Desert. India is a destination that captivates the senses and the soul, offering a journey of profound discovery.",
    "placesToVisit": [
      {
        "name": "Taj Mahal",
        "summary": "The ultimate symbol of love and a masterpiece of Mughal architecture."
      },
      {
        "name": "Varanasi",
        "summary": "One of the world's oldest continuously inhabited cities and a spiritual heart."
      }
    ],
    "travelTips": [
      "The Indian Rupee (INR) is the currency; cash is necessary for many transactions.",
      "Learning basic Hindi phrases will greatly enhance your experience with locals.",
      "The best time to visit is during the dry season from October to March."
    ],
    "heroImage": {
      "src": "/images/countries/india/hero.jpg",
      "alt": "The iconic Taj Mahal at sunrise"
    }
  },
  "indonesia": {
    "slug": "indonesia",
    "name": "Indonesia",
    "region": "Asia",
    "heroDescription": "Indonesia is an archipelago of over 17,000 islands scattered across the turquoise waters of the western Pacific Ocean like a string of pearls. From the spiritual heart of the Rice Terraces of Bali and the ancient temples of Borobudur to the sun-drenched beaches of the Gili Islands and the rugged beauty of Komodo, the country offers an endless array of experiences. Its culture is a rich tapestry of Malay, Spanish, and American influences, reflected in its world-class culinary scene and its passionate love for music and life. With its warm hospitality and its pristine natural beauty, Indonesia is a premier destination for adventure and serenity.",
    "placesToVisit": [
      {
        "name": "Bali",
        "summary": "A stunning island famous for its beaches, temples, and vibrant culture."
      },
      {
        "name": "Borobudur",
        "summary": "The world's largest Buddhist temple and a UNESCO World Heritage site."
      }
    ],
    "travelTips": [
      "The Indonesian Rupiah (IDR) is the currency; credit cards are widely accepted.",
      "Learning basic Indonesian phrases will greatly enhance your experience with locals.",
      "The best time to visit is during the dry season from May to September."
    ],
    "heroImage": {
      "src": "/images/countries/indonesia/hero.jpg",
      "alt": "The iconic rice terraces of Ubud in Bali"
    }
  },
  "iran": {
    "slug": "iran",
    "name": "Iran",
    "region": "Asia",
    "heroDescription": "Iran is a land of profound history and extraordinary architecture, once the heart of the powerful Persian Empire and a center of Islamic learning on the ancient Silk Road. The cities of Isfahan, Shiraz, and Yazd offer a maze of colorful souks, intricate palaces, and historic mosques, reflecting a rich tapestry of Persian and Turkic influences. The country's landscape is a mix of high-altitude plateaus, fertile valleys, and the vast, wind-sculpted sands of the Lut Desert. With its warm hospitality and its role as a bridge between East and West, Iran is a destination of immense scale and depth, offering a journey of profound discovery and the art of the Silk Road.",
    "placesToVisit": [
      {
        "name": "Isfahan",
        "summary": "Famous for its stunning Islamic architecture and the grand Naqsh-e Jahan Square."
      },
      {
        "name": "Persepolis",
        "summary": "The ancient ceremonial capital of the Achaemenid Empire."
      }
    ],
    "travelTips": [
      "The Iranian Rial (IRR) is the currency; cash is necessary as international cards don't work.",
      "Learning basic Persian phrases will greatly enhance your experience with locals.",
      "Dress modestly, as the country follows Islamic dress codes."
    ],
    "heroImage": {
      "src": "/images/countries/iran/hero.jpg",
      "alt": "The stunning Islamic architecture of Isfahan"
    }
  },
  "iraq": {
    "slug": "iraq",
    "name": "Iraq",
    "region": "Asia",
    "heroDescription": "Iraq is a land of profound history and extraordinary architecture, once the heart of the powerful Mesopotamian civilization and a center of Islamic learning in Baghdad. The ancient ruins of Babylon and the historic streets of Erbil stand as powerful symbols of human ambition and spiritual depth, while the country's landscape is a mix of high-altitude plateaus, fertile valleys, and the vast, wind-sculpted sands of the desert. Despite its turbulent recent history, Iraq remains a place of deep cultural depth and resilient spirit, offering a profound and moving experience for those seeking to understand the roots of human society and the enduring power of history.",
    "placesToVisit": [
      {
        "name": "Erbil",
        "summary": "One of the world's oldest continuously inhabited cities and a vibrant hub."
      },
      {
        "name": "Babylon",
        "summary": "The ancient city of Mesopotamia and a UNESCO World Heritage site."
      }
    ],
    "travelTips": [
      "The Iraqi Dinar (IQD) is the currency; cash is necessary for most transactions.",
      "Learning basic Arabic phrases will greatly enhance your experience with locals.",
      "Check the latest security updates and travel with experienced local operators."
    ],
    "heroImage": {
      "src": "/images/countries/iraq/hero.jpg",
      "alt": "The ancient citadel of Erbil"
    }
  },
  "ireland": {
    "slug": "ireland",
    "name": "Ireland",
    "region": "Europe",
    "heroDescription": "Ireland is a land of captivating history, vibrant culture, and a spirit of innovation that has influenced the world. From the romantic streets of Dublin and the historic spires of Cork and Galway to the rugged beauty of the Wild Atlantic Way and the dramatic coastline of the Cliffs of Moher, the country offers an endless array of experiences. Its history is etched into grand palaces, intricate cathedrals, and the ruins of ancient empires, while its culture is celebrated through its world-renowned literature, music, and art. Ireland is a destination that captivates the senses and enriches the soul, offering a journey of profound discovery.",
    "placesToVisit": [
      {
        "name": "Dublin",
        "summary": "The vibrant capital city famous for its history, literature, and pubs."
      },
      {
        "name": "Cliffs of Moher",
        "summary": "A spectacular stretch of coastline and one of Ireland's most iconic sites."
      }
    ],
    "travelTips": [
      "The Euro (EUR) is the currency in the Republic of Ireland; GBP in Northern Ireland.",
      "The weather can change rapidly; always bring a waterproof jacket.",
      "Driving is on the left side of the road."
    ],
    "heroImage": {
      "src": "/images/countries/ireland/hero.jpg",
      "alt": "The dramatic Cliffs of Moher on the Atlantic coast"
    }
  },
  "israel": {
    "slug": "israel",
    "name": "Israel",
    "region": "Asia",
    "heroDescription": "Israel is a land of profound history and extraordinary architecture, once the heart of the powerful ancient kingdoms and a center of spiritual depth in Jerusalem. The ancient ruins of Masada and the historic streets of Tel Aviv stand as powerful symbols of human ambition and spiritual depth, while the country's landscape is a mix of high-altitude plateaus, fertile valleys, and the vast, wind-sculpted sands of the Negev Desert. Despite its complex political situation, Israel remains a place of deep cultural depth and resilient spirit, offering a profound and moving experience for those seeking to understand the roots of faith and human resilience.",
    "placesToVisit": [
      {
        "name": "Jerusalem",
        "summary": "The spiritual heart of the world and a city of immense historical depth."
      },
      {
        "name": "Tel Aviv",
        "summary": "A vibrant coastal city known for its beaches, food, and nightlife."
      }
    ],
    "travelTips": [
      "The Israeli Shekel (ILS) is the currency; credit cards are widely accepted.",
      "Learning basic Hebrew phrases will greatly enhance your experience with locals.",
      "Check the latest security updates and travel with experienced local operators."
    ],
    "heroImage": {
      "src": "/images/countries/israel/hero.jpg",
      "alt": "The historic Old City of Jerusalem"
    }
  },
  "italy": {
    "slug": "italy",
    "name": "Italy",
    "region": "Europe",
    "heroDescription": "Italy is a Mediterranean masterpiece where sun-drenched islands, ancient walled cities, and turquoise waters create a landscape of unparalleled beauty. From the iconic architecture of Rome and the Renaissance treasures of Florence to the vibrant streets of Milan and the rugged beauty of the Dolomites, the country offers an endless array of experiences. Its culture is celebrated through its world-renowned culinary heritage, its colorful festivals, and its passionate love for life. Italy is a destination that captivates the senses and enriches the soul, offering a journey of profound discovery and the art of 'la dolce vita'—the sweet life.",
    "placesToVisit": [
      {
        "name": "Rome",
        "summary": "The 'Eternal City,' famous for its history, art, and iconic landmarks."
      },
      {
        "name": "Venice",
        "summary": "A unique city of canals and a masterpiece of Renaissance architecture."
      }
    ],
    "travelTips": [
      "The Euro (EUR) is the currency; credit cards are widely accepted.",
      "Learning basic Italian phrases will greatly improve your interactions.",
      "Lunch is the main meal of the day; many shops close for a break in the afternoon."
    ],
    "heroImage": {
      "src": "/images/countries/italy/hero.jpg",
      "alt": "The iconic Colosseum in Rome at sunset"
    }
  },
  "jamaica": {
    "slug": "jamaica",
    "name": "Jamaica",
    "region": "Americas",
    "heroDescription": "Jamaica is a land of rhythmic reggae, vibrant culture, and some of the most diverse landscapes in the Caribbean. From the sun-drenched beaches of Montego Bay and the turquoise waters of the Blue Lagoon to the high-altitude peaks of the Blue Mountains, the country offers a staggering variety of experiences. Kingston, the vibrant capital, captivates with its rich musical heritage and vibrant street life. Whether exploring the lush rainforests of Portland or dancing the night away in a local dancehall, travelers find a country of immense spirit and tropical splendor, where the philosophy of 'One Love' defines the culture.",
    "placesToVisit": [
      {
        "name": "Montego Bay",
        "summary": "A vibrant coastal city famous for its beaches, resorts, and nightlife."
      },
      {
        "name": "Blue Mountains",
        "summary": "A stunning mountain range famous for its coffee and hiking trails."
      }
    ],
    "travelTips": [
      "The Jamaican Dollar (JMD) is the currency; USD is widely accepted in resorts.",
      "Learning basic Patois phrases will greatly enhance your experience with locals.",
      "The best time to visit is during the dry season from December to April."
    ],
    "heroImage": {
      "src": "/images/countries/jamaica/hero.jpg",
      "alt": "The turquoise waters of the Blue Lagoon in Jamaica"
    }
  },
  "japan": {
    "slug": "japan",
    "name": "Japan",
    "region": "Asia",
    "heroDescription": "Japan is a fascinating blend of ancient traditions and futuristic innovation, where serene Zen gardens and historic temples sit alongside neon-lit skyscrapers and high-speed trains. From the bustling energy of Tokyo and the cultural heart of Kyoto to the snow-capped peak of Mount Fuji and the tropical islands of Okinawa, the country offers a staggering variety of experiences. Its culture is defined by a deep respect for craftsmanship, seasonal beauty, and a unique aesthetic that values both simplicity and complexity. Whether soaking in an onsen, savoring world-class sushi, or exploring a remote mountain temple, Japan provides a journey of profound grace.",
    "placesToVisit": [
      {
        "name": "Tokyo",
        "summary": "A futuristic metropolis known for its neon lights, food, and culture."
      },
      {
        "name": "Kyoto",
        "summary": "The cultural heart of Japan, home to hundreds of temples and gardens."
      }
    ],
    "travelTips": [
      "The Japanese Yen (JPY) is the currency; cash is still necessary in some places.",
      "The Japan Rail Pass is the best way to travel between cities for tourists.",
      "Learning basic Japanese phrases will greatly improve your interactions."
    ],
    "heroImage": {
      "src": "/images/countries/japan/hero.jpg",
      "alt": "The iconic Mount Fuji with cherry blossoms"
    }
  },
  "jordan": {
    "slug": "jordan",
    "name": "Jordan",
    "region": "Asia",
    "heroDescription": "Jordan is a land of timeless wonders and desert majesty, where the turquoise waters of the Dead Sea meet the dramatic, wind-sculpted sands of Wadi Rum and the soaring peaks of the Al Hajar mountains. The ancient city of Petra, a UNESCO World Heritage site, stands as a powerful symbol of human ambition and spiritual depth, while the capital, Amman, features an opulent palace and historic forts. The country's interior is a landscape of hidden wadis, ancient mud-brick villages, and the surreal landscape of the Jebel Akhdar. With its warm hospitality and its commitment to preserving its unique Arab culture, Jordan offers a peaceful sanctuary.",
    "placesToVisit": [
      {
        "name": "Petra",
        "summary": "The ancient 'Rose City' and one of the New Seven Wonders of the World."
      },
      {
        "name": "Wadi Rum",
        "summary": "A spectacular desert landscape of red sands and rock formations."
      }
    ],
    "travelTips": [
      "The Jordanian Dinar (JOD) is the currency; credit cards are widely accepted in cities.",
      "The Jordan Pass is a great way to save on visa and entry fees for tourists.",
      "Learning basic Arabic phrases will greatly enhance your experience with locals."
    ],
    "heroImage": {
      "src": "/images/countries/jordan/hero.jpg",
      "alt": "The iconic Treasury building in Petra"
    }
  },
  "kazakhstan": {
    "slug": "kazakhstan",
    "name": "Kazakhstan",
    "region": "Asia",
    "heroDescription": "Kazakhstan is a land of vast, wind-swept steppes and nomadic traditions, where the 'Eternal Blue Sky' overlooks a landscape of dramatic mountains, ancient deserts, and rolling grasslands. It is a paradise for those seeking a true wilderness adventure, with traditional yurts still used by nomadic herders who follow the rhythms of the seasons. The Gobi Desert offers a surreal landscape of shifting sands and dinosaur fossils, while the Altai Mountains provide a sanctuary for the unique golden eagle hunters. With its rich history of the Mongol Empire and a culture that values hospitality and freedom, Kazakhstan provides a raw and authentic journey through the heart of Central Asia.",
    "placesToVisit": [
      {
        "name": "Almaty",
        "summary": "A vibrant city known for its mountain backdrop and leafy boulevards."
      },
      {
        "name": "Charyn Canyon",
        "summary": "A spectacular canyon system often compared to the Grand Canyon."
      }
    ],
    "travelTips": [
      "The Tenge (KZT) is the currency; credit cards are widely used in cities.",
      "Learning basic Russian or Kazakh phrases will greatly enhance your experience.",
      "The best time to visit is during the spring or autumn for the best weather."
    ],
    "heroImage": {
      "src": "/images/countries/kazakhstan/hero.jpg",
      "alt": "The dramatic landscapes of Charyn Canyon"
    }
  },
  "kenya": {
    "slug": "kenya",
    "name": "Kenya",
    "region": "Africa",
    "heroDescription": "Kenya is the quintessential home of the African safari, a land of vast savannas, iconic wildlife, and the thundering majesty of the Great Migration. The Maasai Mara National Reserve offers some of Africa's best wildlife viewing, with lions and leopards roaming its lush valleys, while the Amboseli National Park provides a sophisticated escape of elephant safaris and views of Mount Kilimanjaro. The country's history is etched into grand cities like Nairobi and the ruins of ancient maritime empires along the coast. Kenya is a destination of immense scale and depth, offering a journey of profound discovery and the art of the wild.",
    "placesToVisit": [
      {
        "name": "Maasai Mara",
        "summary": "A world-famous reserve and the site of the Great Migration."
      },
      {
        "name": "Diani Beach",
        "summary": "A stunning stretch of white sand and turquoise waters on the Indian Ocean."
      }
    ],
    "travelTips": [
      "The Kenyan Shilling (KES) is the currency; credit cards are accepted in major lodges.",
      "The best time for the Great Migration is from July to October.",
      "Learning basic Swahili phrases will greatly enhance your experience with locals."
    ],
    "heroImage": {
      "src": "/images/countries/kenya/hero.jpg",
      "alt": "Wildlife on the vast savannas of the Maasai Mara"
    }
  },
  "kiribati": {
    "slug": "kiribati",
    "name": "Kiribati",
    "region": "Oceania",
    "heroDescription": "Kiribati is a remote and beautiful archipelago of 33 coral atolls scattered across the vast expanse of the central Pacific Ocean. It is a land of pristine turquoise lagoons, swaying palm trees, and a traditional seafaring culture that remains deeply connected to the rhythms of the ocean. Despite the challenges of rising sea levels and its small size, the people of Kiribati maintain a resilient and welcoming spirit, offering a rare and authentic experience of island life at the very edge of the world. It is a place of quiet beauty and a unique, off-the-beaten-path experience, where the traditional culture remains central to the nation's identity.",
    "placesToVisit": [
      {
        "name": "Christmas Island",
        "summary": "The world's largest coral atoll and a premier destination for fishing."
      },
      {
        "name": "Tarawa",
        "summary": "The capital atoll, known for its WWII history and vibrant culture."
      }
    ],
    "travelTips": [
      "The Australian Dollar (AUD) is the currency; cash is necessary.",
      "The best way to travel between atolls is by small plane or boat.",
      "The best time to visit is during the dry season from May to October."
    ],
    "heroImage": {
      "src": "/images/countries/kiribati/hero.jpg",
      "alt": "A pristine turquoise lagoon in Kiribati"
    }
  },
  "kuwait": {
    "slug": "kuwait",
    "name": "Kuwait",
    "region": "Asia",
    "heroDescription": "Kuwait is a modern and wealthy desert nation at the tip of the Arabian Gulf, where a futuristic skyline of bold and innovative architecture meets a rich maritime and trading heritage. The capital, Kuwait City, features an opulent palace, world-class museums, and a bustling souq that reflects a rich cultural depth. The country's coastline features pristine beaches and modern marinas, while the desert interior holds the echoes of ancient nomadic life. With its vibrant arts scene, world-class shopping, and its role as a global hub of diplomacy and sport, Kuwait is a sophisticated and welcoming gateway to the Gulf.",
    "placesToVisit": [
      {
        "name": "Kuwait City",
        "summary": "A modern capital city known for its iconic towers and vibrant food scene."
      },
      {
        "name": "Failaka Island",
        "summary": "A historic island with ancient ruins and a mix of old and new."
      }
    ],
    "travelTips": [
      "The Kuwaiti Dinar (KWD) is the world's highest-valued currency.",
      "Learning basic Arabic phrases will greatly enhance your experience with locals.",
      "The best time to visit is during the cooler months from November to March."
    ],
    "heroImage": {
      "src": "/images/countries/kuwait/hero.jpg",
      "alt": "The iconic Kuwait Towers overlooking the city"
    }
  },
  "kyrgyzstan": {
    "slug": "kyrgyzstan",
    "name": "Kyrgyzstan",
    "region": "Asia",
    "heroDescription": "Kyrgyzstan is a land of celestial mountains and nomadic traditions, where the soaring peaks of the Tian Shan range define the landscape and the soul of the nation. It is a paradise for hikers and mountaineers, with the Pamir Highway offering one of the most spectacular and challenging road journeys on Earth. The country's landscape is a mix of high-altitude plateaus, thundering waterfalls, and unique biodiversity in its national parks. With its rich Silk Road history and a culture that values hospitality and freedom, Kyrgyzstan provides a raw and authentic adventure in the heart of Central Asia, where life is lived in harmony with the elements.",
    "placesToVisit": [
      {
        "name": "Issyk-Kul Lake",
        "summary": "The world's second-largest alpine lake and a popular summer resort."
      },
      {
        "name": "Ala Archa National Park",
        "summary": "A spectacular mountain park known for its hiking and climbing."
      }
    ],
    "travelTips": [
      "The Som (KGS) is the currency; cash is necessary outside major cities.",
      "Learning basic Russian or Kyrgyz phrases will greatly enhance your experience.",
      "The best time to visit is during the summer for hiking and mountain activities."
    ],
    "heroImage": {
      "src": "/images/countries/kyrgyzstan/hero.jpg",
      "alt": "The stunning alpine scenery of Kyrgyzstan"
    }
  },
  "lao-peoples-democratic-republic": {
    "slug": "laos",
    "name": "Lao People's Democratic Republic",
    "region": "Asia",
    "heroDescription": "Laos is a land of golden temples, sun-drenched rivers, and infectious energy, where the futuristic skyline of Vientiane meets the ancient ruins of Luang Prabang and the lush jungles of the north. Its culture is a rich tapestry of Buddhist traditions and modern Pacific influences, reflected in its world-class culinary scene and its passionate love for life. The Mekong River serves as the nation's lifeblood, winding through a landscape of rolling savannas and vibrant markets. With its warm hospitality and its pristine natural beauty, Laos is a premier destination for adventure and serenity, offering a journey of profound discovery.",
    "placesToVisit": [
      {
        "name": "Luang Prabang",
        "summary": "A stunning UNESCO-listed city known for its temples and night market."
      },
      {
        "name": "Vang Vieng",
        "summary": "A beautiful town surrounded by karst mountains and adventure activities."
      }
    ],
    "travelTips": [
      "The Kip (LAK) is the currency; cash is necessary for most transactions.",
      "Learning basic Lao phrases will greatly enhance your experience with locals.",
      "The best time to visit is during the dry season from November to March."
    ],
    "heroImage": {
      "src": "/images/countries/laos/hero.jpg",
      "alt": "The beautiful Kuang Si Falls near Luang Prabang"
    }
  },
  "latvia": {
    "slug": "latvia",
    "name": "Latvia",
    "region": "Europe",
    "heroDescription": "Latvia is a land of captivating history, vibrant culture, and a spirit of innovation that has influenced the world. From the romantic streets of Riga and the historic spires of Sigulda and Cēsis to the rugged beauty of the Gauja National Park and the dramatic coastline of the Baltic Sea, the country offers an endless array of experiences. Its history is etched into grand palaces, intricate cathedrals, and the ruins of ancient empires, while its culture is celebrated through its world-renowned literature, music, and art. Latvia is a destination that captivates the senses and enriches the soul, offering a journey of profound discovery.",
    "placesToVisit": [
      {
        "name": "Riga",
        "summary": "A vibrant capital city famous for its Art Nouveau architecture and history."
      },
      {
        "name": "Jūrmala",
        "summary": "A beautiful coastal resort town known for its wooden architecture and beaches."
      }
    ],
    "travelTips": [
      "The Euro (EUR) is the currency; credit cards are widely accepted.",
      "Learning basic Latvian phrases will greatly improve your interactions.",
      "The best time to visit is during the summer for the best weather."
    ],
    "heroImage": {
      "src": "/images/countries/latvia/hero.jpg",
      "alt": "The colorful buildings of Riga's Old Town"
    }
  },
  "lebanon": {
    "slug": "lebanon",
    "name": "Lebanon",
    "region": "Asia",
    "heroDescription": "Lebanon is a land of profound history and extraordinary architecture, once the heart of the powerful Phoenician civilization and a center of Islamic learning in Beirut. The ancient ruins of Baalbek and the historic streets of Byblos stand as powerful symbols of human ambition and spiritual depth, while the country's landscape is a mix of high-altitude plateaus, fertile valleys, and a sun-drenched Mediterranean coast. Despite its turbulent recent history, Lebanon remains a place of deep cultural depth and resilient spirit, offering a profound and moving experience for those seeking to understand the roots of human society.",
    "placesToVisit": [
      {
        "name": "Beirut",
        "summary": "A vibrant capital city known for its history, food, and nightlife."
      },
      {
        "name": "Byblos",
        "summary": "One of the world's oldest continuously inhabited cities and a historic port."
      }
    ],
    "travelTips": [
      "The Lebanese Pound (LBP) is the currency; check the latest exchange rates.",
      "Learning basic Arabic or French phrases will greatly enhance your experience.",
      "Check the latest security updates and travel with experienced local operators."
    ],
    "heroImage": {
      "src": "/images/countries/lebanon/hero.jpg",
      "alt": "The ancient Roman ruins of Baalbek"
    }
  },
  "lesotho": {
    "slug": "lesotho",
    "name": "Lesotho",
    "region": "Africa",
    "heroDescription": "Lesotho, the 'Kingdom in the Sky,' is a land of stunning mountain scenery, vibrant culture, and a resilient, welcoming spirit. It is a premier destination for hiking and horse riding, with the Maloti Mountains offering some of the most spectacular and challenging trails in Southern Africa. The country's landscape is defined by its high-altitude plateaus, thundering waterfalls, and unique biodiversity in its national parks. With its warm hospitality and its raw, untamed beauty, Lesotho offers a rare and authentic experience of mountain life, where the traditional culture remains central to the nation's identity.",
    "placesToVisit": [
      {
        "name": "Sani Pass",
        "summary": "A spectacular mountain pass and the gateway to the Kingdom in the Sky."
      },
      {
        "name": "Maletsunyane Falls",
        "summary": "One of the highest single-drop waterfalls in Africa, set in a deep gorge."
      }
    ],
    "travelTips": [
      "The Loti (LSL) is the currency, pegged 1:1 with the South African Rand.",
      "English and Sesotho are the official languages; English is widely spoken.",
      "The best time to visit is during the spring or autumn for the best weather."
    ],
    "heroImage": {
      "src": "/images/countries/lesotho/hero.jpg",
      "alt": "The dramatic mountain scenery of Lesotho"
    }
  },
  "liberia": {
    "slug": "liberia",
    "name": "Liberia",
    "region": "Africa",
    "heroDescription": "Liberia is a land of lush rainforests and pristine Atlantic beaches, a West African nation with a unique history and a resilient, welcoming spirit. Its coastline offers some of the world's best-kept secrets for surfers and sun-seekers, with perfect point breaks and a laid-back atmosphere in towns like Robertsport. The country's interior is a sanctuary of biodiversity, home to the rare pygmy hippopotamus and some of the region's last primary rainforest in the Sapo National Park. Despite its challenges, Liberia is a country of immense natural beauty and a soulful culture, offering an authentic and off-the-beaten-path experience.",
    "placesToVisit": [
      {
        "name": "Robertsport",
        "summary": "A world-class surf destination with beautiful beaches and a relaxed vibe."
      },
      {
        "name": "Sapo National Park",
        "summary": "A pristine rainforest sanctuary and a haven for unique wildlife."
      }
    ],
    "travelTips": [
      "English is the official language, making it very easy for many travelers.",
      "The Liberian Dollar (LRD) is the currency, but USD is widely used.",
      "The best time to visit is during the dry season from November to April."
    ],
    "heroImage": {
      "src": "/images/countries/liberia/hero.jpg",
      "alt": "The pristine Atlantic beaches of Robertsport"
    }
  },
  "libya": {
    "slug": "libya",
    "name": "Libya",
    "region": "Africa",
    "heroDescription": "Libya is a land of vast desert majesty and monumental ancient history, home to some of the world's best-preserved Roman ruins along its stretch of the Mediterranean coast. The ruins of Leptis Magna and Sabratha stand as silent witnesses to a grand imperial past, while the vibrant capital, Tripoli, is a city of energy and innovation with a historic medina. The country's landscape is a mix of high-altitude plateaus, fertile valleys, and the vast, wind-sculpted sands of the Sahara. Despite its challenges, Libya remains a place of deep cultural depth and resilient spirit, offering a profound and moving experience for the intrepid traveler.",
    "placesToVisit": [
      {
        "name": "Leptis Magna",
        "summary": "One of the world's best-preserved Roman cities and a UNESCO World Heritage site."
      },
      {
        "name": "Tripoli",
        "summary": "The historic capital city known for its medina and Mediterranean setting."
      }
    ],
    "travelTips": [
      "Arabic is the official language; basic phrases are essential for travel.",
      "The Libyan Dinar (LYD) is the currency; cash is necessary.",
      "Check the latest security updates and travel with experienced local operators."
    ],
    "heroImage": {
      "src": "/images/countries/libya/hero.jpg",
      "alt": "The ancient Roman ruins of Leptis Magna"
    }
  },
  "liechtenstein": {
    "slug": "liechtenstein",
    "name": "Liechtenstein",
    "region": "Europe",
    "heroDescription": "Liechtenstein is a tiny and ancient principality nestled high in the Alps between Switzerland and Austria, defined by its soaring peaks and medieval fortresses. The capital, Vaduz, features an opulent palace, world-class museums, and a relaxed, welcoming atmosphere. The country's history is visible in its narrow, cobblestone streets, its historic palaces, and its unique status as one of the world's smallest sovereign states. Despite its small size, Liechtenstein provides a grand and orderly escape, where high-end culture and pristine nature coexist in a landscape of quiet, mountain elegance.",
    "placesToVisit": [
      {
        "name": "Vaduz",
        "summary": "The capital city known for its castle and world-class art museums."
      },
      {
        "name": "Malbun",
        "summary": "A beautiful mountain resort town known for its skiing and hiking."
      }
    ],
    "travelTips": [
      "The Swiss Franc (CHF) is the official currency of Liechtenstein.",
      "German is the official language; English is widely spoken.",
      "The best way to explore the country is by hiking or using the efficient bus system."
    ],
    "heroImage": {
      "src": "/images/countries/liechtenstein/hero.jpg",
      "alt": "The iconic Vaduz Castle overlooking the capital"
    }
  },
  "lithuania": {
    "slug": "lithuania",
    "name": "Lithuania",
    "region": "Europe",
    "heroDescription": "Lithuania is a land of captivating history, vibrant culture, and a spirit of innovation that has influenced the world. From the romantic streets of Vilnius and the historic spires of Kaunas and Klaipėda to the rugged beauty of the Curonian Spit and the dramatic coastline of the Baltic Sea, the country offers an endless array of experiences. Its history is etched into grand palaces, intricate cathedrals, and the ruins of ancient empires, while its culture is celebrated through its world-renowned literature, music, and art. Lithuania is a destination that captivates the senses and enriches the soul, offering a journey of profound discovery.",
    "placesToVisit": [
      {
        "name": "Vilnius",
        "summary": "A vibrant capital city famous for its Baroque architecture and history."
      },
      {
        "name": "Trakai",
        "summary": "A stunning island castle and a historic capital of the Grand Duchy."
      }
    ],
    "travelTips": [
      "The Euro (EUR) is the currency; credit cards are widely accepted.",
      "Learning basic Lithuanian phrases will greatly improve your interactions.",
      "The best time to visit is during the summer for the best weather."
    ],
    "heroImage": {
      "src": "/images/countries/lithuania/hero.jpg",
      "alt": "The stunning island castle of Trakai"
    }
  },
  "luxembourg": {
    "slug": "luxembourg",
    "name": "Luxembourg",
    "region": "Europe",
    "heroDescription": "Luxembourg is a small but powerful European nation, a land of dramatic gorges, medieval fortresses, and a sophisticated, multicultural capital. Luxembourg City, built on the steep cliffs of the Alzette and Pétrusse rivers, features a UNESCO-listed old town and a network of ancient casemates. The country's interior, known as 'Little Switzerland,' offers a landscape of rugged rock formations, deep forests, and charming villages like Vianden with its fairytale castle. Despite its size, Luxembourg is a global hub of finance and diplomacy, providing a grand and orderly escape where high-end culture and pristine nature coexist in a landscape of quiet elegance.",
    "placesToVisit": [
      {
        "name": "Luxembourg City",
        "summary": "A stunning capital city known for its history, architecture, and gorges."
      },
      {
        "name": "Vianden",
        "summary": "A charming town famous for its perfectly preserved medieval castle."
      }
    ],
    "travelTips": [
      "Public transport is free for everyone throughout the entire country.",
      "The Euro (EUR) is the currency; credit cards are widely accepted.",
      "Luxembourgish, French, and German are the official languages."
    ],
    "heroImage": {
      "src": "/images/countries/luxembourg/hero.jpg",
      "alt": "The historic fortifications of Luxembourg City"
    }
  },
  "madagascar": {
    "slug": "madagascar",
    "name": "Madagascar",
    "region": "Africa",
    "heroDescription": "Madagascar is an island continent of staggering biodiversity and unique evolution, home to thousands of species found nowhere else on Earth, including the iconic lemurs and baobab trees. Its landscape is a kaleidoscope of diverse environments, from the razor-sharp limestone pinnacles of the Tsingy de Bemaraha to the lush rainforests of the east and the arid spiny forests of the south. The coastline offers pristine white-sand beaches and turquoise waters, such as those in Nosy Be and Île Sainte-Marie. With its unique blend of African and Austronesian cultures, Madagascar is a frontier of discovery and a sanctuary for nature lovers and adventurers.",
    "placesToVisit": [
      {
        "name": "Avenue of the Baobabs",
        "summary": "A stunning group of ancient baobab trees lining a dirt road in western Madagascar."
      },
      {
        "name": "Isalo National Park",
        "summary": "A spectacular park known for its sandstone formations, canyons, and lemurs."
      }
    ],
    "travelTips": [
      "The Malagasy Ariary (MGA) is the currency; cash is necessary as ATMs are rare.",
      "Learning basic French or Malagasy phrases will greatly enhance your experience.",
      "The best time to visit is during the dry season from May to October."
    ],
    "heroImage": {
      "src": "/images/countries/madagascar/hero.jpg",
      "alt": "The iconic Avenue of the Baobabs at sunset"
    }
  },
  "malawi": {
    "slug": "malawi",
    "name": "Malawi",
    "region": "Africa",
    "heroDescription": "Malawi, the 'Warm Heart of Africa,' is a land of friendly people and the shimmering expanse of Lake Malawi, the third-largest lake in Africa. This freshwater sea is a sanctuary for hundreds of species of colorful cichlid fish, offering a unique and tranquil experience for diving and snorkeling. The country's landscape is a mix of high-altitude plateaus, such as the Nyika and Mulanje, and lush valleys, providing a variety of hiking and wildlife viewing opportunities. From the vibrant markets of Lilongwe to the peaceful beaches of Cape Maclear, Malawi offers a soulful and welcoming escape into a landscape of quiet beauty and natural grace.",
    "placesToVisit": [
      {
        "name": "Lake Malawi National Park",
        "summary": "A UNESCO-listed park and a sanctuary for hundreds of species of cichlid fish."
      },
      {
        "name": "Mount Mulanje",
        "summary": "A spectacular granite massif offering some of the best hiking in Southern Africa."
      }
    ],
    "travelTips": [
      "The Malawian Kwacha (MWK) is the currency; cash is necessary for most transactions.",
      "English is the official language, making it very easy for many travelers.",
      "The best time to visit is during the dry season from May to October."
    ],
    "heroImage": {
      "src": "/images/countries/malawi/hero.jpg",
      "alt": "The crystal-clear waters of Lake Malawi"
    }
  },
  "malaysia": {
    "slug": "malaysia",
    "name": "Malaysia",
    "region": "Asia",
    "heroDescription": "Malaysia is a vibrant and diverse Southeast Asian nation, where the futuristic skyline of Kuala Lumpur meets the ancient, primary rainforests of Borneo and the tea-covered hills of the Cameron Highlands. Its culture is a rich tapestry of Malay, Chinese, and Indian influences, reflected in its world-class culinary scene and its colorful festivals. The coastline offers a tropical paradise of pristine beaches and coral reefs, from the glitzy resorts of Langkawi to the world-class diving of Sipadan. With its unique blend of modern progress and traditional heritage, Malaysia is a destination that captivates the senses and offers endless opportunities for discovery.",
    "placesToVisit": [
      {
        "name": "Kuala Lumpur",
        "summary": "A dynamic capital city known for its iconic Petronas Towers and food scene."
      },
      {
        "name": "George Town",
        "summary": "A historic city on Penang Island famous for its street art and colonial heritage."
      }
    ],
    "travelTips": [
      "The Malaysian Ringgit (MYR) is the currency; credit cards are widely accepted.",
      "Learning basic Malay phrases will greatly enhance your experience with locals.",
      "The best time to visit is during the dry season (March-May and September-November)."
    ],
    "heroImage": {
      "src": "/images/countries/malaysia/hero.jpg",
      "alt": "The iconic Petronas Twin Towers in Kuala Lumpur"
    }
  },
  "maldives": {
    "slug": "maldives",
    "name": "Maldives",
    "region": "Asia",
    "heroDescription": "The Maldives is the quintessential tropical paradise, an archipelago of over 1,000 coral islands scattered across the turquoise waters of the Indian Ocean like a string of pearls. Each island is a sanctuary of white-sand beaches, swaying palm trees, and world-class luxury resorts, many featuring iconic overwater villas. The underwater world is a premier destination for diving and snorkeling, with vibrant coral reefs and an abundance of marine life, including whale sharks and manta rays. Whether seeking high-end romance, family adventure, or a simple life on a remote atoll, the Maldives offers a dreamlike escape into a world of pure, tropical splendor.",
    "placesToVisit": [
      {
        "name": "Malé",
        "summary": "The compact and vibrant capital city, known for its markets and mosques."
      },
      {
        "name": "Ari Atoll",
        "summary": "A world-famous atoll for diving and snorkeling with whale sharks and mantas."
      }
    ],
    "travelTips": [
      "The Maldivian Rufiyaa (MVR) is the currency; USD is widely accepted in resorts.",
      "The best way to travel between islands is by speedboat or seaplane.",
      "The best time to visit is during the dry season from November to April."
    ],
    "heroImage": {
      "src": "/images/countries/maldives/hero.jpg",
      "alt": "A luxury overwater villa in the Maldives"
    }
  },
  "mali": {
    "slug": "mali",
    "name": "Mali",
    "region": "Africa",
    "heroDescription": "Mali is a land of profound history and extraordinary architecture, once the heart of the powerful Mali Empire and a center of Islamic learning in Timbuktu. The Great Mosque of Djenné, the world's largest mud-brick building, stands as a masterpiece of Sudano-Sahelian architecture, while the Dogon Country offers a surreal landscape of cliffside villages and ancient traditions. The Niger River serves as the nation's lifeblood, winding through a landscape of vast deserts and rolling savannas. Despite its challenges, Mali remains a hub of West African music and craftsmanship, offering a raw and authentic experience for those seeking to understand the heart of the Sahel.",
    "placesToVisit": [
      {
        "name": "Djenné",
        "summary": "Famous for its Great Mosque, the world's largest mud-brick building."
      },
      {
        "name": "Dogon Country",
        "summary": "A spectacular region of cliffside villages and ancient traditions."
      }
    ],
    "travelTips": [
      "French is the official language; basic phrases are essential for travel.",
      "The West African CFA Franc (XOF) is the currency; cash is king.",
      "Check the latest travel advisories due to security concerns in some regions."
    ],
    "heroImage": {
      "src": "/images/countries/mali/hero.jpg",
      "alt": "The Great Mosque of Djenné in Mali"
    }
  },
  "malta": {
    "slug": "malta",
    "name": "Malta",
    "region": "Europe",
    "heroDescription": "Malta is a sun-drenched archipelago in the heart of the Mediterranean, where over 7,000 years of history are etched into its limestone cliffs and ancient walled cities. The capital, Valletta, is a UNESCO-listed masterpiece of Baroque architecture and fortifications, while the prehistoric temples of Ħaġar Qim and Mnajdra are among the oldest free-standing structures in the world. The islands' coastline offers crystal-clear waters and hidden coves, such as the Blue Lagoon on Comino, perfect for diving and sailing. With its warm hospitality and a culture that blends Mediterranean and British influences, Malta is a timeless and captivating destination.",
    "placesToVisit": [
      {
        "name": "Valletta",
        "summary": "The historic capital city, a UNESCO World Heritage site and a Baroque gem."
      },
      {
        "name": "Mdina",
        "summary": "The 'Silent City,' a perfectly preserved medieval walled town."
      }
    ],
    "travelTips": [
      "The Euro (EUR) is the currency; credit cards are widely accepted.",
      "The bus network is excellent and the best way to explore the islands.",
      "Driving is on the left side of the road, a legacy of British rule."
    ],
    "heroImage": {
      "src": "/images/countries/malta/hero.jpg",
      "alt": "The historic skyline of Valletta in Malta"
    }
  },
  "marshall-islands": {
    "slug": "marshallislands",
    "name": "Marshall Islands",
    "region": "Oceania",
    "heroDescription": "The Marshall Islands is a remote and beautiful archipelago of 29 coral atolls and five islands scattered across the vast expanse of the central Pacific Ocean. It is a land of pristine turquoise lagoons, swaying palm trees, and a traditional seafaring culture that remains deeply connected to the rhythms of the ocean. The islands are famous for their world-class diving, with sunken WWII wrecks and vibrant coral reefs teeming with marine life. Despite the challenges of rising sea levels and its small size, the people of the Marshall Islands maintain a resilient and welcoming spirit, offering a rare and authentic experience of island life at the very edge of the world.",
    "placesToVisit": [
      {
        "name": "Majuro",
        "summary": "The capital atoll, known for its vibrant culture and lagoon views."
      },
      {
        "name": "Bikini Atoll",
        "summary": "A world-famous destination for wreck diving and a historic site."
      }
    ],
    "travelTips": [
      "The US Dollar (USD) is the official currency; cash is necessary.",
      "The best way to travel between atolls is by small plane or boat.",
      "The best time to visit is during the dry season from December to April."
    ],
    "heroImage": {
      "src": "/images/countries/marshallislands/hero.jpg",
      "alt": "A pristine turquoise lagoon in the Marshall Islands"
    }
  },
  "mauritania": {
    "slug": "mauritania",
    "name": "Mauritania",
    "region": "Africa",
    "heroDescription": "Mauritania is a land of vast desert majesty and ancient Silk Road history, where the Sahara Desert meets the Atlantic coast in a landscape of dramatic dunes and hidden oases. The ancient ksar of Chinguetti, a center of Islamic learning, stands as a UNESCO-listed treasure of desert architecture, while the Banc d'Arguin National Park is a sanctuary for millions of migratory birds. The country's interior is a wild frontier of nomadic cultures and the world's longest iron ore train, offering a unique and challenging adventure. With its deep-rooted traditions and its raw, untamed beauty, Mauritania is a destination for the truly adventurous and culturally curious.",
    "placesToVisit": [
      {
        "name": "Chinguetti",
        "summary": "A historic desert city and a UNESCO World Heritage site."
      },
      {
        "name": "Banc d'Arguin",
        "summary": "A stunning coastal national park and a haven for migratory birds."
      }
    ],
    "travelTips": [
      "Arabic and French are the official languages; basic phrases are essential.",
      "The Ouguiya (MRU) is the currency; cash is king.",
      "Travel in Mauritania is challenging and requires careful planning and local guides."
    ],
    "heroImage": {
      "src": "/images/countries/mauritania/hero.jpg",
      "alt": "The ancient desert city of Chinguetti"
    }
  },
  "mauritius": {
    "slug": "mauritius",
    "name": "Mauritius",
    "region": "Africa",
    "heroDescription": "Mauritius is a sophisticated and diverse island nation in the Indian Ocean, known for its stunning white-sand beaches, turquoise lagoons, and a rich multicultural heritage. Beyond its luxury resorts, the island offers a landscape of dramatic volcanic peaks, lush rainforests, and unique natural wonders like the Seven Coloured Earths of Chamarel. Its culture is a vibrant blend of Indian, African, French, and Chinese influences, reflected in its world-class culinary scene and its colorful festivals. Whether seeking high-end romance, family adventure, or a simple life on a remote beach, Mauritius offers a sanctuary of peace and tropical splendor with a soulful, island heart.",
    "placesToVisit": [
      {
        "name": "Chamarel",
        "summary": "Famous for its unique Seven Coloured Earths and thundering waterfall."
      },
      {
        "name": "Le Morne Brabant",
        "summary": "A stunning mountain and a UNESCO World Heritage site with a rich history."
      }
    ],
    "travelTips": [
      "The Mauritian Rupee (MUR) is the currency; credit cards are widely accepted.",
      "English and French are the official languages; English is widely spoken.",
      "The best time to visit is during the dry season from May to December."
    ],
    "heroImage": {
      "src": "/images/countries/mauritius/hero.jpg",
      "alt": "The stunning Seven Coloured Earths of Chamarel"
    }
  },
  "mexico": {
    "slug": "mexico",
    "name": "Mexico",
    "region": "Americas",
    "heroDescription": "Mexico is a land of vibrant colors, infectious energy, and a profound history that stretches from the ancient Maya and Aztec civilizations to its colonial heritage and modern dynamism. From the iconic pyramids of Teotihuacán and Chichén Itzá to the sun-drenched beaches of the Riviera Maya and the rugged beauty of the Baja Peninsula, the country offers an endless array of experiences. Its culture is celebrated through its world-renowned culinary heritage, its colorful festivals, and its passionate music and art. Mexico is a destination that captivates the senses and enriches the soul, offering a journey of profound discovery and joy.",
    "placesToVisit": [
      {
        "name": "Mexico City",
        "summary": "A vibrant capital city known for its history, food, and culture."
      },
      {
        "name": "Chichén Itzá",
        "summary": "One of the most spectacular Maya archaeological sites and a New Seven Wonder."
      }
    ],
    "travelTips": [
      "The Mexican Peso (MXN) is the currency; credit cards are widely accepted.",
      "Learning basic Spanish phrases will greatly enhance your experience with locals.",
      "The best time to visit is during the dry season from November to April."
    ],
    "heroImage": {
      "src": "/images/countries/mexico/hero.jpg",
      "alt": "The ancient Maya pyramids of Chichén Itzá"
    }
  },
  "micronesia-federated-states-of": {
    "slug": "micronesia",
    "name": "Micronesia (Federated States of)",
    "region": "Oceania",
    "heroDescription": "The Federated States of Micronesia is a remote and beautiful archipelago of 607 islands scattered across the vast expanse of the western Pacific Ocean. Each of its four states—Yap, Chuuk, Pohnpei, and Kosrae—offers a different world, from the ancient stone money of Yap to the world-class wreck diving of Chuuk Lagoon. The islands are a sanctuary of pristine turquoise lagoons, lush rainforests, and a traditional seafaring culture that remains deeply connected to the rhythms of the ocean. With its warm hospitality and its untouched natural beauty, Micronesia offers a rare and authentic experience of island life at the very edge of the world.",
    "placesToVisit": [
      {
        "name": "Chuuk Lagoon",
        "summary": "A world-famous destination for wreck diving and a historic site."
      },
      {
        "name": "Nan Madol",
        "summary": "An ancient stone city and a UNESCO World Heritage site on Pohnpei."
      }
    ],
    "travelTips": [
      "The US Dollar (USD) is the official currency; cash is necessary.",
      "The best way to travel between islands is by small plane or boat.",
      "The best time to visit is during the dry season from December to April."
    ],
    "heroImage": {
      "src": "/images/countries/micronesia/hero.jpg",
      "alt": "A pristine turquoise lagoon in Micronesia"
    }
  },
  "republic-of-moldova": {
    "slug": "moldova",
    "name": "Republic of Moldova",
    "region": "Europe",
    "heroDescription": "Moldova is a land of captivating history, vibrant culture, and a spirit of innovation that has influenced the world. From the romantic streets of Chișinău and the historic spires of Orheiul Vechi and Soroca to the rugged beauty of the Codru forests and the dramatic coastline of the Dniester River, the country offers an endless array of experiences. Its history is etched into grand palaces, intricate cathedrals, and the ruins of ancient empires, while its culture is celebrated through its world-renowned wine, music, and art. Moldova is a destination that captivates the senses and enriches the soul, offering a journey of profound discovery.",
    "placesToVisit": [
      {
        "name": "Chișinău",
        "summary": "A vibrant capital city famous for its history, architecture, and wine."
      },
      {
        "name": "Orheiul Vechi",
        "summary": "A historic site and a UNESCO World Heritage reminder of the ancient world."
      }
    ],
    "travelTips": [
      "The Moldovan Leu (MDL) is the currency; credit cards are widely accepted in cities.",
      "Learning basic Romanian or Russian phrases will greatly improve your interactions.",
      "The best time to visit is during the autumn for the wine harvest festivals."
    ],
    "heroImage": {
      "src": "/images/countries/moldova/hero.jpg",
      "alt": "The historic cave monastery of Orheiul Vechi"
    }
  },
  "monaco": {
    "slug": "monaco",
    "name": "Monaco",
    "region": "Europe",
    "heroDescription": "Monaco is a glitzy and glamorous principality on the French Riviera, a tiny sovereign state known for its high-end luxury, its world-famous casino, and its iconic Formula 1 Grand Prix. The capital, Monte Carlo, features an opulent palace, world-class shopping, and a harbor filled with some of the world's most impressive yachts. Despite its small size, Monaco is a global hub of finance and culture, providing a grand and orderly escape where high-end lifestyle and Mediterranean beauty coexist in a landscape of quiet elegance. It is a place where the world's elite gather to see and be seen, all set within a landscape of timeless, coastal charm.",
    "placesToVisit": [
      {
        "name": "Monte Carlo",
        "summary": "The glitzy heart of the principality, famous for its casino and luxury."
      },
      {
        "name": "Prince's Palace",
        "summary": "The official residence of the Prince of Monaco and a historic site."
      }
    ],
    "travelTips": [
      "The Euro (EUR) is the currency; credit cards are widely accepted.",
      "French is the official language; English is widely spoken.",
      "The best way to explore the principality is by walking or using the public buses."
    ],
    "heroImage": {
      "src": "/images/countries/monaco/hero.jpg",
      "alt": "The glitzy harbor of Monte Carlo in Monaco"
    }
  },
  "mongolia": {
    "slug": "mongolia",
    "name": "Mongolia",
    "region": "Asia",
    "heroDescription": "Mongolia is a land of vast, wind-swept steppes and nomadic traditions, where the 'Eternal Blue Sky' overlooks a landscape of dramatic mountains, ancient deserts, and rolling grasslands. It is a paradise for those seeking a true wilderness adventure, with traditional yurts still used by nomadic herders who follow the rhythms of the seasons. The Gobi Desert offers a surreal landscape of shifting sands and dinosaur fossils, while the Altai Mountains provide a sanctuary for the unique golden eagle hunters. With its rich history of the Mongol Empire and a culture that values hospitality and freedom, Mongolia provides a raw and authentic journey through the heart of Central Asia.",
    "placesToVisit": [
      {
        "name": "Ulaanbaatar",
        "summary": "The vibrant capital city known for its history, culture, and food."
      },
      {
        "name": "Gobi Desert",
        "summary": "A spectacular desert landscape of red sands and rock formations."
      }
    ],
    "travelTips": [
      "The Tögrög (MNT) is the currency; cash is necessary outside major cities.",
      "Learning basic Mongolian phrases will greatly enhance your experience with locals.",
      "The best time to visit is during the summer for the best weather."
    ],
    "heroImage": {
      "src": "/images/countries/mongolia/hero.jpg",
      "alt": "A traditional Mongolian yurt on the vast steppes"
    }
  },
  "montenegro": {
    "slug": "montenegro",
    "name": "Montenegro",
    "region": "Europe",
    "heroDescription": "Montenegro is a Mediterranean masterpiece where dramatic limestone peaks meet the turquoise waters of the Adriatic Sea in a landscape of unparalleled beauty. The historic walled city of Kotor, a UNESCO-listed treasure of medieval architecture, sits at the foot of a spectacular fjord-like bay, while the glitzy shores of Budva offer a vibrant coastal lifestyle. Inland, the rugged mountains of Durmitor and Biogradska Gora provide a sanctuary for hikers and nature lovers, with deep canyons and glacial lakes. With its unique blend of Venetian history and Slavic soul, Montenegro is a premier destination for sailing, history, and the art of 'fjaka'—the sweetness of doing nothing.",
    "placesToVisit": [
      {
        "name": "Kotor",
        "summary": "A stunning medieval walled city and a UNESCO World Heritage site."
      },
      {
        "name": "Durmitor National Park",
        "summary": "A spectacular mountain park known for its hiking and glacial lakes."
      }
    ],
    "travelTips": [
      "The Euro (EUR) is the currency; credit cards are widely accepted.",
      "Learning basic Montenegrin phrases will greatly improve your interactions.",
      "The best time to visit is the shoulder season (May-June or September-October)."
    ],
    "heroImage": {
      "src": "/images/countries/montenegro/hero.jpg",
      "alt": "The historic walled city of Kotor in Montenegro"
    }
  },
  "morocco": {
    "slug": "morocco",
    "name": "Morocco",
    "region": "Africa",
    "heroDescription": "Morocco is a sensory journey through ancient medinas, vast deserts, and the soaring peaks of the Atlas Mountains, where Berber traditions and Arab influences blend into a unique and vibrant culture. The imperial cities of Marrakech, Fes, and Meknes offer a maze of colorful souks, intricate palaces, and historic mosques, while the blue-washed streets of Chefchaouen provide a peaceful mountain escape. The Sahara Desert offers a surreal landscape of shifting sands and nomadic camps, best explored by a traditional camel trek. With its world-renowned culinary heritage and its warm hospitality, Morocco is a destination that captivates the senses and the soul.",
    "placesToVisit": [
      {
        "name": "Marrakech",
        "summary": "A vibrant imperial city known for its medina, souks, and palaces."
      },
      {
        "name": "Fes",
        "summary": "The cultural heart of Morocco, home to the world's oldest university."
      }
    ],
    "travelTips": [
      "The Moroccan Dirham (MAD) is the currency; cash is necessary in souks.",
      "Learning basic Arabic or French phrases will greatly enhance your experience.",
      "The best time to visit is during the spring or autumn for the best weather."
    ],
    "heroImage": {
      "src": "/images/countries/morocco/hero.jpg",
      "alt": "The vibrant colors of a Moroccan souk"
    }
  },
  "mozambique": {
    "slug": "mozambique",
    "name": "Mozambique",
    "region": "Africa",
    "heroDescription": "Mozambique is a land of striking contrasts and immense natural beauty, where the turquoise waters of the Indian Ocean meet the dramatic, palm-fringed coastline and the vast interior gives way to lush savannas and ancient forests. The Bazaruto and Quirimbas Archipelagos offer a tropical paradise of pristine beaches and world-class diving, while the historic Island of Mozambique tells a story of Portuguese colonial heritage and maritime trade. From the vibrant energy of Maputo to the wildlife-rich Gorongosa National Park, Mozambique is a frontier of discovery for the truly adventurous and those seeking a soulful and authentic African experience.",
    "placesToVisit": [
      {
        "name": "Bazaruto Archipelago",
        "summary": "A stunning island chain and a sanctuary for unique marine life."
      },
      {
        "name": "Island of Mozambique",
        "summary": "A historic island and a UNESCO World Heritage site with a rich history."
      }
    ],
    "travelTips": [
      "Portuguese is the official language; basic phrases are essential for travel.",
      "The Metical (MZN) is the currency; cash is necessary outside major cities.",
      "The best time to visit is during the dry season from May to October."
    ],
    "heroImage": {
      "src": "/images/countries/mozambique/hero.jpg",
      "alt": "The pristine turquoise waters of the Bazaruto Archipelago"
    }
  },
  "myanmar": {
    "slug": "myanmar",
    "name": "Myanmar",
    "region": "Asia",
    "heroDescription": "Myanmar is a land of golden pagodas and ancient wonders, where the thousands of temples of Bagan rise above the plains of the Irrawaddy River in a landscape of mystical beauty. The spiritual heart of the nation is the Shwedagon Pagoda in Yangon, a shimmering monument of gold and jewels, while the floating gardens of Inle Lake offer a unique and traditional way of life. The country's landscape is a mix of rugged mountains, fertile valleys, and a sun-drenched coastline along the Andaman Sea. Despite its complex political history, Myanmar remains a place of profound spiritual depth and gentle hospitality, offering a journey of discovery and grace.",
    "placesToVisit": [
      {
        "name": "Bagan",
        "summary": "A spectacular archaeological site home to thousands of ancient temples."
      },
      {
        "name": "Inle Lake",
        "summary": "A beautiful lake known for its floating gardens and traditional villages."
      }
    ],
    "travelTips": [
      "The Kyat (MMK) is the currency; cash is necessary for most transactions.",
      "Learning basic Burmese phrases will greatly enhance your experience with locals.",
      "The best time to visit is during the dry season from November to February."
    ],
    "heroImage": {
      "src": "/images/countries/myanmar/hero.jpg",
      "alt": "The ancient temples of Bagan at sunrise"
    }
  },
  "namibia": {
    "slug": "namibia",
    "name": "Namibia",
    "region": "Africa",
    "heroDescription": "Namibia is a land of stark, breathtaking beauty, where the towering red dunes of the Namib Desert meet the wild, wind-swept Atlantic coast in a landscape of dramatic contrasts. The Etosha National Park offers some of Africa's best wildlife viewing, with elephants and rhinos gathering around its vast salt pan, while the Skeleton Coast provides a hauntingly beautiful scene of shipwrecks and seal colonies. The country's interior features rugged mountains, ancient rock art, and the surreal landscape of the Fish River Canyon. With its unique German colonial heritage and its commitment to environmental preservation, Namibia offers a raw and invigorating escape into the wild heart of Southern Africa.",
    "placesToVisit": [
      {
        "name": "Sossusvlei",
        "summary": "Famous for its towering red dunes and the surreal Deadvlei salt pan."
      },
      {
        "name": "Etosha National Park",
        "summary": "A world-class destination for wildlife viewing and a sanctuary for rhinos."
      }
    ],
    "travelTips": [
      "The Namibian Dollar (NAD) is the currency, pegged 1:1 with the South African Rand.",
      "Renting a 4x4 is highly recommended for exploring the more remote regions.",
      "The best time to visit is during the dry season from May to October."
    ],
    "heroImage": {
      "src": "/images/countries/namibia/hero.jpg",
      "alt": "The towering red dunes of Sossusvlei in Namibia"
    }
  },
  "nauru": {
    "slug": "nauru",
    "name": "Nauru",
    "region": "Oceania",
    "heroDescription": "Nauru is the world's smallest island nation, a tiny coral atoll in the central Pacific Ocean defined by its unique history of phosphate mining and its resilient, welcoming spirit. The island is surrounded by a vibrant coral reef, offering opportunities for diving and fishing, while the interior features a surreal landscape of limestone pinnacles left by mining. Despite its small size and the challenges of its recent history, Nauru offers a rare and authentic glimpse into island life, where the traditional culture and the warmth of its people remain central to the nation's identity. It is a place of quiet beauty and a unique, off-the-beaten-path experience.",
    "placesToVisit": [
      {
        "name": "Anibare Bay",
        "summary": "The most beautiful beach on the island, known for its white sand and surf."
      },
      {
        "name": "Command Ridge",
        "summary": "The highest point on the island, offering views and WWII history."
      }
    ],
    "travelTips": [
      "The Australian Dollar (AUD) is the official currency; cash is necessary.",
      "The best way to explore the island is by walking or using a local taxi.",
      "The best time to visit is during the dry season from May to October."
    ],
    "heroImage": {
      "src": "/images/countries/nauru/hero.jpg",
      "alt": "The pristine coastline of Nauru"
    }
  },
  "nepal": {
    "slug": "nepal",
    "name": "Nepal",
    "region": "Asia",
    "heroDescription": "Nepal is a land of soaring Himalayan peaks and deep spiritual heritage, home to eight of the world's ten highest mountains, including the iconic Mount Everest. It is a paradise for hikers and mountaineers, with the Annapurna and Everest regions offering some of the most spectacular trekking routes on Earth. The Kathmandu Valley is a living museum of ancient temples, intricate palaces, and vibrant markets, reflecting a rich tapestry of Hindu and Buddhist traditions. From the wildlife-rich jungles of Chitwan to the peaceful birthplace of the Buddha in Lumbini, Nepal offers a soulful and invigorating journey through the very roof of the world.",
    "placesToVisit": [
      {
        "name": "Kathmandu",
        "summary": "The vibrant capital city known for its history, temples, and markets."
      },
      {
        "name": "Everest Base Camp",
        "summary": "The ultimate destination for hikers and mountaineers in the Himalayas."
      }
    ],
    "travelTips": [
      "The Nepalese Rupee (NPR) is the currency; cash is necessary outside major cities.",
      "Learning basic Nepali phrases will greatly enhance your experience with locals.",
      "The best time to visit is during the spring or autumn for the best weather."
    ],
    "heroImage": {
      "src": "/images/countries/nepal/hero.jpg",
      "alt": "The soaring peaks of the Himalayas in Nepal"
    }
  },
  "netherlands": {
    "slug": "netherlands",
    "name": "Netherlands",
    "region": "Europe",
    "heroDescription": "The Netherlands is a land of coastal beauty, innovative design, and a unique philosophy of tolerance and progress, where historic windmills and tulip fields meet modern, sustainable cities. Amsterdam, the vibrant capital, is a city of canals, world-class museums, and a cycling culture that is second to none. The country's landscape is defined by its flat, fertile plains, sandy beaches, and the dramatic dikes and dams that protect it from the sea. From the historic streets of Utrecht and Delft to the modern architecture of Rotterdam, the Netherlands offers a serene and orderly charm. It is a place where tradition and innovation coexist harmoniously.",
    "placesToVisit": [
      {
        "name": "Amsterdam",
        "summary": "A cool and compact capital city known for its canals, food, and cycling."
      },
      {
        "name": "Keukenhof",
        "summary": "The world's largest flower garden, famous for its tulips and spring displays."
      }
    ],
    "travelTips": [
      "The Euro (EUR) is the currency; credit cards are widely accepted.",
      "Renting a bike is the best way to explore Amsterdam like a local.",
      "The best time to visit for tulips is from mid-April to early May."
    ],
    "heroImage": {
      "src": "/images/countries/netherlands/hero.jpg",
      "alt": "The colorful tulip fields of the Netherlands"
    }
  },
  "new-zealand": {
    "slug": "newzealand",
    "name": "New Zealand",
    "region": "Oceania",
    "heroDescription": "New Zealand is a land of staggering natural beauty and adventure, where the dramatic peaks of the Southern Alps meet the turquoise fjords of Milford Sound and the geothermal wonders of Rotorua. Its landscape is a kaleidoscope of diverse environments, from the pristine white-sand beaches of the Bay of Islands to the rugged, wind-swept plains of the Otago region. The country's culture is a rich blend of Māori heritage and modern Pacific influences, reflected in its world-class culinary scene and its passionate love for the outdoors. Whether seeking high-end luxury, adrenaline-fueled adventure, or a simple life in a remote valley, New Zealand offers a sanctuary of peace.",
    "placesToVisit": [
      {
        "name": "Milford Sound",
        "summary": "A stunning turquoise fjord and a UNESCO World Heritage site."
      },
      {
        "name": "Queenstown",
        "summary": "The 'Adventure Capital of the World,' known for its skiing and bungee jumping."
      }
    ],
    "travelTips": [
      "The New Zealand Dollar (NZD) is the currency; credit cards are used for everything.",
      "Learning basic Māori phrases will greatly enhance your experience with locals.",
      "The best time to visit is during the summer for the best weather."
    ],
    "heroImage": {
      "src": "/images/countries/newzealand/hero.jpg",
      "alt": "The stunning turquoise waters of Milford Sound"
    }
  },
  "nicaragua": {
    "slug": "nicaragua",
    "name": "Nicaragua",
    "region": "Americas",
    "heroDescription": "Nicaragua, the 'Land of Lakes and Volcanoes,' is a land of dramatic landscapes, colonial charm, and a resilient, welcoming spirit. Its Pacific coastline offers world-class surf and laid-back beach towns like San Juan del Sur, while the Caribbean coast provides a tropical escape of turquoise waters and Creole culture. The colonial cities of Granada and León captivate with their cobblestone streets and baroque architecture, set against a backdrop of dramatic volcanoes. From the twin peaks of Ometepe Island in Lake Nicaragua to the misty cloud forests of the north, Nicaragua offers a rich and diverse experience of Central American history, nature, and adventure.",
    "placesToVisit": [
      {
        "name": "Granada",
        "summary": "A beautiful colonial city on the shores of Lake Nicaragua."
      },
      {
        "name": "Ometepe Island",
        "summary": "A unique island formed by two volcanoes in the middle of Lake Nicaragua."
      }
    ],
    "travelTips": [
      "The Córdoba (NIO) is the currency; USD is widely accepted in tourist areas.",
      "Learning basic Spanish phrases will greatly enhance your experience with locals.",
      "The best time to visit is during the dry season from November to April."
    ],
    "heroImage": {
      "src": "/images/countries/nicaragua/hero.jpg",
      "alt": "The colorful colonial streets of Granada in Nicaragua"
    }
  },
  "niger": {
    "slug": "niger",
    "name": "Niger",
    "region": "Africa",
    "heroDescription": "Niger is a land of vast desert majesty and ancient nomadic traditions, where the Sahara Desert meets the Sahelian plains in a landscape of dramatic rock formations and hidden oases. The Aïr Mountains and the Ténéré Desert offer a surreal landscape of shifting sands and ancient rock art, best explored by a traditional Tuareg guide. The Niger River serves as the nation's lifeblood, winding through a landscape of rolling savannas and vibrant markets in the capital, Niamey. Despite its challenges, Niger remains a hub of West African music and craftsmanship, offering a raw and authentic experience for those seeking to understand the heart of the Sahel.",
    "placesToVisit": [
      {
        "name": "Agadez",
        "summary": "A historic desert city and a UNESCO World Heritage site."
      },
      {
        "name": "W National Park",
        "summary": "A stunning trans-border national park and a haven for wildlife."
      }
    ],
    "travelTips": [
      "French and Arabic are the official languages; basic phrases are essential.",
      "The West African CFA Franc (XOF) is the currency; cash is king.",
      "Check the latest travel advisories due to security concerns in some regions."
    ],
    "heroImage": {
      "src": "/images/countries/niger/hero.jpg",
      "alt": "The ancient desert city of Agadez in Niger"
    }
  },
  "nigeria": {
    "slug": "nigeria",
    "name": "Nigeria",
    "region": "Africa",
    "heroDescription": "Nigeria is a continental giant of irrepressible energy and immense cultural diversity, where the futuristic skyline of Lagos meets the ancient kingdoms of the north and the lush rainforests of the south. Its culture is a rich tapestry of over 250 ethnic groups, reflected in its world-class music, film, and culinary scenes. The country's landscape is a mix of high-altitude plateaus, fertile valleys, and a sun-drenched coastline along the Gulf of Guinea. From the vibrant arts scene of Oshogbo to the wildlife-rich Yankari National Park and the historic city of Kano, Nigeria is a destination of immense scale and depth, where the past and future collide in spectacular fashion.",
    "placesToVisit": [
      {
        "name": "Lagos",
        "summary": "A dynamic coastal metropolis known for its energy, music, and nightlife."
      },
      {
        "name": "Zuma Rock",
        "summary": "A massive and spectacular monolith located near the capital, Abuja."
      }
    ],
    "travelTips": [
      "English is the official language, making it very easy for many travelers.",
      "The Naira (NGN) is the currency; cash is necessary for most transactions.",
      "The best time to visit is during the dry season from November to March."
    ],
    "heroImage": {
      "src": "/images/countries/nigeria/hero.jpg",
      "alt": "The futuristic skyline of Lagos in Nigeria"
    }
  },
  "democratic-peoples-republic-of-korea": {
    "slug": "northkorea",
    "name": "Democratic People's Republic of Korea",
    "region": "Asia",
    "heroDescription": "North Korea is one of the world's most secluded and enigmatic nations, a land of grand monuments, pristine mountain scenery, and a unique political system that has remained largely unchanged for decades. The capital, Pyongyang, features a landscape of monumental architecture, wide boulevards, and the iconic Ryugyong Hotel. Beyond the city, the country offers a landscape of rugged mountains, such as the sacred Mount Paektu, and a traditional culture that is preserved with pride. Despite its isolation, North Korea remains a place of profound curiosity and deep-rooted heritage, offering a rare and highly controlled glimpse into a world that feels frozen in time.",
    "placesToVisit": [
      {
        "name": "Pyongyang",
        "summary": "The capital city known for its monumental architecture and grand squares."
      },
      {
        "name": "Mount Paektu",
        "summary": "A sacred mountain and an active volcano on the border with China."
      }
    ],
    "travelTips": [
      "Travel to North Korea is only possible through authorized tour operators.",
      "The North Korean Won (KPW) is the currency, but tourists use EUR, USD, or CNY.",
      "Respect local customs and follow the instructions of your guides at all times."
    ],
    "heroImage": {
      "src": "/images/countries/northkorea/hero.jpg",
      "alt": "The monumental skyline of Pyongyang"
    }
  },
  "north-macedonia": {
    "slug": "northmacedonia",
    "name": "North Macedonia",
    "region": "Europe",
    "heroDescription": "North Macedonia is a land of ancient history and diverse landscapes, where the sun-drenched shores of Lake Ohrid meet the rugged, snow-capped peaks of the Šar and Pelister mountains. The country's history is visible in the Roman ruins of Heraclea, the medieval majesty of the Ohrid monasteries, and the Ottoman-era Old Bazaar in Skopje. The capital, Skopje, is a vibrant mix of onion-domed churches, Soviet-era monuments, and a bold new architectural vision. From the fragrant vineyards of the Tikveš region to the world-class ski resorts of Mavrovo, North Macedonia offers a rich tapestry of culture, nature, and affordability in the heart of the Balkans.",
    "placesToVisit": [
      {
        "name": "Ohrid",
        "summary": "A stunning lakeside city and a UNESCO World Heritage site."
      },
      {
        "name": "Skopje",
        "summary": "A vibrant capital city known for its history, architecture, and food."
      }
    ],
    "travelTips": [
      "The Denar (MKD) is the currency; credit cards are widely accepted in cities.",
      "Learning basic Macedonian phrases will greatly improve your interactions.",
      "The best time to visit is during the summer for the best weather."
    ],
    "heroImage": {
      "src": "/images/countries/northmacedonia/hero.jpg",
      "alt": "The stunning lakeside city of Ohrid in North Macedonia"
    }
  },
  "norway": {
    "slug": "norway",
    "name": "Norway",
    "region": "Europe",
    "heroDescription": "Norway is a land of staggering natural beauty and northern grace, where the dramatic peaks of the fjords meet the turquoise waters of the Atlantic and the magical glow of the Northern Lights. Its coastline is a labyrinth of deep inlets, towering cliffs, and pristine islands, best explored by a traditional coastal steamer or a scenic train journey. The country's interior offers a landscape of vast forests, high-altitude plateaus, and the snow-capped peaks of the Jotunheimen mountains. From the vibrant culture of Oslo and Bergen to the remote beauty of the Lofoten Islands, Norway is a sanctuary of peace and natural splendor.",
    "placesToVisit": [
      {
        "name": "Oslo",
        "summary": "A cool and compact capital city known for its design, food, and museums."
      },
      {
        "name": "Geirangerfjord",
        "summary": "A stunning turquoise fjord and a UNESCO World Heritage site."
      }
    ],
    "travelTips": [
      "The Norwegian Krone (NOK) is the currency; credit cards are used for everything.",
      "Learning basic Norwegian phrases will greatly improve your interactions.",
      "The best time for Northern Lights is from September to March in the north."
    ],
    "heroImage": {
      "src": "/images/countries/norway/hero.jpg",
      "alt": "The stunning turquoise waters of a Norwegian fjord"
    }
  },
  "oman": {
    "slug": "oman",
    "name": "Oman",
    "region": "Asia",
    "heroDescription": "Oman is a land of timeless wonders and desert majesty, where the turquoise waters of the Arabian Sea meet the dramatic, wind-sculpted sands of the Wahiba Sands and the soaring peaks of the Al Hajar mountains. The capital, Muscat, features an opulent palace, world-class museums, and a bustling souq that reflects a rich cultural depth. The country's interior is a landscape of hidden wadis, ancient mud-brick villages, and the surreal landscape of the Jebel Akhdar. With its warm hospitality and its commitment to preserving its unique Arab culture, Oman offers a peaceful sanctuary and a sophisticated gateway to the Arabian Peninsula.",
    "placesToVisit": [
      {
        "name": "Muscat",
        "summary": "A beautiful coastal capital city known for its history, architecture, and food."
      },
      {
        "name": "Wahiba Sands",
        "summary": "A spectacular desert landscape of red sands and rock formations."
      }
    ],
    "travelTips": [
      "The Omani Rial (OMR) is the currency; credit cards are widely accepted in cities.",
      "Learning basic Arabic phrases will greatly enhance your experience with locals.",
      "The best time to visit is during the cooler months from November to March."
    ],
    "heroImage": {
      "src": "/images/countries/oman/hero.jpg",
      "alt": "The stunning Al Hajar mountains in Oman"
    }
  },
  "pakistan": {
    "slug": "pakistan",
    "name": "Pakistan",
    "region": "Asia",
    "heroDescription": "Pakistan is a land of profound history and extraordinary landscapes, home to some of the world's highest mountains, including the iconic K2 and Nanga Parbat. It is a paradise for hikers and mountaineers, with the Karakoram Highway offering one of the most spectacular and challenging road journeys on Earth. The country's history is etched into ancient ruins like Mohenjo-Daro and the Mughal majesty of Lahore, while its culture is a rich tapestry of music, art, and hospitality. From the high-altitude plateaus of Gilgit-Baltistan to the sun-drenched beaches of the Arabian Sea, Pakistan offers a raw and authentic adventure through the heart of South Asia.",
    "placesToVisit": [
      {
        "name": "Lahore",
        "summary": "The cultural heart of Pakistan, famous for its Mughal architecture and food."
      },
      {
        "name": "Hunza Valley",
        "summary": "A spectacular mountain valley known for its beauty and longevity."
      }
    ],
    "travelTips": [
      "The Pakistani Rupee (PKR) is the currency; cash is necessary for most transactions.",
      "Learning basic Urdu phrases will greatly enhance your experience with locals.",
      "Check the latest security updates and travel with experienced local operators."
    ],
    "heroImage": {
      "src": "/images/countries/pakistan/hero.jpg",
      "alt": "The soaring peaks of the Karakoram range in Pakistan"
    }
  },
  "palau": {
    "slug": "palau",
    "name": "Palau",
    "region": "Oceania",
    "heroDescription": "Palau is a remote and beautiful archipelago of over 500 islands scattered across the vast expanse of the western Pacific Ocean. It is a land of pristine turquoise lagoons, lush rainforests, and a traditional seafaring culture that remains deeply connected to the rhythms of the ocean. The islands are famous for their world-class diving and snorkeling, with the Rock Islands offering a surreal landscape of limestone formations and hidden lakes. Despite its small size, Palau is a global leader in marine conservation, providing a rare and authentic experience of island life at the very edge of the world, where the traditional culture remains central to the nation's identity.",
    "placesToVisit": [
      {
        "name": "Rock Islands",
        "summary": "A stunning turquoise lagoon and a UNESCO World Heritage site."
      },
      {
        "name": "Jellyfish Lake",
        "summary": "A unique lake where you can swim with millions of harmless jellyfish."
      }
    ],
    "travelTips": [
      "The US Dollar (USD) is the official currency; cash is necessary.",
      "The best way to travel between islands is by small plane or boat.",
      "The best time to visit is during the dry season from December to April."
    ],
    "heroImage": {
      "src": "/images/countries/palau/hero.jpg",
      "alt": "The stunning Rock Islands of Palau"
    }
  },
  "palestine": {
    "slug": "palestine",
    "name": "Palestine",
    "region": "Asia",
    "heroDescription": "Palestine is a land of profound history and extraordinary spiritual depth, home to some of the world's most important religious sites and a resilient, welcoming spirit. The ancient city of Bethlehem, the birthplace of Jesus, and the historic streets of Hebron and Jericho stand as powerful symbols of human ambition and faith. The country's landscape is a mix of high-altitude plateaus, fertile valleys, and the sun-drenched hills of the West Bank. Despite its complex political situation, Palestine remains a place of deep cultural depth and warm hospitality, offering a profound and moving experience for those seeking to understand the roots of faith and human resilience.",
    "placesToVisit": [
      {
        "name": "Bethlehem",
        "summary": "The historic birthplace of Jesus and a major center of pilgrimage."
      },
      {
        "name": "Jericho",
        "summary": "One of the world's oldest continuously inhabited cities, located in the Jordan Valley."
      }
    ],
    "travelTips": [
      "The Israeli Shekel (ILS) is the most widely used currency in the West Bank.",
      "Learning basic Arabic phrases will greatly enhance your experience with locals.",
      "Check the latest security updates and travel with experienced local operators."
    ],
    "heroImage": {
      "src": "/images/countries/palestine/hero.jpg",
      "alt": "The historic streets of Bethlehem"
    }
  },
  "panama": {
    "slug": "panama",
    "name": "Panama",
    "region": "Americas",
    "heroDescription": "Panama is a land of striking contrasts and immense natural beauty, where the futuristic skyline of Panama City meets the ancient, traditional cultures of the indigenous peoples and the lush rainforests of the interior. The Panama Canal, one of the world's most impressive engineering feats, stands as a powerful symbol of human ambition, while the San Blas Islands offer a tropical paradise of pristine beaches and turquoise waters. The country's landscape is a kaleidoscope of diverse environments, from the high-altitude peaks of the Chiriquí Highlands to the thundering waterfalls of the Darién Gap. Panama is a destination of immense spirit and natural beauty.",
    "placesToVisit": [
      {
        "name": "Panama City",
        "summary": "A vibrant capital city known for its history, architecture, and the canal."
      },
      {
        "name": "San Blas Islands",
        "summary": "A stunning island chain and a sanctuary for unique indigenous culture."
      }
    ],
    "travelTips": [
      "Panama uses the US Dollar (USD) as its official currency.",
      "Learning basic Spanish phrases will greatly enhance your experience with locals.",
      "The best time to visit is during the dry season from December to April."
    ],
    "heroImage": {
      "src": "/images/countries/panama/hero.jpg",
      "alt": "The futuristic skyline of Panama City"
    }
  },
  "papua-new-guinea": {
    "slug": "papuanewguinea",
    "name": "Papua New Guinea",
    "region": "Oceania",
    "heroDescription": "Papua New Guinea is a wild and untamed frontier of biodiversity and culture, home to some of the world's most diverse ethnic groups and languages. Its landscape is a kaleidoscope of diverse environments, from the high-altitude peaks of the Highlands to the turquoise lagoons of the Bismarck Archipelago and the lush rainforests of the Sepik River. The country's culture is a rich tapestry of ancient traditions and modern Pacific influences, reflected in its world-class music, art, and festivals. With its warm hospitality and its raw, untamed beauty, Papua New Guinea offers a rare and authentic experience for the truly adventurous and culturally curious.",
    "placesToVisit": [
      {
        "name": "Mount Wilhelm",
        "summary": "The highest peak in the country, offering spectacular mountain views."
      },
      {
        "name": "Sepik River",
        "summary": "A spectacular river known for its traditional villages and art."
      }
    ],
    "travelTips": [
      "The Kina (PGK) is the currency; cash is necessary outside major cities.",
      "Learning basic Tok Pisin phrases will greatly enhance your experience with locals.",
      "Check the latest security updates and travel with experienced local operators."
    ],
    "heroImage": {
      "src": "/images/countries/papuanewguinea/hero.jpg",
      "alt": "The lush rainforests of Papua New Guinea"
    }
  },
  "paraguay": {
    "slug": "paraguay",
    "name": "Paraguay",
    "region": "Americas",
    "heroDescription": "Paraguay is a land of profound history and extraordinary landscapes, often called the 'Heart of South America' for its central location and its resilient, welcoming spirit. Its history is etched into the stone of the Jesuit Missions and the historic streets of Asunción, while its culture is a rich tapestry of Guaraní and Spanish influences. The country's landscape is a mix of high-altitude plateaus, fertile valleys, and the vast, wind-sculpted sands of the Chaco. Despite its challenges, Paraguay remains a place of deep cultural depth and gentle hospitality, offering a profound and moving experience for those seeking to understand the roots of faith and human resilience.",
    "placesToVisit": [
      {
        "name": "Asunción",
        "summary": "The vibrant capital city known for its history, architecture, and food."
      },
      {
        "name": "Jesuit Missions",
        "summary": "A historic site and a UNESCO World Heritage reminder of the Jesuit missions."
      }
    ],
    "travelTips": [
      "The Guaraní (PYG) is the currency; cash is necessary for most transactions.",
      "Learning basic Spanish or Guaraní phrases will greatly enhance your experience.",
      "The best time to visit is during the cooler months from May to September."
    ],
    "heroImage": {
      "src": "/images/countries/paraguay/hero.jpg",
      "alt": "The historic Jesuit Missions in Paraguay"
    }
  },
  "peru": {
    "slug": "peru",
    "name": "Peru",
    "region": "Americas",
    "heroDescription": "Peru is a land of mystical beauty and profound history, where the soaring peaks of the Andes meet the ancient ruins of the Inca Empire and the lush depths of the Amazon rainforest. The iconic ruins of Machu Picchu stand as a powerful symbol of human ambition and spiritual depth, while the colonial city of Cusco captivates with its cobblestone streets and vibrant indigenous culture. The country's landscape is a kaleidoscope of diverse environments, from the high-altitude waters of Lake Titicaca to the thundering waterfalls of the Sacred Valley. Peru is a destination that captivates the senses and the soul, offering a journey of profound discovery.",
    "placesToVisit": [
      {
        "name": "Machu Picchu",
        "summary": "One of the most spectacular Inca archaeological sites and a New Seven Wonder."
      },
      {
        "name": "Cusco",
        "summary": "The historic capital of the Inca Empire and a beautiful colonial city."
      }
    ],
    "travelTips": [
      "The Sol (PEN) is the currency; credit cards are widely accepted in cities.",
      "Learning basic Spanish phrases will greatly enhance your experience with locals.",
      "The best time to visit is during the dry season from May to October."
    ],
    "heroImage": {
      "src": "/images/countries/peru/hero.jpg",
      "alt": "The ancient Inca ruins of Machu Picchu"
    }
  },
  "philippines": {
    "slug": "philippines",
    "name": "Philippines",
    "region": "Asia",
    "heroDescription": "The Philippines is an archipelago of over 7,000 islands scattered across the turquoise waters of the western Pacific Ocean like a string of pearls. From the spiritual heart of the Rice Terraces of Banaue and the ancient temples of Vigan to the sun-drenched beaches of Boracay and the rugged beauty of Palawan, the country offers an endless array of experiences. Its culture is a rich tapestry of Malay, Spanish, and American influences, reflected in its world-class culinary scene and its passionate love for music and life. With its warm hospitality and its pristine natural beauty, the Philippines is a premier destination for adventure and serenity.",
    "placesToVisit": [
      {
        "name": "Palawan",
        "summary": "A stunning island famous for its turquoise lagoons and limestone cliffs."
      },
      {
        "name": "Boracay",
        "summary": "A world-famous beach destination known for its white sand and nightlife."
      }
    ],
    "travelTips": [
      "The Philippine Peso (PHP) is the currency; credit cards are widely accepted.",
      "Learning basic Tagalog phrases will greatly enhance your experience with locals.",
      "The best time to visit is during the dry season from November to April."
    ],
    "heroImage": {
      "src": "/images/countries/philippines/hero.jpg",
      "alt": "The stunning turquoise lagoons of Palawan"
    }
  },
  "poland": {
    "slug": "poland",
    "name": "Poland",
    "region": "Europe",
    "heroDescription": "Poland is a land of captivating history, vibrant culture, and a spirit of innovation that has influenced the world. From the romantic streets of Warsaw and the historic spires of Kraków and Gdańsk to the rugged beauty of the Tatra Mountains and the dramatic coastline of the Baltic Sea, the country offers an endless array of experiences. Its history is etched into grand palaces, intricate cathedrals, and the ruins of ancient empires, while its culture is celebrated through its world-renowned literature, music, and art. Poland is a destination that captivates the senses and enriches the soul, offering a journey of profound discovery.",
    "placesToVisit": [
      {
        "name": "Kraków",
        "summary": "A vibrant capital city famous for its history, architecture, and food."
      },
      {
        "name": "Warsaw",
        "summary": "The historic capital city known for its resilience and modern energy."
      }
    ],
    "travelTips": [
      "The Złoty (PLN) is the currency; credit cards are widely accepted.",
      "Learning basic Polish phrases will greatly improve your interactions.",
      "The best time to visit is during the summer for the best weather."
    ],
    "heroImage": {
      "src": "/images/countries/poland/hero.jpg",
      "alt": "The historic Old Town of Kraków in Poland"
    }
  },
  "portugal": {
    "slug": "portugal",
    "name": "Portugal",
    "region": "Europe",
    "heroDescription": "Portugal is a Mediterranean masterpiece where sun-drenched islands, ancient walled cities, and turquoise waters create a landscape of unparalleled beauty. From the iconic architecture of Lisbon and the historic treasures of Porto to the vibrant streets of the Algarve and the rugged beauty of the Azores, the country offers an endless array of experiences. Its culture is celebrated through its world-renowned culinary heritage, its colorful festivals, and its passionate love for life. Portugal is a destination that captivates the senses and enriches the soul, offering a journey of profound discovery and the art of 'saudade'—the sweet longing.",
    "placesToVisit": [
      {
        "name": "Lisbon",
        "summary": "A vibrant capital city known for its history, food, and nightlife."
      },
      {
        "name": "Porto",
        "summary": "A historic city famous for its wine, architecture, and river setting."
      }
    ],
    "travelTips": [
      "The Euro (EUR) is the currency; credit cards are widely accepted.",
      "Learning basic Portuguese phrases will greatly improve your interactions.",
      "Lunch is the main meal of the day; many shops close for a break in the afternoon."
    ],
    "heroImage": {
      "src": "/images/countries/portugal/hero.jpg",
      "alt": "The historic skyline of Lisbon in Portugal"
    }
  },
  "qatar": {
    "slug": "qatar",
    "name": "Qatar",
    "region": "Asia",
    "heroDescription": "Qatar is a modern and wealthy desert nation at the tip of the Arabian Gulf, where a futuristic skyline of bold and innovative architecture meets a rich maritime and trading heritage. The capital, Doha, features an opulent palace, world-class museums, and a bustling souq that reflects a rich cultural depth. The country's coastline features pristine beaches and modern marinas, while the desert interior holds the echoes of ancient nomadic life. With its vibrant arts scene, world-class shopping, and its role as a global hub of diplomacy and sport, Qatar is a sophisticated and welcoming gateway to the Gulf.",
    "placesToVisit": [
      {
        "name": "Doha",
        "summary": "A modern capital city known for its iconic towers and vibrant food scene."
      },
      {
        "name": "Souq Waqif",
        "summary": "A historic market in Doha known for its traditional architecture and food."
      }
    ],
    "travelTips": [
      "The Qatari Riyal (QAR) is the currency; credit cards are widely accepted.",
      "Learning basic Arabic phrases will greatly enhance your experience with locals.",
      "The best time to visit is during the cooler months from November to March."
    ],
    "heroImage": {
      "src": "/images/countries/qatar/hero.jpg",
      "alt": "The futuristic skyline of Doha in Qatar"
    }
  },
  "romania": {
    "slug": "romania",
    "name": "Romania",
    "region": "Europe",
    "heroDescription": "Romania is a land of captivating history, vibrant culture, and a spirit of innovation that has influenced the world. From the romantic streets of Bucharest and the historic spires of Brașov and Sibiu to the rugged beauty of the Carpathian Mountains and the dramatic coastline of the Black Sea, the country offers an endless array of experiences. Its history is etched into grand palaces, intricate cathedrals, and the ruins of ancient empires, while its culture is celebrated through its world-renowned literature, music, and art. Romania is a destination that captivates the senses and enriches the soul, offering a journey of profound discovery.",
    "placesToVisit": [
      {
        "name": "Bucharest",
        "summary": "A vibrant capital city famous for its history, architecture, and food."
      },
      {
        "name": "Bran Castle",
        "summary": "The ultimate fairytale castle, nestled in the Carpathian Mountains."
      }
    ],
    "travelTips": [
      "The Leu (RON) is the currency; credit cards are widely accepted.",
      "Learning basic Romanian phrases will greatly improve your interactions.",
      "The best time to visit is during the summer for the best weather."
    ],
    "heroImage": {
      "src": "/images/countries/romania/hero.jpg",
      "alt": "The fairytale Bran Castle in Transylvania"
    }
  },
  "russian-federation": {
    "slug": "russia",
    "name": "Russian Federation",
    "region": "Europe",
    "heroDescription": "Russia is a continental giant of irrepressible energy and immense cultural diversity, where the futuristic skylines of Moscow and Saint Petersburg meet the ancient kingdoms of the north and the lush rainforests of the south. Its culture is a rich tapestry of over 100 languages and ethnic groups, reflected in its world-class music, film, and culinary scenes. The country's landscape is a kaleidoscope of diverse environments, from the high-altitude peaks of the Caucasus to the turquoise waters of Lake Baikal and the remote beauty of the Kamchatka Peninsula. Russia is a destination that captivates the senses and the soul, offering a journey of profound discovery.",
    "placesToVisit": [
      {
        "name": "Moscow",
        "summary": "A dynamic capital city famous for its history, art, and iconic landmarks."
      },
      {
        "name": "Saint Petersburg",
        "summary": "A historic city known for its architecture, museums, and river setting."
      }
    ],
    "travelTips": [
      "The Russian Ruble (RUB) is the currency; credit cards are widely accepted in cities.",
      "Learning basic Russian phrases will greatly enhance your experience with locals.",
      "Check the latest security updates and travel with experienced local operators."
    ],
    "heroImage": {
      "src": "/images/countries/russia/hero.jpg",
      "alt": "The iconic Saint Basil's Cathedral in Moscow"
    }
  },
  "rwanda": {
    "slug": "rwanda",
    "name": "Rwanda",
    "region": "Africa",
    "heroDescription": "Rwanda, the 'Land of a Thousand Hills,' is a land of stunning mountain scenery, vibrant culture, and a resilient, welcoming spirit. It is a premier destination for wildlife viewing, with the Volcanoes National Park offering some of the most spectacular and challenging trails for gorilla trekking in Africa. The country's landscape is defined by its high-altitude plateaus, thundering waterfalls, and unique biodiversity in its national parks. With its warm hospitality and its raw, untamed beauty, Rwanda offers a rare and authentic experience of mountain life, where the traditional culture remains central to the nation's identity.",
    "placesToVisit": [
      {
        "name": "Volcanoes National Park",
        "summary": "A world-famous destination for gorilla trekking and mountain hiking."
      },
      {
        "name": "Kigali",
        "summary": "A vibrant and clean capital city known for its history and modern energy."
      }
    ],
    "travelTips": [
      "The Rwandan Franc (RWF) is the currency; cash is necessary outside major cities.",
      "Learning basic Kinyarwanda phrases will greatly enhance your experience with locals.",
      "The best time to visit is during the dry season from June to September."
    ],
    "heroImage": {
      "src": "/images/countries/rwanda/hero.jpg",
      "alt": "A mountain gorilla in the Volcanoes National Park"
    }
  },
  "saint-kitts-and-nevis": {
    "slug": "saintkittsnevis",
    "name": "Saint Kitts and Nevis",
    "region": "Americas",
    "heroDescription": "Saint Kitts and Nevis is a sophisticated and diverse island nation in the Caribbean, known for its stunning white-sand beaches, turquoise lagoons, and a rich multicultural heritage. Beyond its luxury resorts, the island offers a landscape of dramatic volcanic peaks, lush rainforests, and unique natural wonders like the Brimstone Hill Fortress. Its culture is a vibrant blend of African, British, and French influences, reflected in its world-class culinary scene and its colorful festivals. Whether seeking high-end romance, family adventure, or a simple life on a remote beach, Saint Kitts and Nevis offers a sanctuary of peace and tropical splendor.",
    "placesToVisit": [
      {
        "name": "Brimstone Hill Fortress",
        "summary": "A historic site and a UNESCO World Heritage reminder of the colonial world."
      },
      {
        "name": "Frigate Bay",
        "summary": "A beautiful stretch of white sand and turquoise waters on Saint Kitts."
      }
    ],
    "travelTips": [
      "The Eastern Caribbean Dollar (XCD) is the currency, but USD is widely accepted.",
      "Learning basic English phrases will greatly enhance your experience with locals.",
      "The best time to visit is during the dry season from January to May."
    ],
    "heroImage": {
      "src": "/images/countries/saintkittsnevis/hero.jpg",
      "alt": "The historic Brimstone Hill Fortress in Saint Kitts"
    }
  },
  "saint-lucia": {
    "slug": "saintlucia",
    "name": "Saint Lucia",
    "region": "Americas",
    "heroDescription": "Saint Lucia is a sophisticated and diverse island nation in the Caribbean, known for its stunning white-sand beaches, turquoise lagoons, and a rich multicultural heritage. Beyond its luxury resorts, the island offers a landscape of dramatic volcanic peaks, lush rainforests, and unique natural wonders like the Pitons. Its culture is a vibrant blend of African, British, and French influences, reflected in its world-class culinary scene and its colorful festivals. Whether seeking high-end romance, family adventure, or a simple life on a remote beach, Saint Lucia offers a sanctuary of peace and tropical splendor with a soulful, island heart.",
    "placesToVisit": [
      {
        "name": "The Pitons",
        "summary": "Two spectacular volcanic spires and a UNESCO World Heritage site."
      },
      {
        "name": "Soufrière",
        "summary": "A beautiful coastal town known for its history, hot springs, and volcanoes."
      }
    ],
    "travelTips": [
      "The Eastern Caribbean Dollar (XCD) is the currency, but USD is widely accepted.",
      "Learning basic English or French phrases will greatly enhance your experience.",
      "The best time to visit is during the dry season from January to May."
    ],
    "heroImage": {
      "src": "/images/countries/saintlucia/hero.jpg",
      "alt": "The iconic Pitons of Saint Lucia"
    }
  },
  "saint-vincent-and-the-grenadines": {
    "slug": "saintvincentgrenadines",
    "name": "Saint Vincent and the Grenadines",
    "region": "Americas",
    "heroDescription": "Saint Vincent and the Grenadines is a sophisticated and diverse island nation in the Caribbean, known for its stunning white-sand beaches, turquoise lagoons, and a rich multicultural heritage. Beyond its luxury resorts, the island offers a landscape of dramatic volcanic peaks, lush rainforests, and unique natural wonders like the La Soufrière volcano. Its culture is a vibrant blend of African, British, and French influences, reflected in its world-class culinary scene and its colorful festivals. Whether seeking high-end romance, family adventure, or a simple life on a remote beach, this island chain offers a sanctuary of peace.",
    "placesToVisit": [
      {
        "name": "Bequia",
        "summary": "A beautiful island in the Grenadines known for its beaches and sailing."
      },
      {
        "name": "Tobago Cays",
        "summary": "A stunning turquoise lagoon and a sanctuary for marine life."
      }
    ],
    "travelTips": [
      "The Eastern Caribbean Dollar (XCD) is the currency, but USD is widely accepted.",
      "Learning basic English phrases will greatly enhance your experience with locals.",
      "The best time to visit is during the dry season from January to May."
    ],
    "heroImage": {
      "src": "/images/countries/saintvincentgrenadines/hero.jpg",
      "alt": "The pristine turquoise waters of the Tobago Cays"
    }
  },
  "samoa": {
    "slug": "samoa",
    "name": "Samoa",
    "region": "Oceania",
    "heroDescription": "Samoa is a remote and beautiful archipelago of ten islands scattered across the vast expanse of the central Pacific Ocean. It is a land of pristine turquoise lagoons, swaying palm trees, and a traditional seafaring culture that remains deeply connected to the rhythms of the ocean. The islands are famous for their world-class diving and snorkeling, with the To Sua Ocean Trench offering a surreal landscape of limestone formations and hidden lakes. Despite its small size, Samoa is a global leader in marine conservation, providing a rare and authentic experience of island life at the very edge of the world.",
    "placesToVisit": [
      {
        "name": "To Sua Ocean Trench",
        "summary": "A unique and spectacular swimming hole set in a lush garden."
      },
      {
        "name": "Apia",
        "summary": "The vibrant capital city known for its history, culture, and food."
      }
    ],
    "travelTips": [
      "The Tala (WST) is the currency; cash is necessary for most transactions.",
      "Learning basic Samoan phrases will greatly enhance your experience with locals.",
      "The best time to visit is during the dry season from May to October."
    ],
    "heroImage": {
      "src": "/images/countries/samoa/hero.jpg",
      "alt": "The stunning To Sua Ocean Trench in Samoa"
    }
  },
  "san-marino": {
    "slug": "sanmarino",
    "name": "San Marino",
    "region": "Europe",
    "heroDescription": "San Marino is a tiny and ancient republic nestled high in the Apennine Mountains of Italy, defined by its soaring peaks and medieval fortresses. The capital, San Marino City, features an opulent palace, world-class museums, and a relaxed, welcoming atmosphere. The country's history is visible in its narrow, cobblestone streets, its historic palaces, and its unique status as one of the world's smallest sovereign states. Despite its small size, San Marino provides a grand and orderly escape, where high-end culture and pristine nature coexist in a landscape of quiet, mountain elegance.",
    "placesToVisit": [
      {
        "name": "Three Towers of San Marino",
        "summary": "Three spectacular medieval fortresses perched on the peaks of Mount Titano."
      },
      {
        "name": "San Marino City",
        "summary": "The historic capital city known for its history, architecture, and views."
      }
    ],
    "travelTips": [
      "The Euro (EUR) is the currency; credit cards are widely accepted.",
      "Italian is the official language; English is widely spoken.",
      "The best way to explore the republic is by walking or using the public buses."
    ],
    "heroImage": {
      "src": "/images/countries/sanmarino/hero.jpg",
      "alt": "The historic fortresses of San Marino on Mount Titano"
    }
  },
  "sao-tome-and-principe": {
    "slug": "saotomeprincipe",
    "name": "Sao Tome and Principe",
    "region": "Africa",
    "heroDescription": "Sao Tome and Principe is a remote and beautiful archipelago of two islands scattered across the vast expanse of the Gulf of Guinea. It is a land of pristine turquoise lagoons, swaying palm trees, and a traditional seafaring culture that remains deeply connected to the rhythms of the ocean. The islands are famous for their world-class diving and snorkeling, with the Obo National Park offering a surreal landscape of limestone formations and hidden lakes. Despite its small size, Sao Tome and Principe is a global leader in marine conservation, providing a rare and authentic experience of island life.",
    "placesToVisit": [
      {
        "name": "Obo National Park",
        "summary": "A pristine rainforest sanctuary and a haven for unique wildlife."
      },
      {
        "name": "Sao Tome City",
        "summary": "The vibrant capital city known for its history, culture, and food."
      }
    ],
    "travelTips": [
      "The Dobra (STN) is the currency; cash is necessary for most transactions.",
      "Learning basic Portuguese phrases will greatly enhance your experience with locals.",
      "The best time to visit is during the dry season from June to September."
    ],
    "heroImage": {
      "src": "/images/countries/saotomeprincipe/hero.jpg",
      "alt": "The lush rainforests of Sao Tome and Principe"
    }
  },
  "saudi-arabia": {
    "slug": "saudiarabia",
    "name": "Saudi Arabia",
    "region": "Asia",
    "heroDescription": "Saudi Arabia is a modern and wealthy desert nation at the tip of the Arabian Peninsula, where a futuristic skyline of bold and innovative architecture meets a rich maritime and trading heritage. The capital, Riyadh, features an opulent palace, world-class museums, and a bustling souq that reflects a rich cultural depth. The country's coastline features pristine beaches and modern marinas, while the desert interior holds the echoes of ancient nomadic life. With its vibrant arts scene, world-class shopping, and its role as a global hub of diplomacy and sport, Saudi Arabia is a sophisticated and welcoming gateway to the Gulf.",
    "placesToVisit": [
      {
        "name": "AlUla",
        "summary": "A historic site and a UNESCO World Heritage reminder of the ancient world."
      },
      {
        "name": "Riyadh",
        "summary": "A modern capital city known for its iconic towers and vibrant food scene."
      }
    ],
    "travelTips": [
      "The Saudi Riyal (SAR) is the currency; credit cards are widely accepted.",
      "Learning basic Arabic phrases will greatly enhance your experience with locals.",
      "The best time to visit is during the cooler months from November to March."
    ],
    "heroImage": {
      "src": "/images/countries/saudiarabia/hero.jpg",
      "alt": "The ancient ruins of Hegra in AlUla"
    }
  },
  "senegal": {
    "slug": "senegal",
    "name": "Senegal",
    "region": "Africa",
    "heroDescription": "Senegal is a West African powerhouse of culture and history, known for its vibrant energy, colorful festivals, and the warmth of its people. The coastline is dotted with somber reminders of the transatlantic slave trade in the form of Gorée Island, while the vibrant capital, Dakar, is a city of innovation and creativity. The country's interior is a sanctuary of biodiversity, home to the thundering waterfalls of the Fouta Djallon and the wildlife-rich Niokolo-Koba National Park. With its world-class music, rhythmic mbalax, and deep-rooted heritage, Senegal is a soulful and welcoming gateway to the African continent.",
    "placesToVisit": [
      {
        "name": "Dakar",
        "summary": "A dynamic coastal capital with a vibrant arts scene and lively markets."
      },
      {
        "name": "Gorée Island",
        "summary": "A historic site and a UNESCO World Heritage reminder of the slave trade."
      }
    ],
    "travelTips": [
      "French is the official language; basic phrases are essential for travel.",
      "The West African CFA Franc (XOF) is the currency; cash is king.",
      "The best time to visit is during the dry season from November to May."
    ],
    "heroImage": {
      "src": "/images/countries/senegal/hero.jpg",
      "alt": "The vibrant streets of Dakar in Senegal"
    }
  },
  "serbia": {
    "slug": "serbia",
    "name": "Serbia",
    "region": "Europe",
    "heroDescription": "Serbia is a land of captivating history, vibrant culture, and a spirit of innovation that has influenced the world. From the romantic streets of Belgrade and the historic spires of Novi Sad and Niš to the rugged beauty of the Tara National Park and the dramatic coastline of the Danube River, the country offers an endless array of experiences. Its history is etched into grand palaces, intricate cathedrals, and the ruins of ancient empires, while its culture is celebrated through its world-renowned music, art, and culinary heritage. Serbia is a destination that captivates the senses and enriches the soul, offering a journey of profound discovery.",
    "placesToVisit": [
      {
        "name": "Belgrade",
        "summary": "A vibrant capital city famous for its history, architecture, and nightlife."
      },
      {
        "name": "Novi Sad",
        "summary": "A historic city known for its fortress, festivals, and river setting."
      }
    ],
    "travelTips": [
      "The Serbian Dinar (RSD) is the currency; credit cards are widely accepted.",
      "Learning basic Serbian phrases will greatly improve your interactions.",
      "The best time to visit is during the summer for the best weather."
    ],
    "heroImage": {
      "src": "/images/countries/serbia/hero.jpg",
      "alt": "The historic Belgrade Fortress overlooking the Danube"
    }
  },
  "seychelles": {
    "slug": "seychelles",
    "name": "Seychelles",
    "region": "Africa",
    "heroDescription": "The Seychelles is the quintessential tropical paradise, an archipelago of 115 coral islands scattered across the turquoise waters of the Indian Ocean like a string of pearls. Each island is a sanctuary of white-sand beaches, swaying palm trees, and world-class luxury resorts, many featuring iconic granite boulders. The underwater world is a premier destination for diving and snorkeling, with vibrant coral reefs and an abundance of marine life, including whale sharks and manta rays. Whether seeking high-end romance, family adventure, or a simple life on a remote atoll, the Seychelles offers a dreamlike escape into a world of pure, tropical splendor.",
    "placesToVisit": [
      {
        "name": "Mahé",
        "summary": "The largest and most vibrant island, home to the capital city, Victoria."
      },
      {
        "name": "Praslin",
        "summary": "A stunning island famous for its beaches and the unique Vallée de Mai."
      }
    ],
    "travelTips": [
      "The Seychellois Rupee (SCR) is the currency; credit cards are widely accepted.",
      "The best way to travel between islands is by ferry or small plane.",
      "The best time to visit is during the dry season from May to October."
    ],
    "heroImage": {
      "src": "/images/countries/seychelles/hero.jpg",
      "alt": "The iconic granite boulders of Anse Source d'Argent"
    }
  },
  "sierra-leone": {
    "slug": "sierraleone",
    "name": "Sierra Leone",
    "region": "Africa",
    "heroDescription": "Sierra Leone is a land of lush rainforests and pristine Atlantic beaches, a West African nation with a unique history and a resilient, welcoming spirit. Its coastline offers some of the world's best-kept secrets for surfers and sun-seekers, with perfect point breaks and a laid-back atmosphere in towns like Tokeh. The country's interior is a sanctuary of biodiversity, home to the rare pygmy hippopotamus and some of the region's last primary rainforest in the Gola Rainforest National Park. Despite its challenges, Sierra Leone is a country of immense natural beauty and a soulful culture, offering an authentic and off-the-beaten-path experience.",
    "placesToVisit": [
      {
        "name": "Freetown",
        "summary": "A dynamic coastal capital with a vibrant arts scene and lively markets."
      },
      {
        "name": "Tokeh Beach",
        "summary": "A world-class beach destination with white sand and turquoise waters."
      }
    ],
    "travelTips": [
      "English is the official language, making it very easy for many travelers.",
      "The Leone (SLL) is the currency; cash is necessary for most transactions.",
      "The best time to visit is during the dry season from November to April."
    ],
    "heroImage": {
      "src": "/images/countries/sierraleone/hero.jpg",
      "alt": "The pristine Atlantic beaches of Sierra Leone"
    }
  },
  "singapore": {
    "slug": "singapore",
    "name": "Singapore",
    "region": "Asia",
    "heroDescription": "Singapore is a futuristic city-state and a global hub of innovation, where a stunning skyline of bold architecture meets a rich multicultural heritage and a commitment to green living. From the iconic Gardens by the Bay and the Marina Bay Sands to the vibrant streets of Little India and Chinatown, the city offers an endless array of experiences. Its culture is a rich tapestry of Malay, Chinese, and Indian influences, reflected in its world-class culinary scene and its passionate love for life. With its warm hospitality and its pristine urban beauty, Singapore is a premier destination for adventure and serenity, offering a journey of profound discovery.",
    "placesToVisit": [
      {
        "name": "Gardens by the Bay",
        "summary": "A futuristic park known for its Supertrees and world-class conservatories."
      },
      {
        "name": "Marina Bay Sands",
        "summary": "An iconic hotel and resort with a spectacular rooftop infinity pool."
      }
    ],
    "travelTips": [
      "The Singapore Dollar (SGD) is the currency; credit cards are used for everything.",
      "The EZ-Link card is the best way to travel on public transport in the city.",
      "Learning basic English phrases will greatly improve your interactions."
    ],
    "heroImage": {
      "src": "/images/countries/singapore/hero.jpg",
      "alt": "The futuristic Supertrees of Gardens by the Bay"
    }
  },
  "slovakia": {
    "slug": "slovakia",
    "name": "Slovakia",
    "region": "Europe",
    "heroDescription": "Slovakia is a land of captivating history, vibrant culture, and a spirit of innovation that has influenced the world. From the romantic streets of Bratislava and the historic spires of Košice and Banská Štiavnica to the rugged beauty of the High Tatras and the dramatic coastline of the Danube River, the country offers an endless array of experiences. Its history is etched into grand palaces, intricate cathedrals, and the ruins of ancient empires, while its culture is celebrated through its world-renowned literature, music, and art. Slovakia is a destination that captivates the senses and enriches the soul, offering a journey of profound discovery.",
    "placesToVisit": [
      {
        "name": "Bratislava",
        "summary": "A vibrant capital city famous for its history, architecture, and food."
      },
      {
        "name": "High Tatras",
        "summary": "A spectacular mountain range known for its hiking and skiing."
      }
    ],
    "travelTips": [
      "The Euro (EUR) is the currency; credit cards are widely accepted.",
      "Learning basic Slovak phrases will greatly improve your interactions.",
      "The best time to visit is during the summer for the best weather."
    ],
    "heroImage": {
      "src": "/images/countries/slovakia/hero.jpg",
      "alt": "The historic Bratislava Castle overlooking the Danube"
    }
  },
  "slovenia": {
    "slug": "slovenia",
    "name": "Slovenia",
    "region": "Europe",
    "heroDescription": "Slovenia is a land of captivating history, vibrant culture, and a spirit of innovation that has influenced the world. From the romantic streets of Ljubljana and the historic spires of Maribor and Piran to the rugged beauty of the Julian Alps and the dramatic coastline of the Adriatic Sea, the country offers an endless array of experiences. Its history is etched into grand palaces, intricate cathedrals, and the ruins of ancient empires, while its culture is celebrated through its world-renowned literature, music, and art. Slovenia is a destination that captivates the senses and enriches the soul, offering a journey of profound discovery.",
    "placesToVisit": [
      {
        "name": "Ljubljana",
        "summary": "A vibrant capital city famous for its history, architecture, and food."
      },
      {
        "name": "Lake Bled",
        "summary": "A stunning alpine lake with a historic castle and island church."
      }
    ],
    "travelTips": [
      "The Euro (EUR) is the currency; credit cards are widely accepted.",
      "Learning basic Slovenian phrases will greatly improve your interactions.",
      "The best time to visit is during the summer for the best weather."
    ],
    "heroImage": {
      "src": "/images/countries/slovenia/hero.jpg",
      "alt": "The stunning Lake Bled in the Julian Alps"
    }
  },
  "solomon-islands": {
    "slug": "solomonislands",
    "name": "Solomon Islands",
    "region": "Oceania",
    "heroDescription": "The Solomon Islands is a remote and beautiful archipelago of over 900 islands scattered across the vast expanse of the western Pacific Ocean. It is a land of pristine turquoise lagoons, lush rainforests, and a traditional seafaring culture that remains deeply connected to the rhythms of the ocean. The islands are famous for their world-class diving and snorkeling, with the Iron Bottom Sound offering a surreal landscape of sunken WWII wrecks and vibrant coral reefs. Despite its small size, the Solomon Islands is a global leader in marine conservation, providing a rare and authentic experience of island life at the very edge of the world.",
    "placesToVisit": [
      {
        "name": "Honiara",
        "summary": "The vibrant capital city known for its history, culture, and food."
      },
      {
        "name": "Marovo Lagoon",
        "summary": "The world's largest saltwater lagoon and a sanctuary for marine life."
      }
    ],
    "travelTips": [
      "The Solomon Islands Dollar (SBD) is the currency; cash is necessary.",
      "The best way to travel between islands is by small plane or boat.",
      "The best time to visit is during the dry season from May to October."
    ],
    "heroImage": {
      "src": "/images/countries/solomonislands/hero.jpg",
      "alt": "A pristine turquoise lagoon in the Solomon Islands"
    }
  },
  "somalia": {
    "slug": "somalia",
    "name": "Somalia",
    "region": "Africa",
    "heroDescription": "Somalia is a land of profound history and extraordinary landscapes, once the heart of the powerful ancient kingdoms and a center of maritime trade in the Horn of Africa. The ancient ruins of Zeila and the historic streets of Mogadishu stand as powerful symbols of human ambition and spiritual depth, while the country's landscape is a mix of high-altitude plateaus, fertile valleys, and a sun-drenched coastline along the Indian Ocean. Despite its turbulent recent history, Somalia remains a place of deep cultural depth and resilient spirit, offering a profound and moving experience for those seeking to understand the roots of human society.",
    "placesToVisit": [
      {
        "name": "Mogadishu",
        "summary": "A historic coastal capital city with a rich history and culture."
      },
      {
        "name": "Laas Geel",
        "summary": "A spectacular site of ancient rock art and a UNESCO World Heritage reminder."
      }
    ],
    "travelTips": [
      "Somali and Arabic are the official languages; basic phrases are essential.",
      "The Somali Shilling (SOS) is the currency; cash is necessary.",
      "Check the latest security updates and travel with experienced local operators."
    ],
    "heroImage": {
      "src": "/images/countries/somalia/hero.jpg",
      "alt": "The ancient rock art of Laas Geel in Somalia"
    }
  },
  "south-africa": {
    "slug": "southafrica",
    "name": "South Africa",
    "region": "Africa",
    "heroDescription": "South Africa is a continental giant of irrepressible energy and immense cultural diversity, where the futuristic skylines of Cape Town and Johannesburg meet the ancient kingdoms of the north and the lush savannas of the south. Its culture is a rich tapestry of over 11 languages and ethnic groups, reflected in its world-class music, film, and culinary scenes. The country's landscape is a kaleidoscope of diverse environments, from the high-altitude peaks of the Drakensberg to the turquoise waters of the Garden Route and the remote beauty of the Kalahari Desert. South Africa is a destination that captivates the senses and the soul.",
    "placesToVisit": [
      {
        "name": "Cape Town",
        "summary": "A vibrant coastal city known for its history, food, and iconic landmarks."
      },
      {
        "name": "Kruger National Park",
        "summary": "A world-famous destination for wildlife viewing and a sanctuary for the Big Five."
      }
    ],
    "travelTips": [
      "The Rand (ZAR) is the currency; credit cards are widely accepted.",
      "Learning basic English or Afrikaans phrases will greatly improve your interactions.",
      "The best time to visit for wildlife viewing is during the dry season (May-September)."
    ],
    "heroImage": {
      "src": "/images/countries/southafrica/hero.jpg",
      "alt": "The iconic Table Mountain overlooking Cape Town"
    }
  },
  "republic-of-korea": {
    "slug": "southkorea",
    "name": "Republic of Korea",
    "region": "Asia",
    "heroDescription": "South Korea is a fascinating blend of ancient traditions and futuristic innovation, where serene Zen gardens and historic temples sit alongside neon-lit skyscrapers and high-speed trains. From the bustling energy of Seoul and the cultural heart of Gyeongju to the snow-capped peak of Mount Hallasan and the tropical islands of Jeju, the country offers a staggering variety of experiences. Its culture is defined by a deep respect for craftsmanship, seasonal beauty, and a unique aesthetic that values both simplicity and complexity. Whether soaking in a jjimjilbang, savoring world-class BBQ, or exploring a remote mountain temple, South Korea provides a journey of profound grace.",
    "placesToVisit": [
      {
        "name": "Seoul",
        "summary": "A futuristic metropolis known for its neon lights, food, and culture."
      },
      {
        "name": "Jeju Island",
        "summary": "A stunning volcanic island famous for its beaches and natural beauty."
      }
    ],
    "travelTips": [
      "The South Korean Won (KRW) is the currency; credit cards are used for everything.",
      "The T-money card is the best way to travel on public transport in cities.",
      "Learning basic Korean phrases will greatly improve your interactions."
    ],
    "heroImage": {
      "src": "/images/countries/southkorea/hero.jpg",
      "alt": "The futuristic skyline of Seoul at night"
    }
  },
  "south-sudan": {
    "slug": "southsudan",
    "name": "South Sudan",
    "region": "Africa",
    "heroDescription": "South Sudan is a land of profound history and extraordinary landscapes, the world's youngest nation and a center of vibrant traditional cultures and spiritual depth. Its history is etched into the stone of ancient ruins and the historic streets of Juba, while its culture is a rich tapestry of over 60 ethnic groups, reflected in its world-class music and art. The country's landscape is a mix of high-altitude plateaus, fertile valleys, and the vast, wind-sculpted sands of the desert. Despite its challenges, South Sudan remains a place of deep cultural depth and resilient spirit, offering a profound and moving experience.",
    "placesToVisit": [
      {
        "name": "Juba",
        "summary": "The vibrant capital city known for its history, culture, and food."
      },
      {
        "name": "Boma National Park",
        "summary": "A spectacular national park and a haven for unique wildlife."
      }
    ],
    "travelTips": [
      "English is the official language, making it very easy for many travelers.",
      "The South Sudanese Pound (SSP) is the currency; cash is necessary.",
      "Check the latest security updates and travel with experienced local operators."
    ],
    "heroImage": {
      "src": "/images/countries/southsudan/hero.jpg",
      "alt": "The lush savannas of South Sudan"
    }
  },
  "spain": {
    "slug": "spain",
    "name": "Spain",
    "region": "Europe",
    "heroDescription": "Spain is a Mediterranean masterpiece where sun-drenched islands, ancient walled cities, and turquoise waters create a landscape of unparalleled beauty. From the iconic architecture of Madrid and the historic treasures of Barcelona to the vibrant streets of Seville and the rugged beauty of the Pyrenees, the country offers an endless array of experiences. Its culture is celebrated through its world-renowned culinary heritage, its colorful festivals, and its passionate love for life. Spain is a destination that captivates the senses and enriches the soul, offering a journey of profound discovery and the art of 'fiesta'—the joy of the moment.",
    "placesToVisit": [
      {
        "name": "Madrid",
        "summary": "A vibrant capital city known for its history, art, and nightlife."
      },
      {
        "name": "Barcelona",
        "summary": "A historic city famous for its architecture, food, and Mediterranean setting."
      }
    ],
    "travelTips": [
      "The Euro (EUR) is the currency; credit cards are widely accepted.",
      "Learning basic Spanish phrases will greatly improve your interactions.",
      "Lunch is the main meal of the day; many shops close for a break in the afternoon."
    ],
    "heroImage": {
      "src": "/images/countries/spain/hero.jpg",
      "alt": "The iconic Sagrada Família in Barcelona at sunset"
    }
  },
  "sri-lanka": {
    "slug": "srilanka",
    "name": "Sri Lanka",
    "region": "Asia",
    "heroDescription": "Sri Lanka is a land of golden temples, sun-drenched rivers, and infectious energy, where the futuristic skyline of Colombo meets the ancient ruins of Anuradhapura and the lush jungles of the north. Its culture is a rich tapestry of Buddhist traditions and modern Pacific influences, reflected in its world-class culinary scene and its passionate love for life. The Mahaweli River serves as the nation's lifeblood, winding through a landscape of rolling savannas and vibrant markets. With its warm hospitality and its pristine natural beauty, Sri Lanka is a premier destination for adventure and serenity, offering a journey of profound discovery.",
    "placesToVisit": [
      {
        "name": "Sigiriya",
        "summary": "A spectacular ancient rock fortress and a UNESCO World Heritage site."
      },
      {
        "name": "Ella",
        "summary": "A beautiful mountain town known for its tea plantations and hiking."
      }
    ],
    "travelTips": [
      "The Sri Lankan Rupee (LKR) is the currency; cash is necessary for most transactions.",
      "Learning basic Sinhala or Tamil phrases will greatly enhance your experience.",
      "The best time to visit is during the dry season (December-March and May-September)."
    ],
    "heroImage": {
      "src": "/images/countries/srilanka/hero.jpg",
      "alt": "The ancient rock fortress of Sigiriya in Sri Lanka"
    }
  },
  "sudan": {
    "slug": "sudan",
    "name": "Sudan",
    "region": "Africa",
    "heroDescription": "Sudan is a land of profound history and extraordinary landscapes, once the heart of the powerful ancient kingdoms and a center of maritime trade in the Horn of Africa. The ancient ruins of Meroë and the historic streets of Khartoum stand as powerful symbols of human ambition and spiritual depth, while the country's landscape is a mix of high-altitude plateaus, fertile valleys, and a sun-drenched coastline along the Red Sea. Despite its turbulent recent history, Sudan remains a place of deep cultural depth and resilient spirit, offering a profound and moving experience for those seeking to understand the roots of human society.",
    "placesToVisit": [
      {
        "name": "Pyramids of Meroë",
        "summary": "A spectacular site of ancient pyramids and a UNESCO World Heritage reminder."
      },
      {
        "name": "Khartoum",
        "summary": "The historic capital city known for its history, culture, and river setting."
      }
    ],
    "travelTips": [
      "Arabic is the official language; basic phrases are essential for travel.",
      "The Sudanese Pound (SDG) is the currency; cash is necessary.",
      "Check the latest security updates and travel with experienced local operators."
    ],
    "heroImage": {
      "src": "/images/countries/sudan/hero.jpg",
      "alt": "The ancient pyramids of Meroë in Sudan"
    }
  },
  "suriname": {
    "slug": "suriname",
    "name": "Suriname",
    "region": "Americas",
    "heroDescription": "Suriname is a land of lush rainforests and pristine Atlantic beaches, a South American nation with a unique history and a resilient, welcoming spirit. Its coastline offers some of the world's best-kept secrets for surfers and sun-seekers, with perfect point breaks and a laid-back atmosphere in towns like Paramaribo. The country's interior is a sanctuary of biodiversity, home to the rare pygmy hippopotamus and some of the region's last primary rainforest in the Central Suriname Nature Reserve. Despite its challenges, Suriname is a country of immense natural beauty and a soulful culture, offering an authentic and off-the-beaten-path experience.",
    "placesToVisit": [
      {
        "name": "Paramaribo",
        "summary": "A vibrant coastal capital known for its history, architecture, and food."
      },
      {
        "name": "Central Suriname Nature Reserve",
        "summary": "A pristine rainforest sanctuary and a UNESCO World Heritage site."
      }
    ],
    "travelTips": [
      "Dutch is the official language; basic phrases are essential for travel.",
      "The Surinamese Dollar (SRD) is the currency; cash is necessary.",
      "The best time to visit is during the dry seasons (February-April and August-November)."
    ],
    "heroImage": {
      "src": "/images/countries/suriname/hero.jpg",
      "alt": "The historic wooden architecture of Paramaribo"
    }
  },
  "sweden": {
    "slug": "sweden",
    "name": "Sweden",
    "region": "Europe",
    "heroDescription": "Sweden is a land of coastal beauty, innovative design, and a unique philosophy of 'lagom'—the art of balanced contentment. Stockholm, the vibrant capital, is a city of islands, world-class museums, and a cycling culture that is second to none. The country's landscape is defined by its flat, fertile plains, sandy Baltic beaches, and the dramatic mountains of the north in Lapland. From the midnight sun of summer to the snowy silence of winter, Sweden provides a serene and invigorating escape into one of the world's most stable and beautiful nations. It is a place where tradition and innovation coexist harmoniously.",
    "placesToVisit": [
      {
        "name": "Stockholm",
        "summary": "A cool and compact capital city known for its design, food, and maritime setting."
      },
      {
        "name": "Gothenburg",
        "summary": "A vibrant coastal city famous for its history, canals, and seafood."
      }
    ],
    "travelTips": [
      "The Swedish Krona (SEK) is the currency; credit cards are used for everything.",
      "Renting a bike is the best way to explore Stockholm like a local.",
      "The best time to visit is during the summer for the 'White Nights' effect."
    ],
    "heroImage": {
      "src": "/images/countries/sweden/hero.jpg",
      "alt": "The historic Gamla Stan in Stockholm"
    }
  },
  "switzerland": {
    "slug": "switzerland",
    "name": "Switzerland",
    "region": "Europe",
    "heroDescription": "Switzerland is a land of captivating history, vibrant culture, and a spirit of innovation that has influenced the world. From the romantic streets of Zurich and the historic spires of Geneva and Bern to the rugged beauty of the Alps and the dramatic coastline of the Swiss Lakes, the country offers an endless array of experiences. Its history is etched into grand palaces, intricate cathedrals, and the ruins of ancient empires, while its culture is celebrated through its world-renowned literature, music, and art. Switzerland is a destination that captivates the senses and enriches the soul, offering a journey of profound discovery.",
    "placesToVisit": [
      {
        "name": "Zurich",
        "summary": "A vibrant capital city famous for its history, architecture, and food."
      },
      {
        "name": "Zermatt",
        "summary": "A spectacular mountain resort town known for its skiing and the Matterhorn."
      }
    ],
    "travelTips": [
      "The Swiss Franc (CHF) is the official currency of Switzerland.",
      "German, French, Italian, and Romansh are the official languages.",
      "The train network (SBB) is excellent and the best way to travel."
    ],
    "heroImage": {
      "src": "/images/countries/switzerland/hero.jpg",
      "alt": "The iconic Matterhorn peak in the Swiss Alps"
    }
  },
  "syrian-arab-republic": {
    "slug": "syria",
    "name": "Syrian Arab Republic",
    "region": "Asia",
    "heroDescription": "Syria is a land of profound history and extraordinary architecture, once the heart of the powerful ancient kingdoms and a center of Islamic learning in Damascus. The ancient ruins of Palmyra and the historic streets of Aleppo stand as powerful symbols of human ambition and spiritual depth, while the country's landscape is a mix of high-altitude plateaus, fertile valleys, and a sun-drenched Mediterranean coast. Despite its turbulent recent history, Syria remains a place of deep cultural depth and resilient spirit, offering a profound and moving experience for those seeking to understand the roots of human society.",
    "placesToVisit": [
      {
        "name": "Damascus",
        "summary": "One of the world's oldest continuously inhabited cities and a historic capital."
      },
      {
        "name": "Palmyra",
        "summary": "A spectacular site of ancient ruins and a UNESCO World Heritage reminder."
      }
    ],
    "travelTips": [
      "Arabic is the official language; basic phrases are essential for travel.",
      "The Syrian Pound (SYP) is the currency; cash is necessary.",
      "Check the latest security updates and travel with experienced local operators."
    ],
    "heroImage": {
      "src": "/images/countries/syria/hero.jpg",
      "alt": "The ancient Roman ruins of Palmyra in Syria"
    }
  },
  "tajikistan": {
    "slug": "tajikistan",
    "name": "Tajikistan",
    "region": "Asia",
    "heroDescription": "Tajikistan is a land of celestial mountains and nomadic traditions, where the soaring peaks of the Pamir range define the landscape and the soul of the nation. It is a paradise for hikers and mountaineers, with the Pamir Highway offering one of the most spectacular and challenging road journeys on Earth. The country's landscape is a mix of high-altitude plateaus, thundering waterfalls, and unique biodiversity in its national parks. With its rich Silk Road history and a culture that values hospitality and freedom, Tajikistan provides a raw and authentic adventure in the heart of Central Asia, where life is lived in harmony with the elements.",
    "placesToVisit": [
      {
        "name": "Dushanbe",
        "summary": "The vibrant capital city known for its history, culture, and food."
      },
      {
        "name": "Pamir Highway",
        "summary": "One of the world's most spectacular and challenging road journeys."
      }
    ],
    "travelTips": [
      "The Somoni (TJS) is the currency; cash is necessary outside major cities.",
      "Learning basic Tajik or Russian phrases will greatly enhance your experience.",
      "The best time to visit is during the summer for hiking and mountain activities."
    ],
    "heroImage": {
      "src": "/images/countries/tajikistan/hero.jpg",
      "alt": "The stunning mountain scenery of the Pamir range"
    }
  },
  "united-republic-of-tanzania": {
    "slug": "tanzania",
    "name": "United Republic of Tanzania",
    "region": "Africa",
    "heroDescription": "Tanzania is a land of stunning mountain scenery, vibrant culture, and a resilient, welcoming spirit. It is a premier destination for wildlife viewing, with the Serengeti National Park offering some of the most spectacular and challenging trails for the Great Migration in Africa. The country's landscape is defined by its high-altitude plateaus, thundering waterfalls, and unique biodiversity in its national parks. With its warm hospitality and its raw, untamed beauty, Tanzania offers a rare and authentic experience of mountain life, where the traditional culture remains central to the nation's identity.",
    "placesToVisit": [
      {
        "name": "Serengeti National Park",
        "summary": "A world-famous destination for wildlife viewing and the Great Migration."
      },
      {
        "name": "Zanzibar",
        "summary": "A stunning island famous for its beaches, history, and spice plantations."
      }
    ],
    "travelTips": [
      "The Tanzanian Shilling (TZS) is the currency; cash is necessary outside major cities.",
      "Learning basic Swahili phrases will greatly enhance your experience with locals.",
      "The best time to visit is during the dry season from June to October."
    ],
    "heroImage": {
      "src": "/images/countries/tanzania/hero.jpg",
      "alt": "Wildlife on the vast savannas of the Serengeti"
    }
  },
  "thailand": {
    "slug": "thailand",
    "name": "Thailand",
    "region": "Asia",
    "heroDescription": "Thailand is a land of golden temples, sun-drenched rivers, and infectious energy, where the futuristic skyline of Bangkok meets the ancient ruins of Ayutthaya and the lush jungles of the north. Its culture is a rich tapestry of Buddhist traditions and modern Pacific influences, reflected in its world-class culinary scene and its passionate love for life. The Chao Phraya River serves as the nation's lifeblood, winding through a landscape of rolling savannas and vibrant markets. With its warm hospitality and its pristine natural beauty, Thailand is a premier destination for adventure and serenity, offering a journey of profound discovery.",
    "placesToVisit": [
      {
        "name": "Bangkok",
        "summary": "A dynamic capital city known for its history, food, and nightlife."
      },
      {
        "name": "Chiang Mai",
        "summary": "The cultural heart of the north, home to hundreds of temples and markets."
      }
    ],
    "travelTips": [
      "The Thai Baht (THB) is the currency; credit cards are widely accepted.",
      "Learning basic Thai phrases will greatly enhance your experience with locals.",
      "The best time to visit is during the dry season from November to February."
    ],
    "heroImage": {
      "src": "/images/countries/thailand/hero.jpg",
      "alt": "The stunning Grand Palace in Bangkok"
    }
  },
  "timor-leste": {
    "slug": "timorleste",
    "name": "Timor-Leste",
    "region": "Asia",
    "heroDescription": "Timor-Leste is a remote and beautiful island nation in Southeast Asia, defined by its lush rainforests, dramatic peaks, and a traditional culture that remains deeply connected to the land and sea. Its coastline offers some of the world's best-kept secrets for divers and sun-seekers, with pristine coral reefs and a laid-back atmosphere in towns like Dili. The country's interior is a sanctuary of biodiversity, home to the rare pygmy hippopotamus and some of the region's last primary rainforest in the Nino Konis Santana National Park. Despite its challenges, Timor-Leste is a country of immense natural beauty.",
    "placesToVisit": [
      {
        "name": "Dili",
        "summary": "The vibrant capital city known for its history, culture, and food."
      },
      {
        "name": "Atauro Island",
        "summary": "A stunning island famous for its world-class diving and snorkeling."
      }
    ],
    "travelTips": [
      "Timor-Leste uses the US Dollar (USD) as its official currency.",
      "Learning basic Tetum or Portuguese phrases will greatly enhance your experience.",
      "The best time to visit is during the dry season from May to October."
    ],
    "heroImage": {
      "src": "/images/countries/timorleste/hero.jpg",
      "alt": "The pristine turquoise waters of Atauro Island"
    }
  },
  "togo": {
    "slug": "togo",
    "name": "Togo",
    "region": "Africa",
    "heroDescription": "Togo is a West African powerhouse of culture and history, known for its vibrant energy, colorful festivals, and the warmth of its people. The coastline is dotted with somber reminders of the transatlantic slave trade in the form of Togoville, while the vibrant capital, Lomé, is a city of innovation and creativity. The country's interior is a sanctuary of biodiversity, home to the thundering waterfalls of the Plateau region and the wildlife-rich Fazao-Malfakassa National Park. With its world-class music, rhythmic highlife, and deep-rooted heritage, Togo is a soulful and welcoming gateway to the African continent.",
    "placesToVisit": [
      {
        "name": "Lomé",
        "summary": "A dynamic coastal capital with a vibrant arts scene and lively markets."
      },
      {
        "name": "Koutammakou",
        "summary": "A historic site and a UNESCO World Heritage reminder of the Batammariba people."
      }
    ],
    "travelTips": [
      "French is the official language; basic phrases are essential for travel.",
      "The West African CFA Franc (XOF) is the currency; cash is king.",
      "The best time to visit is during the dry season from November to March."
    ],
    "heroImage": {
      "src": "/images/countries/togo/hero.jpg",
      "alt": "The vibrant markets of Lomé in Togo"
    }
  },
  "tonga": {
    "slug": "tonga",
    "name": "Tonga",
    "region": "Oceania",
    "heroDescription": "Tonga is a remote and beautiful archipelago of 169 islands scattered across the vast expanse of the central Pacific Ocean. It is a land of pristine turquoise lagoons, swaying palm trees, and a traditional seafaring culture that remains deeply connected to the rhythms of the ocean. The islands are famous for their world-class diving and snorkeling, with the Vava'u group offering a surreal landscape of limestone formations and hidden lakes. Despite its small size, Tonga is a global leader in marine conservation, providing a rare and authentic experience of island life at the very edge of the world.",
    "placesToVisit": [
      {
        "name": "Nuku'alofa",
        "summary": "The vibrant capital city known for its history, culture, and food."
      },
      {
        "name": "Vava'u",
        "summary": "A stunning island chain famous for its sailing and whale watching."
      }
    ],
    "travelTips": [
      "The Pa'anga (TOP) is the currency; cash is necessary for most transactions.",
      "Learning basic Tongan phrases will greatly enhance your experience with locals.",
      "The best time to visit for whale watching is from July to October."
    ],
    "heroImage": {
      "src": "/images/countries/tonga/hero.jpg",
      "alt": "A pristine turquoise lagoon in Tonga"
    }
  },
  "trinidad-and-tobago": {
    "slug": "trinidadtobago",
    "name": "Trinidad and Tobago",
    "region": "Americas",
    "heroDescription": "Trinidad and Tobago is a sophisticated and diverse island nation in the Caribbean, known for its stunning white-sand beaches, turquoise lagoons, and a rich multicultural heritage. Beyond its luxury resorts, the island offers a landscape of dramatic volcanic peaks, lush rainforests, and unique natural wonders like the Pitch Lake. Its culture is a vibrant blend of African, Indian, and British influences, reflected in its world-class culinary scene and its colorful festivals. Whether seeking high-end romance, family adventure, or a simple life on a remote beach, this island nation offers a sanctuary of peace.",
    "placesToVisit": [
      {
        "name": "Port of Spain",
        "summary": "A vibrant capital city known for its history, architecture, and Carnival."
      },
      {
        "name": "Pigeon Point",
        "summary": "A beautiful stretch of white sand and turquoise waters on Tobago."
      }
    ],
    "travelTips": [
      "The Trinidad and Tobago Dollar (TTD) is the currency; credit cards are widely accepted.",
      "Learning basic English phrases will greatly enhance your experience with locals.",
      "The best time to visit is during the dry season from January to May."
    ],
    "heroImage": {
      "src": "/images/countries/trinidadtobago/hero.jpg",
      "alt": "The pristine beaches of Pigeon Point in Tobago"
    }
  },
  "tunisia": {
    "slug": "tunisia",
    "name": "Tunisia",
    "region": "Africa",
    "heroDescription": "Tunisia is a land of profound history and extraordinary architecture, once the heart of the powerful ancient kingdoms and a center of maritime trade in the Mediterranean. The ancient ruins of Carthage and the historic streets of Tunis stand as powerful symbols of human ambition and spiritual depth, while the country's landscape is a mix of high-altitude plateaus, fertile valleys, and a sun-drenched coastline along the Mediterranean Sea. Despite its turbulent recent history, Tunisia remains a place of deep cultural depth and resilient spirit, offering a profound and moving experience for those seeking to understand the roots of human society.",
    "placesToVisit": [
      {
        "name": "Tunis",
        "summary": "A vibrant capital city known for its history, architecture, and food."
      },
      {
        "name": "Carthage",
        "summary": "A historic site and a UNESCO World Heritage reminder of the ancient world."
      }
    ],
    "travelTips": [
      "Arabic and French are the official languages; basic phrases are essential.",
      "The Tunisian Dinar (TND) is the currency; cash is necessary.",
      "The best time to visit is during the spring or autumn for the best weather."
    ],
    "heroImage": {
      "src": "/images/countries/tunisia/hero.jpg",
      "alt": "The historic blue-and-white village of Sidi Bou Said"
    }
  },
  "turkey": {
    "slug": "turkey",
    "name": "Turkey",
    "region": "Asia",
    "heroDescription": "Turkey is a land of profound history and extraordinary architecture, once the heart of the powerful Byzantine and Ottoman Empires and a center of Islamic learning in Istanbul. The ancient ruins of Ephesus and the historic streets of Cappadocia stand as powerful symbols of human ambition and spiritual depth, while the country's landscape is a mix of high-altitude plateaus, fertile valleys, and a sun-drenched Mediterranean coast. Despite its turbulent recent history, Turkey remains a place of deep cultural depth and resilient spirit, offering a profound and moving experience for those seeking to understand the roots of human society.",
    "placesToVisit": [
      {
        "name": "Istanbul",
        "summary": "A vibrant capital city known for its history, food, and nightlife."
      },
      {
        "name": "Cappadocia",
        "summary": "A spectacular region of fairy chimneys and hot air balloon rides."
      }
    ],
    "travelTips": [
      "The Turkish Lira (TRY) is the currency; credit cards are widely accepted.",
      "Learning basic Turkish phrases will greatly enhance your experience with locals.",
      "The best time to visit is during the spring or autumn for the best weather."
    ],
    "heroImage": {
      "src": "/images/countries/turkey/hero.jpg",
      "alt": "The iconic Hagia Sophia in Istanbul"
    }
  },
  "turkmenistan": {
    "slug": "turkmenistan",
    "name": "Turkmenistan",
    "region": "Asia",
    "heroDescription": "Turkmenistan is a land of vast desert majesty and ancient nomadic traditions, where the Sahara Desert meets the Caspian coast in a landscape of dramatic dunes and hidden oases. The ancient ksar of Merv, a center of Islamic learning, stands as a UNESCO-listed treasure of desert architecture, while the Darvaza Gas Crater offers a surreal landscape of shifting sands and dinosaur fossils. The country's interior is a wild frontier of nomadic cultures and the world's longest iron ore train, offering a unique and challenging adventure. With its deep-rooted traditions and its raw, untamed beauty, Turkmenistan is a destination for the truly adventurous.",
    "placesToVisit": [
      {
        "name": "Ashgabat",
        "summary": "The vibrant capital city known for its history, culture, and food."
      },
      {
        "name": "Darvaza Gas Crater",
        "summary": "A spectacular site of a burning gas crater in the middle of the desert."
      }
    ],
    "travelTips": [
      "The Manat (TMT) is the currency; cash is necessary as ATMs are rare.",
      "Learning basic Turkmen or Russian phrases will greatly enhance your experience.",
      "Check the latest security updates and travel with experienced local operators."
    ],
    "heroImage": {
      "src": "/images/countries/turkmenistan/hero.jpg",
      "alt": "The surreal Darvaza Gas Crater in Turkmenistan"
    }
  },
  "tuvalu": {
    "slug": "tuvalu",
    "name": "Tuvalu",
    "region": "Oceania",
    "heroDescription": "Tuvalu is a remote and beautiful archipelago of nine coral atolls scattered across the vast expanse of the central Pacific Ocean. It is a land of pristine turquoise lagoons, swaying palm trees, and a traditional seafaring culture that remains deeply connected to the rhythms of the ocean. Despite the challenges of rising sea levels and its small size, the people of Tuvalu maintain a resilient and welcoming spirit, offering a rare and authentic experience of island life at the very edge of the world. It is a place of quiet beauty and a unique, off-the-beaten-path experience, where the traditional culture remains central to the nation's identity.",
    "placesToVisit": [
      {
        "name": "Funafuti",
        "summary": "The capital atoll, known for its vibrant culture and lagoon views."
      },
      {
        "name": "Nanumanga",
        "summary": "A stunning island famous for its world-class diving and snorkeling."
      }
    ],
    "travelTips": [
      "The Australian Dollar (AUD) is the official currency; cash is necessary.",
      "The best way to travel between atolls is by small plane or boat.",
      "The best time to visit is during the dry season from May to October."
    ],
    "heroImage": {
      "src": "/images/countries/tuvalu/hero.jpg",
      "alt": "A pristine turquoise lagoon in Tuvalu"
    }
  },
  "united-arab-emirates": {
    "slug": "uae",
    "name": "United Arab Emirates",
    "region": "Asia",
    "heroDescription": "The United Arab Emirates is a modern and wealthy desert nation at the tip of the Arabian Peninsula, where a futuristic skyline of bold and innovative architecture meets a rich maritime and trading heritage. The capital, Abu Dhabi, features an opulent palace, world-class museums, and a bustling souq that reflects a rich cultural depth. The country's coastline features pristine beaches and modern marinas, while the desert interior holds the echoes of ancient nomadic life. With its vibrant arts scene, world-class shopping, and its role as a global hub of diplomacy and sport, the UAE is a sophisticated and welcoming gateway to the Gulf.",
    "placesToVisit": [
      {
        "name": "Dubai",
        "summary": "A futuristic metropolis known for its iconic towers and vibrant food scene."
      },
      {
        "name": "Abu Dhabi",
        "summary": "The capital city known for its history, architecture, and the Grand Mosque."
      }
    ],
    "travelTips": [
      "The UAE Dirham (AED) is the currency; credit cards are used for everything.",
      "Learning basic Arabic phrases will greatly enhance your experience with locals.",
      "The best time to visit is during the cooler months from November to March."
    ],
    "heroImage": {
      "src": "/images/countries/uae/hero.jpg",
      "alt": "The futuristic skyline of Dubai at night"
    }
  },
  "uganda": {
    "slug": "uganda",
    "name": "Uganda",
    "region": "Africa",
    "heroDescription": "Uganda, the 'Pearl of Africa,' is a land of stunning mountain scenery, vibrant culture, and a resilient, welcoming spirit. It is a premier destination for wildlife viewing, with the Bwindi Impenetrable National Park offering some of the most spectacular and challenging trails for gorilla trekking in Africa. The country's landscape is defined by its high-altitude plateaus, thundering waterfalls, and unique biodiversity in its national parks. With its warm hospitality and its raw, untamed beauty, Uganda offers a rare and authentic experience of mountain life, where the traditional culture remains central to the nation's identity.",
    "placesToVisit": [
      {
        "name": "Bwindi Impenetrable Forest",
        "summary": "A world-famous destination for gorilla trekking and mountain hiking."
      },
      {
        "name": "Murchison Falls",
        "summary": "A spectacular national park known for its thundering waterfalls and wildlife."
      }
    ],
    "travelTips": [
      "The Ugandan Shilling (UGX) is the currency; cash is necessary outside major cities.",
      "Learning basic English or Swahili phrases will greatly enhance your experience.",
      "The best time to visit is during the dry season from June to September."
    ],
    "heroImage": {
      "src": "/images/countries/uganda/hero.jpg",
      "alt": "A mountain gorilla in the Bwindi Impenetrable Forest"
    }
  },
  "ukraine": {
    "slug": "ukraine",
    "name": "Ukraine",
    "region": "Europe",
    "heroDescription": "Ukraine is a land of captivating history, vibrant culture, and a spirit of innovation that has influenced the world. From the romantic streets of Kyiv and the historic spires of Lviv and Odesa to the rugged beauty of the Carpathian Mountains and the dramatic coastline of the Black Sea, the country offers an endless array of experiences. Its history is etched into grand palaces, intricate cathedrals, and the ruins of ancient empires, while its culture is celebrated through its world-renowned literature, music, and art. Ukraine is a destination that captivates the senses and enriches the soul, offering a journey of profound discovery.",
    "placesToVisit": [
      {
        "name": "Kyiv",
        "summary": "A vibrant capital city famous for its history, architecture, and food."
      },
      {
        "name": "Lviv",
        "summary": "A historic city known for its architecture, culture, and coffee scene."
      }
    ],
    "travelTips": [
      "The Hryvnia (UAH) is the currency; credit cards are widely accepted.",
      "Learning basic Ukrainian phrases will greatly improve your interactions.",
      "Check the latest security updates and travel with experienced local operators."
    ],
    "heroImage": {
      "src": "/images/countries/ukraine/hero.jpg",
      "alt": "The historic Pechersk Lavra in Kyiv"
    }
  },
  "united-kingdom": {
    "slug": "unitedkingdom",
    "name": "United Kingdom",
    "region": "Europe",
    "heroDescription": "The United Kingdom is a land of captivating history, vibrant culture, and a spirit of innovation that has influenced the world. From the romantic streets of London and the historic spires of Edinburgh and Cardiff to the rugged beauty of the Lake District and the dramatic coastline of the White Cliffs of Dover, the country offers an endless array of experiences. Its history is etched into grand palaces, intricate cathedrals, and the ruins of ancient empires, while its culture is celebrated through its world-renowned literature, music, and art. The UK is a destination that captivates the senses and enriches the soul.",
    "placesToVisit": [
      {
        "name": "London",
        "summary": "A vibrant capital city famous for its history, art, and iconic landmarks."
      },
      {
        "name": "Edinburgh",
        "summary": "A historic city known for its architecture, festivals, and castle."
      }
    ],
    "travelTips": [
      "The British Pound (GBP) is the currency; credit cards are used for everything.",
      "Learning basic English phrases will greatly improve your interactions.",
      "Driving is on the left side of the road."
    ],
    "heroImage": {
      "src": "/images/countries/unitedkingdom/hero.jpg",
      "alt": "The iconic Big Ben and Parliament in London"
    }
  },
  "uruguay": {
    "slug": "uruguay",
    "name": "Uruguay",
    "region": "Americas",
    "heroDescription": "Uruguay is a land of captivating history, vibrant culture, and a spirit of innovation that has influenced the world. From the romantic streets of Montevideo and the historic spires of Colonia del Sacramento and Punta del Este to the rugged beauty of the Rocha coast and the dramatic coastline of the Río de la Plata, the country offers an endless array of experiences. Its history is etched into grand palaces, intricate cathedrals, and the ruins of ancient empires, while its culture is celebrated through its world-renowned literature, music, and art. Uruguay is a destination that captivates the senses.",
    "placesToVisit": [
      {
        "name": "Montevideo",
        "summary": "A vibrant capital city famous for its history, architecture, and food."
      },
      {
        "name": "Colonia del Sacramento",
        "summary": "A historic city and a UNESCO World Heritage site with a rich history."
      }
    ],
    "travelTips": [
      "The Uruguayan Peso (UYU) is the currency; credit cards are widely accepted.",
      "Learning basic Spanish phrases will greatly improve your interactions.",
      "The best time to visit is during the summer for the best weather."
    ],
    "heroImage": {
      "src": "/images/countries/uruguay/hero.jpg",
      "alt": "The historic streets of Colonia del Sacramento"
    }
  },
  "united-states-of-america": {
    "slug": "usa",
    "name": "United States of America",
    "region": "Americas",
    "heroDescription": "The United States is a continental giant of irrepressible energy and immense cultural diversity, where the futuristic skylines of New York and Los Angeles meet the ancient kingdoms of the north and the lush savannas of the south. Its culture is a rich tapestry of over 300 languages and ethnic groups, reflected in its world-class music, film, and culinary scenes. The country's landscape is a kaleidoscope of diverse environments, from the high-altitude peaks of the Rockies to the turquoise waters of the Florida Keys and the remote beauty of the Grand Canyon. The USA is a destination that captivates the senses.",
    "placesToVisit": [
      {
        "name": "New York City",
        "summary": "A vibrant metropolis known for its history, art, and iconic landmarks."
      },
      {
        "name": "Grand Canyon",
        "summary": "A spectacular natural wonder and a UNESCO World Heritage site."
      }
    ],
    "travelTips": [
      "The US Dollar (USD) is the currency; credit cards are used for everything.",
      "Tipping is standard in restaurants, usually between 15% and 20%.",
      "Learning basic English phrases will greatly improve your interactions."
    ],
    "heroImage": {
      "src": "/images/countries/usa/hero.jpg",
      "alt": "The iconic Statue of Liberty in New York City"
    }
  },
  "uzbekistan": {
    "slug": "uzbekistan",
    "name": "Uzbekistan",
    "region": "Asia",
    "heroDescription": "Uzbekistan is a land of profound history and extraordinary architecture, once the heart of the powerful Silk Road empires and a center of Islamic learning in Samarkand. The ancient ruins of Bukhara and the historic streets of Khiva stand as powerful symbols of human ambition and spiritual depth, while the country's landscape is a mix of high-altitude plateaus, fertile valleys, and the vast, wind-sculpted sands of the Kyzylkum Desert. Despite its turbulent recent history, Uzbekistan remains a place of deep cultural depth and resilient spirit, offering a profound and moving experience for those seeking to understand the roots of human society.",
    "placesToVisit": [
      {
        "name": "Samarkand",
        "summary": "A historic city famous for its stunning Islamic architecture and history."
      },
      {
        "name": "Bukhara",
        "summary": "A vibrant city known for its history, culture, and food."
      }
    ],
    "travelTips": [
      "The Som (UZS) is the currency; cash is necessary for most transactions.",
      "Learning basic Uzbek or Russian phrases will greatly enhance your experience.",
      "The best time to visit is during the spring or autumn for the best weather."
    ],
    "heroImage": {
      "src": "/images/countries/uzbekistan/hero.jpg",
      "alt": "The stunning Registan Square in Samarkand"
    }
  },
  "vanuatu": {
    "slug": "vanuatu",
    "name": "Vanuatu",
    "region": "Oceania",
    "heroDescription": "Vanuatu is a remote and beautiful archipelago of 83 islands scattered across the vast expanse of the western Pacific Ocean. It is a land of pristine turquoise lagoons, lush rainforests, and a traditional seafaring culture that remains deeply connected to the rhythms of the ocean. The islands are famous for their world-class diving and snorkeling, with the SS President Coolidge offering a surreal landscape of sunken WWII wrecks and vibrant coral reefs. Despite its small size, Vanuatu is a global leader in marine conservation, providing a rare and authentic experience of island life at the very edge of the world, where the traditional culture remains central to the nation's identity.",
    "placesToVisit": [
      {
        "name": "Port Vila",
        "summary": "The vibrant capital city known for its history, culture, and food."
      },
      {
        "name": "Mount Yasur",
        "summary": "One of the world's most accessible active volcanoes, located on Tanna Island."
      }
    ],
    "travelTips": [
      "The Vatu (VUV) is the currency; cash is necessary for most transactions.",
      "Learning basic Bislama phrases will greatly enhance your experience with locals.",
      "The best time to visit is during the dry season from May to October."
    ],
    "heroImage": {
      "src": "/images/countries/vanuatu/hero.jpg",
      "alt": "The active volcano Mount Yasur in Vanuatu"
    }
  },
  "venezuela": {
    "slug": "venezuela",
    "name": "Venezuela",
    "region": "Americas",
    "heroDescription": "Venezuela is a land of striking contrasts and immense natural beauty, where the futuristic skyline of Caracas meets the ancient, traditional cultures of the indigenous peoples and the lush rainforests of the interior. The Angel Falls, the world's highest thundering waterfall, stands as a powerful symbol of nature's raw power, while the Los Roques Archipelago offers a tropical paradise of pristine beaches and turquoise waters. The country's landscape is a kaleidoscope of diverse environments, from the high-altitude peaks of the Andes to the thundering waterfalls of the Gran Sabana. Venezuela is a destination of immense spirit and natural beauty.",
    "placesToVisit": [
      {
        "name": "Angel Falls",
        "summary": "The world's highest single-drop waterfall and a spectacular natural wonder."
      },
      {
        "name": "Los Roques",
        "summary": "A stunning archipelago and a sanctuary for unique marine life."
      }
    ],
    "travelTips": [
      "The Bolívar (VES) is the currency; check the latest exchange rates.",
      "Learning basic Spanish phrases will greatly enhance your experience with locals.",
      "Check the latest security updates and travel with experienced local operators."
    ],
    "heroImage": {
      "src": "/images/countries/venezuela/hero.jpg",
      "alt": "The thundering majesty of Angel Falls"
    }
  },
  "viet-nam": {
    "slug": "vietnam",
    "name": "Viet Nam",
    "region": "Asia",
    "heroDescription": "Viet Nam is a land of golden temples, sun-drenched rivers, and infectious energy, where the futuristic skyline of Ho Chi Minh City meets the ancient ruins of Hue and the lush jungles of the north. Its culture is a rich tapestry of Buddhist traditions and modern Pacific influences, reflected in its world-class culinary scene and its passionate love for life. The Mekong River serves as the nation's lifeblood, winding through a landscape of rolling savannas and vibrant markets. With its warm hospitality and its pristine natural beauty, Viet Nam is a premier destination for adventure and serenity, offering a journey of profound discovery.",
    "placesToVisit": [
      {
        "name": "Ha Long Bay",
        "summary": "A stunning turquoise bay and a UNESCO World Heritage site."
      },
      {
        "name": "Hoi An",
        "summary": "A historic city famous for its architecture, food, and lanterns."
      }
    ],
    "travelTips": [
      "The Dong (VND) is the currency; cash is necessary for most transactions.",
      "Learning basic Vietnamese phrases will greatly enhance your experience with locals.",
      "The best time to visit is during the spring or autumn for the best weather."
    ],
    "heroImage": {
      "src": "/images/countries/vietnam/hero.jpg",
      "alt": "The stunning limestone karsts of Ha Long Bay"
    }
  },
  "yemen": {
    "slug": "yemen",
    "name": "Yemen",
    "region": "Asia",
    "heroDescription": "Yemen is a land of profound history and extraordinary architecture, once the heart of the powerful ancient kingdoms and a center of Islamic learning in Sana'a. The ancient ruins of Shibam and the historic streets of Socotra stand as powerful symbols of human ambition and spiritual depth, while the country's landscape is a mix of high-altitude plateaus, fertile valleys, and a sun-drenched coastline along the Arabian Sea. Despite its turbulent recent history, Yemen remains a place of deep cultural depth and resilient spirit, offering a profound and moving experience for those seeking to understand the roots of human society.",
    "placesToVisit": [
      {
        "name": "Sana'a",
        "summary": "One of the world's oldest continuously inhabited cities and a historic capital."
      },
      {
        "name": "Socotra Island",
        "summary": "A unique island famous for its alien-looking dragon's blood trees."
      }
    ],
    "travelTips": [
      "Arabic is the official language; basic phrases are essential for travel.",
      "The Yemeni Rial (YER) is the currency; cash is necessary.",
      "Check the latest security updates and travel with experienced local operators."
    ],
    "heroImage": {
      "src": "/images/countries/yemen/hero.jpg",
      "alt": "The unique dragon's blood trees of Socotra Island"
    }
  },
  "zambia": {
    "slug": "zambia",
    "name": "Zambia",
    "region": "Africa",
    "heroDescription": "Zambia is a land of stunning mountain scenery, vibrant culture, and a resilient, welcoming spirit. It is a premier destination for wildlife viewing, with the South Luangwa National Park offering some of the most spectacular and challenging trails for walking safaris in Africa. The country's landscape is defined by its high-altitude plateaus, thundering waterfalls, and unique biodiversity in its national parks. With its warm hospitality and its raw, untamed beauty, Zambia offers a rare and authentic experience of mountain life, where the traditional culture remains central to the nation's identity.",
    "placesToVisit": [
      {
        "name": "Victoria Falls",
        "summary": "One of the world's most spectacular and powerful waterfalls."
      },
      {
        "name": "South Luangwa",
        "summary": "A world-famous destination for wildlife viewing and walking safaris."
      }
    ],
    "travelTips": [
      "The Zambian Kwacha (ZMW) is the currency; credit cards are widely accepted in lodges.",
      "Learning basic English phrases will greatly enhance your experience with locals.",
      "The best time to visit is during the dry season from May to October."
    ],
    "heroImage": {
      "src": "/images/countries/zambia/hero.jpg",
      "alt": "The thundering majesty of Victoria Falls"
    }
  },
  "zimbabwe": {
    "slug": "zimbabwe",
    "name": "Zimbabwe",
    "region": "Africa",
    "heroDescription": "Zimbabwe is a land of stunning mountain scenery, vibrant culture, and a resilient, welcoming spirit. It is a premier destination for wildlife viewing, with the Hwange National Park offering some of the most spectacular and challenging trails for elephant safaris in Africa. The country's landscape is defined by its high-altitude plateaus, thundering waterfalls, and unique biodiversity in its national parks. With its warm hospitality and its raw, untamed beauty, Zimbabwe offers a rare and authentic experience of mountain life, where the traditional culture remains central to the nation's identity.",
    "placesToVisit": [
      {
        "name": "Victoria Falls",
        "summary": "One of the world's most spectacular and powerful waterfalls."
      },
      {
        "name": "Great Zimbabwe",
        "summary": "A historic site and a UNESCO World Heritage reminder of the ancient world."
      }
    ],
    "travelTips": [
      "Zimbabwe uses a multi-currency system; USD is widely accepted.",
      "Learning basic English or Shona phrases will greatly enhance your experience.",
      "The best time to visit is during the dry season from May to October."
    ],
    "heroImage": {
      "src": "/images/countries/zimbabwe/hero.jpg",
      "alt": "The ancient stone ruins of Great Zimbabwe"
    }
  }
}